[
  {
    "name": "‍ Dog Park",
    "street": "26720 W Firehawk Dr",
    "city": "Buckeye",
    "state": "AZ",
    "zip": "85396",
    "latitude": 33.6804742,
    "longitude": -112.6263453,
    "description": "Dog Park (4.5 stars from 46 reviews) is a popular destination for Buckeye dog owners, located at 26720 W Firehawk Dr. The park serves dog owners well, providing a destination the community values. Looking for more places to take your pup? Dog Park is another popular dog park just 1.5 miles away."
  },
  {
    "name": "Dog Park",
    "street": "N 260th Dr",
    "city": "Buckeye",
    "state": "AZ",
    "zip": "85396",
    "latitude": 33.6620439,
    "longitude": -112.6110256,
    "description": "In Buckeye, Dog Park carries 4.3 stars from 7 dog owner reviews. The park serves as a gathering spot for dog owners and their four-legged friends in the area. Looking to explore more? Dog Park is another dog-friendly park 1.5 miles from here."
  },
  {
    "name": "Snedigar Dog Park",
    "street": "917 W Kaibab Dr",
    "city": "Chandler",
    "state": "AZ",
    "zip": "85248",
    "latitude": 33.2426138,
    "longitude": -111.8619985,
    "description": "With 4.8 stars from 18 reviews, Snedigar Dog Park at 917 W Kaibab Dr has become a favorite among Chandler dog owners. For dog owners in the area, this park has become a trusted spot for time with their pups. Dog owners exploring the neighborhood can also bring their furry friends to Paseo Vista Recreation Area (2.1 miles)."
  },
  {
    "name": "Nozomi Dog Park",
    "street": "250 S Kyrene Rd",
    "city": "Chandler",
    "state": "AZ",
    "zip": "85226",
    "latitude": 33.297196,
    "longitude": -111.946748,
    "description": "Nozomi Dog Park at 250 S Kyrene Rd holds a 4.4-star rating from 202 Chandler dog owner visits. Open from 6am to 10pm, Tuesday through Sunday, local dog owners have time to explore with their furry companions. Looking to explore more? Pecos Park is another dog-friendly park 2.0 miles from here."
  },
  {
    "name": "Thorpe Bark Park",
    "street": "788 N Thorpe Rd",
    "city": "Flagstaff",
    "state": "AZ",
    "zip": "86001",
    "latitude": 35.2071667,
    "longitude": -111.6585998,
    "description": "For dog owners in the Flagstaff area, Thorpe Bark Park (788 N Thorpe Rd) offers a 4.6-star experience based on 751 reviews. For dog owners in the area, this park has become a trusted spot for time with their pups. Nearby, Bushmaster Park (3.2 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Bushmaster Park",
    "street": "3150 N Alta Vista Dr",
    "city": "Flagstaff",
    "state": "AZ",
    "zip": "86004",
    "latitude": 35.217955,
    "longitude": -111.6040502,
    "description": "At 3150 N Alta Vista Dr in Flagstaff, Bushmaster Park stands out with 4.5 stars from 1,331 happy dog owners. Open from 6am to 9pm daily, there's always time for dog owners to bring their pup for some quality time. For variety, many dog owners also bring their furry friends to Thorpe Bark Park (3.2 miles)—another great dog park in the area."
  },
  {
    "name": "Paloma Dog Park",
    "street": "Unnamed Road",
    "city": "Glendale",
    "state": "AZ",
    "zip": "85383",
    "latitude": 33.8047149,
    "longitude": -112.4209132,
    "description": "With 4.8 stars from 191 reviews, Paloma Dog Park has become a favorite among Glendale dog owners. Open from 6am to 10:30pm daily, dog owners have plenty of flexibility to plan a visit. Based on the reviews, dog owners can expect a reliable spot for spending time with their pup."
  },
  {
    "name": "Friendship Park",
    "street": "12325 W Mc",
    "city": "Glendale",
    "state": "AZ",
    "zip": "85323",
    "latitude": 33.4639208,
    "longitude": -112.3199302,
    "description": "Dog owners in Glendale have embraced Friendship Park (12325 W McDowell Rd) as a top destination—4.6 stars from 4,915 visits. Open from 6am to 10pm daily, dog owners have room to work around busy schedules. Dog owners in the area also love bringing their pups to Friendship Dog Park (0.3 miles) and Palm Valley Park (1.4 miles)."
  },
  {
    "name": "‍ Alta Vista Park",
    "street": "10631 W Williams Rd",
    "city": "Glendale",
    "state": "AZ",
    "zip": "85383",
    "latitude": 33.6888206,
    "longitude": -112.288334,
    "description": "Dog owners in Glendale have made Alta Vista Park at 10631 W Williams Rd a go-to spot, rating it 4.5 stars across 215 reviews. Open from 6am to 10:30pm daily, the park works well for dog owners with different schedules. For variety, the neighborhood offers more dog parks to explore: Alta Vista Park (0.0 miles) and Parkridge Park (1.9 miles)."
  },
  {
    "name": "‍ Fowler Park",
    "street": "1368 Kachina",
    "city": "Goodyear",
    "state": "AZ",
    "zip": "85307",
    "latitude": 33.541162,
    "longitude": -112.34983,
    "description": "Fowler Park at 1368 Kachina is well-regarded by Goodyear dog owners, holding 4.9 stars across 31 reviews. Dog owners in the area consistently choose this park as a go-to destination for their pups. Other dog parks in the area include Gateway Dog Park (2.7 miles) and Goodyear Community Park (4.2 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Sahuaro Ranch Park",
    "street": "9802 59th Ave",
    "city": "Goodyear",
    "state": "AZ",
    "zip": "85302",
    "latitude": 33.5764789,
    "longitude": -112.1878923,
    "description": "Sahuaro Ranch Park at 9802 59th Ave in Goodyear is a community favorite, with 4,075 dog owners giving it 4.7 stars. Open from 6am to 10pm daily, dog owners can plan visits around their pup's favorite times to be active. Other popular dog parks nearby include Sahuaro Ranch Dog Park (0.4 miles) and Sunnyslope Park (1.4 miles)—both favorites among local pup parents."
  },
  {
    "name": "Marketside Dog Park",
    "street": "1957 N Marketside Ave",
    "city": "Goodyear",
    "state": "AZ",
    "zip": "85396",
    "latitude": 33.4692965,
    "longitude": -112.5099142,
    "description": "With 4.7 stars from 21 reviews, Marketside Dog Park at 1957 N Marketside Ave has become a favorite among Goodyear dog owners. Dog owners in the area consistently choose this park as a go-to destination for their pups. Other dog parks in the area include Canada Village Park (3.6 miles) and Sundance Park (3.9 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Portales Park",
    "street": "15620 W Coronado Rd",
    "city": "Goodyear",
    "state": "AZ",
    "zip": "85395",
    "latitude": 33.4686935,
    "longitude": -112.3948254,
    "description": "Located at 15620 W Coronado Rd in Goodyear, Portales Park earns strong marks from local dog owners—4.6 stars from 16 reviews. The steady stream of dog owner visits speaks to the park's appeal. For a change of scenery, Bullard Wash Park is another dog-friendly destination 0.4 miles from here."
  },
  {
    "name": "169th Park",
    "street": "1987 S 169th Ave",
    "city": "Goodyear",
    "state": "AZ",
    "zip": "85338",
    "latitude": 33.4288071,
    "longitude": -112.422292,
    "description": "With 4.6 stars from 22 reviews, 169th Park at 1987 S 169th Ave has become a favorite among Goodyear dog owners. Open from 7am to 9pm daily, dog owners can easily fit a visit into busy schedules. For a change of scenery, Goodyear Recreation & Parks is another dog-friendly destination 2.0 miles from here."
  },
  {
    "name": "Palm Valley Park",
    "street": "13189 W Monte Vista Dr",
    "city": "Goodyear",
    "state": "AZ",
    "zip": "85395",
    "latitude": 33.4694554,
    "longitude": -112.342537,
    "description": "Palm Valley Park at 13189 W Monte Vista Dr is well-regarded by Goodyear dog owners, holding 4.6 stars across 160 reviews. Open from 6am to 10pm daily, the park accommodates early risers and evening visitors alike. Dog owners can also take their pups to nearby Parque de Paz (1.1 miles) or Friendship Dog Park (1.2 miles)."
  },
  {
    "name": "Goodyear Recreation & Parks",
    "street": "420 Estrella Pkwy",
    "city": "Goodyear",
    "state": "AZ",
    "zip": "85338",
    "latitude": 33.4448939,
    "longitude": -112.3924352,
    "description": "Dog owners in Goodyear have made Goodyear Recreation & Parks at 420 Estrella Pkwy a go-to spot, rating it 4.6 stars across 487 reviews. The steady stream of dog owner visits speaks to the park's appeal. For variety, the neighborhood offers more dog parks to explore: Bullard Wash Park (1.4 miles) and Roscoe, Goodyear, Dog Park (1.6 miles)."
  },
  {
    "name": "‍ Goodyear Community Park",
    "street": "3151 N Litchfield Rd",
    "city": "Goodyear",
    "state": "AZ",
    "zip": "85395",
    "latitude": 33.4806124,
    "longitude": -112.3588533,
    "description": "Dog owners in Goodyear have embraced Goodyear Community Park (3151 N Litchfield Rd) as a top destination—4.6 stars from 1,094 visits. Open from 6am to 10pm daily, dog owners can easily fit a visit into their day, whether morning or evening. Nearby, Palm Valley Park (1.2 miles) is another dog park favorite where you can take your four-legged friend."
  },
  {
    "name": "Sundance Park",
    "street": "22865 W Lower Buckeye Rd",
    "city": "Goodyear",
    "state": "AZ",
    "zip": "85326",
    "latitude": 33.4212052,
    "longitude": -112.5444951,
    "description": "1,312 dog owners have made Sundance Park (22865 W Lower Buckeye Rd) one of Goodyear's most trusted parks (4.6 stars). The park has earned genuine loyalty from dog owners who value what it offers. Nearby, Marketside Dog Park (3.9 miles) is another dog park favorite where you can take your four-legged friend."
  },
  {
    "name": "Bullard Wash Park",
    "street": "W Mc",
    "city": "Goodyear",
    "state": "AZ",
    "zip": "85395",
    "latitude": 33.4644696,
    "longitude": -112.3906208,
    "description": "In Goodyear, Bullard Wash Park earns strong marks from local dog owners—4.5 stars from 49 reviews. Open from 6am to 10pm daily, there's room in the day for dog owners to bring their furry friends. More dog-friendly parks nearby include Portales Park (0.4 miles) and Roscoe, Goodyear, Dog Park (0.4 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Roscoe, Goodyear, Dog Park",
    "street": "",
    "city": "Goodyear",
    "state": "AZ",
    "zip": "",
    "latitude": 33.4674695,
    "longitude": -112.3842224,
    "description": "In Goodyear, Roscoe, Goodyear, Dog Park earns strong marks from local dog owners—4.5 stars from 376 reviews. Open from 6am to 10pm daily, the park works well for dog owners with different schedules. For variety, the neighborhood offers more dog parks to explore: Bullard Wash Park (0.4 miles) and Portales Park (0.6 miles)."
  },
  {
    "name": "Canada Village Park",
    "street": "1489 N 181st Ave",
    "city": "Goodyear",
    "state": "AZ",
    "zip": "85395",
    "latitude": 33.4627641,
    "longitude": -112.4484101,
    "description": "Located at 1489 N 181st Ave, Canada Village Park in Goodyear is rated 4.2 stars by 15 dog owners. The park serves as a gathering spot for dog owners and their four-legged friends in the area. Nearby dog parks worth exploring with your pup include 169th Park (2.8 miles) and Portales Park (3.1 miles)."
  },
  {
    "name": "Loma Linda Park",
    "street": "400 E Loma Linda Blvd",
    "city": "Goodyear",
    "state": "AZ",
    "zip": "85338",
    "latitude": 33.4429856,
    "longitude": -112.3565847,
    "description": "289 dog owners have reviewed Loma Linda Park at 400 E Loma Linda Blvd in Goodyear, averaging 4.4 stars. Open from 8am to 10pm daily, the park is accessible for dog owners in the area. Dog owners in the neighborhood can also take their furry friends to Parque de Paz, 0.9 miles away."
  },
  {
    "name": "Parque de Paz",
    "street": "N Palo Verde Dr",
    "city": "Goodyear",
    "state": "AZ",
    "zip": "85338",
    "latitude": 33.4529832,
    "longitude": -112.3453621,
    "description": "In Goodyear, Parque de Paz carries 4.2 stars from 60 dog owner reviews. For dog owners in the neighborhood, this park offers a place to take their pups. Nearby dog parks worth exploring with your pup include Loma Linda Park (0.9 miles) and Palm Valley Park (1.1 miles)."
  },
  {
    "name": "London Bridge Beach",
    "street": "1340 Mc",
    "city": "Lake Havasu City",
    "state": "AZ",
    "zip": "86403",
    "latitude": 34.4827902,
    "longitude": -114.3109634,
    "description": "Dog owners in Lake Havasu City have embraced London Bridge Beach (1340 McCulloch Blvd N) as a top destination—4.7 stars from 2,788 visits. Open from 5am to 11pm daily, the park accommodates a variety of dog owner schedules and routines. Want to give your pup even more adventure? Jack Hardie Park is another beloved dog park just 0.6 miles away."
  },
  {
    "name": "Rotary Community Park",
    "street": "1400 S Smoketree Ave",
    "city": "Lake Havasu City",
    "state": "AZ",
    "zip": "86403",
    "latitude": 34.47744,
    "longitude": -114.3318367,
    "description": "2,334 dog owners have made Rotary Community Park (1400 S Smoketree Ave) one of Lake Havasu City's most trusted parks (4.7 stars). Open from 8am to 11pm daily, dog owners have room to work around busy schedules. For variety, many dog owners also bring their furry friends to Jack Hardie Park (1.0 miles)—another great dog park in the area."
  },
  {
    "name": "Buckskin Mountain State Park",
    "street": "5476 AZ-95",
    "city": "Lake Havasu City",
    "state": "AZ",
    "zip": "85344",
    "latitude": 34.2569209,
    "longitude": -114.1490216,
    "description": "Dog owners in Lake Havasu City have embraced Buckskin Mountain State Park (5476 AZ-95) as a top destination—4.7 stars from 1,134 visits. The park has earned genuine loyalty from dog owners who value what it offers. With this many positive experiences, dog owners can visit with confidence."
  },
  {
    "name": "Cattail Cove State Park",
    "street": "AZ-95",
    "city": "Lake Havasu City",
    "state": "AZ",
    "zip": "86406",
    "latitude": 34.4495781,
    "longitude": -114.244153,
    "description": "Dog owners in Lake Havasu City have made Cattail Cove State Park a go-to spot, rating it 4.7 stars across 974 reviews. Dog owners frequent this park for its consistent quality and welcoming atmosphere. For variety, the neighborhood offers more dog parks to explore: SARA Park (1.2 miles) and Jack Hardie Park (4.4 miles)."
  },
  {
    "name": "‍ Jack Hardie Park",
    "street": "2470 Baron Dr",
    "city": "Lake Havasu City",
    "state": "AZ",
    "zip": "86403",
    "latitude": 34.4755085,
    "longitude": -114.3149602,
    "description": "Jack Hardie Park at 2470 Baron Dr is well-regarded by Lake Havasu City dog owners, holding 4.6 stars across 261 reviews. Open from 6am to 9pm daily, the park accommodates early risers and evening visitors alike. For variety, the neighborhood offers more dog parks to explore: London Bridge Beach (0.6 miles) and Rotary Community Park (1.0 miles)."
  },
  {
    "name": "SARA Park",
    "street": "1740 Mc",
    "city": "Lake Havasu City",
    "state": "AZ",
    "zip": "86406",
    "latitude": 34.453348,
    "longitude": -114.2647708,
    "description": "At 1740 McCulloch Blvd S in Lake Havasu City, SARA Park has built a loyal following—4.6 stars from 308 dog owner reviews. Dog owners frequent this park for its consistent quality and welcoming atmosphere. Looking for more places to take your pup? Cattail Cove State Park is another popular dog park just 1.2 miles away."
  },
  {
    "name": "‍ Lake Havasu State Park",
    "street": "699 London Bridge Rd",
    "city": "Lake Havasu City",
    "state": "AZ",
    "zip": "86403",
    "latitude": 34.4923786,
    "longitude": -114.360255,
    "description": "Local dog owners love Lake Havasu State Park at 699 London Bridge Rd in Lake Havasu City—4.6 stars from an impressive 4,758 reviews. For dog owners seeking a tried-and-true destination, this park delivers consistently. For variety, many dog owners also bring their furry friends to Rotary Community Park (1.9 miles)—another great dog park in the area."
  },
  {
    "name": "Avalon Park",
    "street": "1254 Avalon Ave",
    "city": "Lake Havasu City",
    "state": "AZ",
    "zip": "86404",
    "latitude": 34.5146603,
    "longitude": -114.3283794,
    "description": "299 dog owners have reviewed Avalon Park at 1254 Avalon Ave in Lake Havasu City, averaging 4.3 stars. This park provides dog owners in the community with a place to visit with their dogs. Dog owners in the neighborhood can also take their furry friends to Lake Havasu State Park, 2.4 miles away."
  },
  {
    "name": "Tangerine Sky Community Park",
    "street": "4411 W Tangerine Rd",
    "city": "Marana",
    "state": "AZ",
    "zip": "85658",
    "latitude": 32.4236491,
    "longitude": -111.0592471,
    "description": "With 4.8 stars from 439 reviews, Tangerine Sky Community Park at 4411 W Tangerine Rd has become a favorite among Marana dog owners. Open from 6am to 10pm daily, there's room in the day for dog owners to bring their furry friends. Dog owners can also take their pups to nearby Tangerine Sky Community - Dog (0.0 miles) or Arthur Pack Regional Park (3.4 miles)."
  },
  {
    "name": "Dove Mountain West Park",
    "street": "",
    "city": "Marana",
    "state": "AZ",
    "zip": "",
    "latitude": 32.4483736,
    "longitude": -111.211475,
    "description": "In Marana, Dove Mountain West Park earns strong marks from local dog owners—4.8 stars from 52 reviews. Dog owners in the area consistently choose this park as a go-to destination for their pups. Looking for more places to take your pup? Ora Mae Harn District Park is another popular dog park just 0.2 miles away."
  },
  {
    "name": "Ora Mae Harn District Park",
    "street": "13250 N Lon Adams Rd",
    "city": "Marana",
    "state": "AZ",
    "zip": "85653",
    "latitude": 32.4471664,
    "longitude": -111.2083434,
    "description": "At 13250 N Lon Adams Rd in Marana, Ora Mae Harn District Park has built a loyal following—4.6 stars from 357 dog owner reviews. Open from 6am to 10pm daily, the park accommodates early risers and evening visitors alike. Looking for more places to take your pup? Dove Mountain West Park is another popular dog park just 0.2 miles away."
  },
  {
    "name": "San Lucas Community Park",
    "street": "14040 N Adonis Rd",
    "city": "Marana",
    "state": "AZ",
    "zip": "85658",
    "latitude": 32.4601863,
    "longitude": -111.2113997,
    "description": "San Lucas Community Park (4.5 stars from 162 reviews) is a popular destination for Marana dog owners, located at 14040 N Adonis Rd. Open from 7am to 9pm daily, dog owners can plan visits around work or their pup's energy level. For variety, the neighborhood offers more dog parks to explore: Dove Mountain West Park (0.8 miles) and Ora Mae Harn District Park (0.9 miles)."
  },
  {
    "name": "Copper Sky Regional Park",
    "street": "44345 W Bowlin Rd",
    "city": "Maricopa",
    "state": "AZ",
    "zip": "85138",
    "latitude": 33.0436344,
    "longitude": -111.9868823,
    "description": "Local dog owners love Copper Sky Regional Park at 44345 W Bowlin Rd in Maricopa—4.7 stars from an impressive 2,103 reviews. Dog owners appreciate the reliable experience this park provides for their four-legged companions. Looking to mix things up? Copper Sky Dog Park is a nearby dog park 0.0 miles away that's worth exploring with your pup."
  },
  {
    "name": "‍ Copper Sky Dog Park",
    "street": "43935 W Bowlin Rd",
    "city": "Maricopa",
    "state": "AZ",
    "zip": "85138",
    "latitude": 33.0436344,
    "longitude": -111.9868823,
    "description": "Dog owners in the Maricopa area will find Copper Sky Dog Park at 43935 W Bowlin Rd—a local option for spending time with their pups. The park serves as a gathering spot for dog owners and their four-legged friends in the area. Dog owners in the neighborhood can also take their furry friends to Copper Sky Regional Park, 0.0 miles away."
  },
  {
    "name": "Riparian Preserve at Water",
    "street": "2757 E Guadalupe Rd",
    "city": "Mesa",
    "state": "AZ",
    "zip": "85234",
    "latitude": 33.3647956,
    "longitude": -111.734356,
    "description": "For Mesa dog owners, Riparian Preserve at Water at 2757 E Guadalupe Rd needs no introduction—4.8 stars, 6,797 reviews. Open from 5:30am to 10pm daily, visits fit naturally into any dog owner's routine. While you're in the area, dog owners also recommend taking your pup to Harmony Park, another excellent dog park 2.3 miles away."
  },
  {
    "name": "‍ Quail Run Park",
    "street": "4155 E Virginia St",
    "city": "Mesa",
    "state": "AZ",
    "zip": "85213",
    "latitude": 33.4773212,
    "longitude": -111.7823337,
    "description": "Quail Run Park at 4155 E Virginia St is well-regarded by Mesa dog owners, holding 4.7 stars across 374 reviews. The steady stream of dog owner visits speaks to the park's appeal. For variety, the neighborhood offers more dog parks to explore: Sheepherders Park (0.8 miles) and Quail Run Sports Complex (1.6 miles)."
  },
  {
    "name": "Rotor Park",
    "street": "9834 E Ignition Dr",
    "city": "Mesa",
    "state": "AZ",
    "zip": "85212",
    "latitude": 33.323574,
    "longitude": -111.6214085,
    "description": "Mesa dog owners rate Rotor Park at 9834 E Ignition Dr highly, with 4.7 stars from 32 visits. Local dog owners appreciate what this park offers their four-legged friends. Nearby, Mariposa Park (4.0 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Red Mountain Park",
    "street": "7745 E Brown Rd",
    "city": "Mesa",
    "state": "AZ",
    "zip": "85207",
    "latitude": 33.4368231,
    "longitude": -111.6642087,
    "description": "Dog owners in Mesa have embraced Red Mountain Park (7745 E Brown Rd) as a top destination—4.6 stars from 2,922 visits. The strong community of dog owners here reflects how much the park is valued. Looking to mix things up? Skyline Park is a nearby dog park 3.6 miles away that's worth exploring with your pup."
  },
  {
    "name": "Eldorado Park",
    "street": "2311 N Miller Rd",
    "city": "Mesa",
    "state": "AZ",
    "zip": "85257",
    "latitude": 33.473915,
    "longitude": -111.9165788,
    "description": "Eldorado Park at 2311 N Miller Rd is a favorite among Mesa dog owners, earning 4.6 stars from 2,316 reviews. Open from 6am to 10:30pm daily, dog owners can plan visits around their pup's favorite times to be active. Want to give your pup even more adventure? Osborn Park is another beloved dog park just 1.0 miles away."
  },
  {
    "name": "Dobson Ranch Park",
    "street": "2359 S Dobson Rd",
    "city": "Mesa",
    "state": "AZ",
    "zip": "85202",
    "latitude": 33.3716393,
    "longitude": -111.8801366,
    "description": "Dog owners in Mesa have embraced Dobson Ranch Park (2359 S Dobson Rd) as a top destination—4.6 stars from 1,053 visits. Open from 6am to 10pm daily, dog owners can easily fit a visit into their day, whether morning or evening. Looking to mix things up? Cole Park is a nearby dog park 1.5 miles away that's worth exploring with your pup."
  },
  {
    "name": "‍ Paseo Vista Recreation Area",
    "street": "3850 S Mc",
    "city": "Mesa",
    "state": "AZ",
    "zip": "85286",
    "latitude": 33.2505,
    "longitude": -111.8261,
    "description": "Dog owners in Mesa have made Paseo Vista Recreation Area at 3850 S McQueen Rd a go-to spot, rating it 4.6 stars across 379 reviews. The park serves dog owners well, providing a destination the community values. For a change of scenery, Snedigar Dog Park is another dog-friendly destination 2.1 miles from here."
  },
  {
    "name": "Desert Vista Dog Park",
    "street": "11800 Desert Vista",
    "city": "Mesa",
    "state": "AZ",
    "zip": "85268",
    "latitude": 33.593074,
    "longitude": -111.706826,
    "description": "For dog owners in the Mesa area, Desert Vista Dog Park (11800 Desert Vista) offers a 4.6-star experience based on 236 reviews. Dog owners frequent this park for its consistent quality and welcoming atmosphere. Local dog owners have clearly found this to be a worthwhile destination."
  },
  {
    "name": "Osborn Park",
    "street": "7775 E Osborn Rd",
    "city": "Mesa",
    "state": "AZ",
    "zip": "85251",
    "latitude": 33.4877785,
    "longitude": -111.9135981,
    "description": "Mesa dog owners rate Osborn Park at 7775 E Osborn Rd highly, with 4.6 stars from 93 visits. Open from 7am to 10:30pm daily, dog owners have plenty of flexibility to plan a visit. More dog-friendly parks nearby include Desert Mountain Dog Park (0.8 miles) and Eldorado Park (1.0 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Pocket Park",
    "street": "22526 S Ellsworth Rd",
    "city": "Mesa",
    "state": "AZ",
    "zip": "85142",
    "latitude": 33.2439614,
    "longitude": -111.6345826,
    "description": "With 4.5 stars from 365 reviews, Pocket Park at 22526 S Ellsworth Rd has become a favorite among Mesa dog owners. Dog owners frequent this park for its consistent quality and welcoming atmosphere. Based on the reviews, dog owners can expect a reliable spot for spending time with their pup."
  },
  {
    "name": "Quail Run Sports Complex",
    "street": "4155 E Virginia St",
    "city": "Mesa",
    "state": "AZ",
    "zip": "85215",
    "latitude": 33.4771898,
    "longitude": -111.7553341,
    "description": "Quail Run Sports Complex at 4155 E Virginia St is well-regarded by Mesa dog owners, holding 4.5 stars across 444 reviews. Open from 6am to 10pm daily, the park offers flexibility for dog owners with varying routines. For a change of scenery, Sheepherders Park is another dog-friendly destination 1.5 miles from here."
  },
  {
    "name": "Skyline Park",
    "street": "655 S Crismon Rd",
    "city": "Mesa",
    "state": "AZ",
    "zip": "85208",
    "latitude": 33.4039149,
    "longitude": -111.6152699,
    "description": "With 4.5 stars across 1,545 reviews, Skyline Park at 655 S Crismon Rd has clearly won over Mesa dog owners. Open from 6am to 10pm daily, dog owners can plan visits around their pup's favorite times to be active. Other popular dog parks nearby include Mariposa Park (3.0 miles) and Red Mountain Park (3.6 miles)—both favorites among local pup parents."
  },
  {
    "name": "Pioneer Park",
    "street": "526 E Main St",
    "city": "Mesa",
    "state": "AZ",
    "zip": "85203",
    "latitude": 33.4151403,
    "longitude": -111.8199867,
    "description": "Local dog owners love Pioneer Park at 526 E Main St in Mesa—4.5 stars from an impressive 4,645 reviews. Open from 6am to 10pm daily, it's easy for dog owners to stop by whenever works best. For variety, many dog owners also bring their furry friends to City of Mesa Basin (1.7 miles)—another great dog park in the area."
  },
  {
    "name": "Los Alamos Park",
    "street": "2840 E Covina St",
    "city": "Mesa",
    "state": "AZ",
    "zip": "85213",
    "latitude": 33.4258409,
    "longitude": -111.770259,
    "description": "For dog owners in Mesa, Los Alamos Park at 2840 E Covina St has a 4.4-star rating (44 reviews). Open from 6am to 10pm daily, local dog owners have time to explore with their furry companions. Dog owners looking for variety can also visit City of Mesa Basin (1.6 miles) or Meadowgreen Park (1.7 miles) with their four-legged friends."
  },
  {
    "name": "City of Mesa Basin",
    "street": "814 N Harris Dr",
    "city": "Mesa",
    "state": "AZ",
    "zip": "85203",
    "latitude": 33.430088,
    "longitude": -111.7971044,
    "description": "City of Mesa Basin at 814 N Harris Dr in Mesa has 4.3 stars from 22 dog owner reviews. Open from 6am to 10pm daily, the park is accessible for dog owners in the area. For pups who want more adventure, Los Alamos Park is a nearby dog park worth visiting (1.6 miles)."
  },
  {
    "name": "Mariposa Park",
    "street": "2345 S Hawes Rd",
    "city": "Mesa",
    "state": "AZ",
    "zip": "85209",
    "latitude": 33.3747221,
    "longitude": -111.6534763,
    "description": "Located at 2345 S Hawes Rd, Mariposa Park in Mesa is rated 4.4 stars by 100 dog owners. Open from 7am to 7pm daily, the park is accessible for dog owners in the area. For pups who want more adventure, Monterey Park is a nearby dog park worth visiting (1.8 miles)."
  },
  {
    "name": "Paloma Community Park",
    "street": "29799 N Lake Pleasant Pkwy",
    "city": "Peoria",
    "state": "AZ",
    "zip": "85383",
    "latitude": 33.7528799,
    "longitude": -112.2534711,
    "description": "With 4.8 stars from 812 reviews, Paloma Community Park at 29799 N Lake Pleasant Pkwy has become a favorite among Peoria dog owners. Open from 6am to 10:30pm daily, dog owners can easily fit a visit into busy schedules. Nearby, Alta Vista Park (4.9 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Westland Park",
    "street": "31656 N Westland Rd",
    "city": "Peoria",
    "state": "AZ",
    "zip": "85383",
    "latitude": 33.7746456,
    "longitude": -112.3346809,
    "description": "Located at 31656 N Westland Rd in Peoria, Westland Park earns strong marks from local dog owners—4.6 stars from 48 reviews. Open from 6am to 10:30pm daily, dog owners have plenty of flexibility to plan a visit. Nearby, Trilogy Dog Park (1.3 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Trilogy Dog Park",
    "street": "30335 N 132nd Dr",
    "city": "Peoria",
    "state": "AZ",
    "zip": "85383",
    "latitude": 33.757733,
    "longitude": -112.3453074,
    "description": "At 30335 N 132nd Dr, Trilogy Dog Park has 4.2 stars based on 6 reviews from Peoria dog owners. Open from 7am to 7pm daily, local dog owners have time to explore with their furry companions. Dog owners might also enjoy Westland Park, another dog park just 1.3 miles away."
  },
  {
    "name": "Scotland Yard Park",
    "street": "9251 W Scotland Ave",
    "city": "Peoria",
    "state": "AZ",
    "zip": "85345",
    "latitude": 33.591543,
    "longitude": -112.2589515,
    "description": "For dog owners in Peoria, Scotland Yard Park at 9251 W Scotland Ave has a 4.4-star rating (298 reviews). Open from 6am to 10:30pm daily, local dog owners have time to explore with their furry companions. Nearby dog parks worth exploring with your pup include Scotland Yard Dog Park (0.0 miles) and Pioneer Community Park (2.1 miles)."
  },
  {
    "name": "Alta Vista Park",
    "street": "10631 W Williams Rd",
    "city": "Peoria",
    "state": "AZ",
    "zip": "85383",
    "latitude": 33.6888206,
    "longitude": -112.288334,
    "description": "Alta Vista Park at 10631 W Williams Rd holds a 4.3-star rating from 228 Peoria dog owner visits. Open from 6am to 10:30pm daily, local dog owners have time to explore with their furry companions. Dog owners might also enjoy Alta Vista Park, another dog park just 0.0 miles away."
  },
  {
    "name": "Desert Amethyst Park",
    "street": "18095 N 91st Ave",
    "city": "Peoria",
    "state": "AZ",
    "zip": "85382",
    "latitude": 33.6482277,
    "longitude": -112.254893,
    "description": "Dog owners in Peoria have rated Desert Amethyst Park (18095 N 91st Ave) 4.2 stars across 51 reviews. Open from 6am to 10:30pm daily, the park fits conveniently into different routines. Dog owners in the neighborhood can also take their furry friends to Parkridge Park, 1.5 miles away."
  },
  {
    "name": "Sunnyslope Park",
    "street": "9280 N 71st Ave",
    "city": "Peoria",
    "state": "AZ",
    "zip": "85345",
    "latitude": 33.5696447,
    "longitude": -112.211702,
    "description": "Located at 9280 N 71st Ave in Peoria, Sunnyslope Park earns strong marks from local dog owners—4.3 stars from 617 reviews. Open from 6am to 10:30pm daily, the park offers flexibility for dog owners with varying routines. Other dog parks in the area include Sunnyslope Dog Park (0.2 miles) and Sahuaro Ranch Dog Park (1.1 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "South Mountain Park",
    "street": "10919 S Central Ave",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85042",
    "latitude": 33.34703,
    "longitude": -112.084448,
    "description": "For Phoenix dog owners, South Mountain Park at 10919 S Central Ave needs no introduction—4.8 stars, 9,891 reviews. Open from 5am to 7pm daily, dog owners can find the perfect time for their furry friend. For dog owners wanting to explore more with their furry friends, Ma-Ha Tuak Park is another great dog park just 0.7 miles away."
  },
  {
    "name": "Mormon Trailhead",
    "street": "8610 S 24th St",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85042",
    "latitude": 33.3677118,
    "longitude": -112.0317075,
    "description": "1,623 dog owners have made Mormon Trailhead (8610 S 24th St) one of Phoenix's most trusted parks (4.8 stars). Open from 5am to 11pm daily, there's always time for dog owners to bring their pup for some quality time. Dog owners in the area also love bringing their pups to Copper Leaf Park (1.7 miles) and Esteban Park (2.5 miles)."
  },
  {
    "name": "Papago Park",
    "street": "625 N Galvin Pkwy",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85008",
    "latitude": 33.4516877,
    "longitude": -111.9556566,
    "description": "Papago Park at 625 N Galvin Pkwy has become essential for Phoenix dog owners, earning 4.7 stars from 12,335 visitors. Open from 5am to 11pm daily, dog owners have maximum flexibility to plan their visit. For more dog park adventures, explore Evelyn Hallman Park (1.2 miles) or Tempe Beach Park (1.5 miles) with your furry companion."
  },
  {
    "name": "Chaparral Park",
    "street": "5401 Hayden Rd",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85250",
    "latitude": 33.5148483,
    "longitude": -111.9069047,
    "description": "At 5401 Hayden Rd in Phoenix, Chaparral Park stands out with 4.7 stars from 2,891 happy dog owners. Open from 6am to 10:30pm daily, dog owners can plan visits around their pup's favorite times to be active. Nearby, Desert Mountain Dog Park (1.8 miles) is another dog park favorite where you can take your four-legged friend."
  },
  {
    "name": "‍ K9 Police Service Dog Memorial",
    "street": "1690 W Jefferson St",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85007",
    "latitude": 33.4470991,
    "longitude": -112.0954856,
    "description": "Located at 1690 W Jefferson St in Phoenix, K9 Police Service Dog Memorial earns strong marks from local dog owners—4.9 stars from 7 reviews. Dog owners frequent this park for its consistent quality and welcoming atmosphere. For a change of scenery, Thelda Williams Paw-Pup Park is another dog-friendly destination 1.1 miles from here."
  },
  {
    "name": "Encanto Park",
    "street": "2605 N 15th Ave",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85007",
    "latitude": 33.4777372,
    "longitude": -112.0912803,
    "description": "Encanto Park at 2605 N 15th Ave has become essential for Phoenix dog owners, earning 4.6 stars from 6,481 visitors. Open from 5:30am to 11pm daily, dog owners can find the perfect time for their furry friend. While you're in the area, dog owners also recommend taking your pup to Hance Park, another excellent dog park 1.3 miles away."
  },
  {
    "name": "Cosmo Dog Park",
    "street": "2502 E Ray Rd",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85296",
    "latitude": 33.3213635,
    "longitude": -111.7445525,
    "description": "Cosmo Dog Park at 2502 E Ray Rd is a favorite among Phoenix dog owners, earning 4.6 stars from 2,762 reviews. This park has clearly won over local dog owners who return again and again with their furry friends. Other popular dog parks nearby include Dog Park (0.4 miles) and Riparian Preserve at Water (3.1 miles)—both favorites among local pup parents."
  },
  {
    "name": "Deem Hills Recreation Area",
    "street": "5050 W Andrea Ln",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85083",
    "latitude": 33.7263663,
    "longitude": -112.1702021,
    "description": "Deem Hills Recreation Area at 5050 W Andrea Ln is well-regarded by Phoenix dog owners, holding 4.6 stars across 775 reviews. Open from 5am to 11pm daily, the park accommodates early risers and evening visitors alike. Dog owners can also take their pups to nearby Deem Hills Dog Park (0.1 miles) or Foothills Dog Park (4.7 miles)."
  },
  {
    "name": "Pinnacle Dog Park",
    "street": "20900 Black Mountain Blvd",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85050",
    "latitude": 33.6786075,
    "longitude": -112.0051957,
    "description": "Pinnacle Dog Park at 20900 Black Mountain Blvd is well-regarded by Phoenix dog owners, holding 4.6 stars across 384 reviews. Open from 5:30am to 11pm daily, the park offers flexibility for dog owners with varying routines. Nearby, Paradise Valley Park (2.3 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Ma-Ha Tuak Park",
    "street": "9832 S 7th Ave",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85041",
    "latitude": 33.3574682,
    "longitude": -112.0833341,
    "description": "Phoenix dog owners rate Ma-Ha Tuak Park at 9832 S 7th Ave highly, with 4.6 stars from 337 visits. Open from 5:30am to 10pm daily, dog owners have plenty of flexibility to plan a visit. Dog owners can also take their pups to nearby South Mountain Park (0.7 miles) or Mormon Trailhead (3.1 miles)."
  },
  {
    "name": "Sumida Park",
    "street": "1817 E Gardenia Ave",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85020",
    "latitude": 33.5448414,
    "longitude": -112.0374301,
    "description": "Sumida Park (4.6 stars from 254 reviews) is a popular destination for Phoenix dog owners, located at 1817 E Gardenia Ave. Open from 5:30am to 10pm daily, the park offers flexibility for dog owners with varying routines. Dog owners exploring the neighborhood can also bring their furry friends to Royal Palm Park (3.2 miles)."
  },
  {
    "name": "Thelda Williams Paw-Pup Park",
    "street": "200 W Jefferson St",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85007",
    "latitude": 33.4472337,
    "longitude": -112.0763979,
    "description": "Located at 200 W Jefferson St in Phoenix, Thelda Williams Paw-Pup Park earns strong marks from local dog owners—4.6 stars from 67 reviews. Open from 7am to 8pm daily, the park offers flexibility for dog owners with varying routines. Dog owners exploring the neighborhood can also bring their furry friends to Harmon Park (0.9 miles)."
  },
  {
    "name": "Copper Leaf Park",
    "street": "S 23rd St",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85040",
    "latitude": 33.3928046,
    "longitude": -112.0326016,
    "description": "For dog owners in the Phoenix area, Copper Leaf Park offers a 4.5-star experience based on 19 reviews. Open from 6am to 10pm daily, the park accommodates early risers and evening visitors alike. Dog owners exploring the neighborhood can also bring their furry friends to Esteban Park (1.4 miles)."
  },
  {
    "name": "Deem Hills Dog Park",
    "street": "26606 W Deem Hills Pkwy",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85083",
    "latitude": 33.7279956,
    "longitude": -112.1689079,
    "description": "Located at 26606 W Deem Hills Pkwy in Phoenix, Deem Hills Dog Park earns strong marks from local dog owners—4.5 stars from 230 reviews. Open from 5:30am to 11pm daily, the park accommodates early risers and evening visitors alike. For variety, the neighborhood offers more dog parks to explore: Deem Hills Recreation Area (0.1 miles) and Foothills Dog Park (4.8 miles)."
  },
  {
    "name": "PetSmart Dog Park",
    "street": "W Utopia Rd &N 19th Ave",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85027",
    "latitude": 33.6623935,
    "longitude": -112.099668,
    "description": "In Phoenix, PetSmart Dog Park earns strong marks from local dog owners—4.5 stars from 231 reviews. Open from 5:30am to 11pm daily, the park works well for dog owners with different schedules. Other dog parks in the area include Deer Valley Park (0.1 miles) and Turtle Rock Basin (2.8 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Pecos Park",
    "street": "17010 S 48th St",
    "city": "Phoenix",
    "state": "AZ",
    "zip": "85048",
    "latitude": 33.2918355,
    "longitude": -111.9804905,
    "description": "Pecos Park at 17010 S 48th St is well-regarded by Phoenix dog owners, holding 4.5 stars across 469 reviews. Open from 5:30am to 11pm daily, dog owners can easily fit a visit into busy schedules. Other dog parks in the area include Nozomi Dog Park (2.0 miles) and Tempe Sports Complex Dog Park (3.6 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "‍ Watson Lake Park",
    "street": "3101 Watson Lake Park Rd",
    "city": "Prescott Valley",
    "state": "AZ",
    "zip": "86301",
    "latitude": 34.5925804,
    "longitude": -112.4246578,
    "description": "Watson Lake Park at 3101 Watson Lake Park Rd is a favorite among Prescott Valley dog owners, earning 4.8 stars from 2,599 reviews. Open from 7am to 6pm daily, dog owners have room to work around busy schedules. Looking to mix things up? Willow Creek Beneful Dream is a nearby dog park 2.3 miles away that's worth exploring with your pup."
  },
  {
    "name": "‍ Fain Park",
    "street": "2200 N 5th St",
    "city": "Prescott Valley",
    "state": "AZ",
    "zip": "86314",
    "latitude": 34.5777233,
    "longitude": -112.3517405,
    "description": "With 4.7 stars across 1,170 reviews, Fain Park at 2200 N 5th St has clearly won over Prescott Valley dog owners. Open from 6am to 10pm daily, dog owners have plenty of flexibility to visit when it suits their schedule. For more dog park adventures, explore Town of Prescott Valley Dog (1.6 miles) or Prescott Valley Civic Center (1.6 miles) with your furry companion."
  },
  {
    "name": "Willow Creek Beneful Dream",
    "street": "3181 Willow Creek Rd",
    "city": "Prescott Valley",
    "state": "AZ",
    "zip": "86301",
    "latitude": 34.5961662,
    "longitude": -112.4647561,
    "description": "Willow Creek Beneful Dream (4.7 stars from 622 reviews) is a popular destination for Prescott Valley dog owners, located at 3181 Willow Creek Rd. Open from 7am to 10pm, Tuesday through Sunday, there's plenty of opportunity for dog owners to find a time that works. Nearby, Watson Lake Park (2.3 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Prescott Valley Community",
    "street": "9630 E Manzanita Cir",
    "city": "Prescott Valley",
    "state": "AZ",
    "zip": "86314",
    "latitude": 34.6099882,
    "longitude": -112.3025427,
    "description": "Prescott Valley Community (4.6 stars from 55 reviews) is a popular destination for Prescott Valley dog owners, located at 9630 E Manzanita Cir. Open from 6am to 10pm daily, dog owners can plan visits around work or their pup's energy level. Looking for more places to take your pup? George Andersen Park is another popular dog park just 0.7 miles away."
  },
  {
    "name": "George Andersen Park",
    "street": "9500 E Superstition Dr",
    "city": "Prescott Valley",
    "state": "AZ",
    "zip": "86314",
    "latitude": 34.60054,
    "longitude": -112.299959,
    "description": "Dog owners in Prescott Valley have made George Andersen Park at 9500 E Superstition Dr a go-to spot, rating it 4.5 stars across 135 reviews. Open from 6am to 10pm daily, there's room in the day for dog owners to bring their furry friends. Looking for more places to take your pup? Prescott Valley Community is another popular dog park just 0.7 miles away."
  },
  {
    "name": "Antelope Park",
    "street": "8075 E Powers Ave",
    "city": "Prescott Valley",
    "state": "AZ",
    "zip": "86314",
    "latitude": 34.6347957,
    "longitude": -112.3267481,
    "description": "For dog owners in the Prescott Valley area, Antelope Park (8075 E Powers Ave) offers a 4.5-star experience based on 284 reviews. Open from 5am to 10pm daily, the park works well for dog owners with different schedules. Dog owners exploring the neighborhood can also bring their furry friends to Viewpoint Park (1.4 miles)."
  },
  {
    "name": "Bob Edwards Park",
    "street": "7201 E Long Look Dr",
    "city": "Prescott Valley",
    "state": "AZ",
    "zip": "86314",
    "latitude": 34.6004664,
    "longitude": -112.3385844,
    "description": "For dog owners in the Prescott Valley area, Bob Edwards Park (7201 E Long Look Dr) offers a 4.5-star experience based on 458 reviews. Open from 6am to 10pm daily, the park accommodates early risers and evening visitors alike. Dog owners can also take their pups to nearby Prescott Valley Civic Center (0.3 miles) or Town of Prescott Valley Dog (0.5 miles)."
  },
  {
    "name": "Mountain Valley Park",
    "street": "8600 E Nace Ln",
    "city": "Prescott Valley",
    "state": "AZ",
    "zip": "86314",
    "latitude": 34.6010144,
    "longitude": -112.3208393,
    "description": "Dog owners in Prescott Valley have made Mountain Valley Park at 8600 E Nace Ln a go-to spot, rating it 4.5 stars across 724 reviews. Open from 6am to 10pm daily, there's room in the day for dog owners to bring their furry friends. For a change of scenery, South Tonto Park is another dog-friendly destination 0.5 miles from here."
  },
  {
    "name": "Viewpoint Park",
    "street": "7301 E Park Ridge Dr",
    "city": "Prescott Valley",
    "state": "AZ",
    "zip": "86315",
    "latitude": 34.6524699,
    "longitude": -112.3395519,
    "description": "Viewpoint Park at 7301 E Park Ridge Dr holds a 4.4-star rating from 218 Prescott Valley dog owner visits. Open from 6am to 10pm daily, the park gives dog owners in the neighborhood time to bring their pups. Dog owners might also enjoy Antelope Park, another dog park just 1.4 miles away."
  },
  {
    "name": "‍ Prescott Valley Civic Center",
    "street": "7501 Skoog Blvd",
    "city": "Prescott Valley",
    "state": "AZ",
    "zip": "86314",
    "latitude": 34.596458,
    "longitude": -112.33491,
    "description": "Located at 7501 Skoog Blvd, Prescott Valley Civic Center in Prescott Valley is rated 4.3 stars by 99 dog owners. Dog owners in the area appreciate having a local spot to bring their pups. Looking to explore more? Town of Prescott Valley Dog is another dog-friendly park 0.1 miles from here."
  },
  {
    "name": "‍ Town of Prescott Valley Dog",
    "street": "",
    "city": "Prescott Valley",
    "state": "AZ",
    "zip": "",
    "latitude": 34.5950776,
    "longitude": -112.3338634,
    "description": "Town of Prescott Valley Dog in Prescott Valley is rated 4.3 stars by 302 dog owners. Open from 7am to 7pm daily, dog owners can stop by when it fits their schedule. Dog owners looking for variety can also visit Prescott Valley Civic Center (0.1 miles) or Bob Edwards Park (0.5 miles) with their four-legged friends."
  },
  {
    "name": "‍ South Tonto Park",
    "street": "4050 N Tonto Way",
    "city": "Prescott Valley",
    "state": "AZ",
    "zip": "86314",
    "latitude": 34.6076056,
    "longitude": -112.3254397,
    "description": "Located at 4050 N Tonto Way, South Tonto Park in Prescott Valley is rated 4.2 stars by 77 dog owners. Open from 6am to 10pm daily, the park gives dog owners in the neighborhood time to bring their pups. Dog owners might also enjoy North Tonto Park, another dog park just 0.3 miles away."
  },
  {
    "name": "North Tonto Park",
    "street": "4700 N Tonto Way",
    "city": "Prescott Valley",
    "state": "AZ",
    "zip": "86314",
    "latitude": 34.61175,
    "longitude": -112.325465,
    "description": "North Tonto Park at 4700 N Tonto Way holds a 4.2-star rating from 108 Prescott Valley dog owner visits. Open from 6am to 10pm daily, dog owners have a window to spend time with their pups. Dog owners looking for variety can also visit South Tonto Park (0.3 miles) or Mountain Valley Park (0.8 miles) with their four-legged friends."
  },
  {
    "name": "George 'Doc' Cavalliere Park",
    "street": "27775 N Alma School Pkwy",
    "city": "Scottsdale",
    "state": "AZ",
    "zip": "85262",
    "latitude": 33.7363372,
    "longitude": -111.8458175,
    "description": "George 'Doc' Cavalliere Park at 27775 N Alma School Pkwy is well-regarded by Scottsdale dog owners, holding 4.8 stars across 169 reviews. Open from 6am to 10:30pm daily, there's plenty of opportunity for dog owners to find a time that works. For a change of scenery, Sonoran Hills Park is another dog-friendly destination 4.7 miles from here."
  },
  {
    "name": "Lost Dog Wash Trailhead",
    "street": "12601 N 124th St",
    "city": "Scottsdale",
    "state": "AZ",
    "zip": "85259",
    "latitude": 33.6003432,
    "longitude": -111.8118966,
    "description": "For dog owners in the Scottsdale area, Lost Dog Wash Trailhead (12601 N 124th St) offers a 4.8-star experience based on 78 reviews. Open from 6am to 6pm daily, there's room in the day for dog owners to bring their furry friends. Dog owners exploring the neighborhood can also bring their furry friends to Horizon Dog Park (4.0 miles)."
  },
  {
    "name": "Sonoran Hills Park",
    "street": "7625 E Williams Dr",
    "city": "Scottsdale",
    "state": "AZ",
    "zip": "85255",
    "latitude": 33.6909512,
    "longitude": -111.9063828,
    "description": "Dog owners in Scottsdale have made Sonoran Hills Park at 7625 E Williams Dr a go-to spot, rating it 4.7 stars across 114 reviews. Open from 5am to 10pm daily, dog owners can easily fit a visit into busy schedules. Other dog parks in the area include George 'Doc' Cavalliere Park (4.7 miles) and Horizon Dog Park (4.9 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Mescal Park",
    "street": "11015 N 68th Pl",
    "city": "Scottsdale",
    "state": "AZ",
    "zip": "85254",
    "latitude": 33.5860784,
    "longitude": -111.9341079,
    "description": "Located at 11015 N 68th Pl, Mescal Park in Scottsdale is rated 4.4 stars by 47 dog owners. Open from 6am to 10:30pm daily, dog owners in the area can work a visit into their day. For pups who want more adventure, Horizon Dog Park is a nearby dog park worth visiting (4.5 miles)."
  },
  {
    "name": "Desert Mountain Dog Park",
    "street": "",
    "city": "Scottsdale",
    "state": "AZ",
    "zip": "",
    "latitude": 33.4942189,
    "longitude": -111.926018,
    "description": "Desert Mountain Dog Park serves dog owners in the Scottsdale neighborhood looking for a place to visit with their pups. Open from 5am to 10pm daily, the park is accessible for dog owners in the area. Looking to explore more? Osborn Park is another dog-friendly park 0.8 miles from here."
  },
  {
    "name": "Surprise Community Park",
    "street": "16089 N Bullard Ave",
    "city": "Surprise",
    "state": "AZ",
    "zip": "85374",
    "latitude": 33.6383776,
    "longitude": -112.376687,
    "description": "Dog owners in Surprise have embraced Surprise Community Park (16089 N Bullard Ave) as a top destination—4.7 stars from 3,188 visits. Open from 6am to 10pm daily, dog owners have room to work around busy schedules. Dog owners in the area also love bringing their pups to Large Dog Park (0.8 miles) and Dog Park (3.8 miles)."
  },
  {
    "name": "Surprise Farms Community Park",
    "street": "17894 W Westpark Blvd",
    "city": "Surprise",
    "state": "AZ",
    "zip": "85388",
    "latitude": 33.6271329,
    "longitude": -112.4438935,
    "description": "Dog owners in Surprise have made Surprise Farms Community Park at 17894 W Westpark Blvd a go-to spot, rating it 4.6 stars across 618 reviews. Open from 6am to 10pm daily, there's room in the day for dog owners to bring their furry friends. Nearby, Dog Park (0.4 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Large Dog Park",
    "street": "",
    "city": "Surprise",
    "state": "AZ",
    "zip": "",
    "latitude": 33.629247,
    "longitude": -112.3681428,
    "description": "With 4.5 stars from 160 reviews, Large Dog Park has become a favorite among Surprise dog owners. Open from 6am to 10pm, every day except Wednesday, there's plenty of opportunity for dog owners to find a time that works. Other dog parks in the area include Surprise Community Park (0.8 miles) and Dog Park (4.3 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Gateway Dog Park",
    "street": "W Cinnabar Ave",
    "city": "Surprise",
    "state": "AZ",
    "zip": "85335",
    "latitude": 33.5744214,
    "longitude": -112.3267118,
    "description": "Gateway Dog Park in Surprise has 4.3 stars from 89 dog owner reviews. Open from 6am to 9:30pm daily, the park is accessible for dog owners in the area. Dog owners in the neighborhood can also take their furry friends to Fowler Park, 2.7 miles away."
  },
  {
    "name": "Copper Park",
    "street": "W Tina Ln",
    "city": "Surprise",
    "state": "AZ",
    "zip": "85387",
    "latitude": 33.6837337,
    "longitude": -112.4529057,
    "description": "Dog owners in the Surprise area will find Copper Park—a local option for spending time with their pups. This park provides dog owners in the community with a place to visit with their dogs. Dog owners in the neighborhood can also take their furry friends to Dog Park, 3.6 miles away."
  },
  {
    "name": "‍ Evelyn Hallman Park",
    "street": "1900 N College Ave",
    "city": "Tempe",
    "state": "AZ",
    "zip": "85288",
    "latitude": 33.4506913,
    "longitude": -111.9352906,
    "description": "With 4.7 stars from 65 reviews, Evelyn Hallman Park at 1900 N College Ave has become a favorite among Tempe dog owners. Open from 5am to 11pm daily, there's room in the day for dog owners to bring their furry friends. Other dog parks in the area include Papago Bark Park (0.8 miles) and Papago Park (0.8 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "‍ Tempe Beach Park",
    "street": "80 W Rio Salado Pkwy",
    "city": "Tempe",
    "state": "AZ",
    "zip": "85281",
    "latitude": 33.4309522,
    "longitude": -111.9512762,
    "description": "Tempe Beach Park at 80 W Rio Salado Pkwy is one of the most beloved dog parks in Tempe—4.6 stars from an incredible 9,764 reviews. Open from 5am to 12am daily, dog owners rarely have to rush—there's time to let pups fully enjoy the space. Nearby, Papago Bark Park (1.3 miles) gives dog owners even more space to explore with their four-legged companions."
  },
  {
    "name": "Hanger Park",
    "street": "501 E Knox Rd",
    "city": "Tempe",
    "state": "AZ",
    "zip": "85284",
    "latitude": 33.3272501,
    "longitude": -111.931096,
    "description": "Located at 501 E Knox Rd in Tempe, Hanger Park earns strong marks from local dog owners—4.5 stars from 213 reviews. Open from 6am to 12am daily, there's plenty of opportunity for dog owners to find a time that works. Looking for more places to take your pup? Tempe Sports Complex Dog Park is another popular dog park just 1.6 miles away."
  },
  {
    "name": "Cole Park",
    "street": "2000 E Carson Dr",
    "city": "Tempe",
    "state": "AZ",
    "zip": "85282",
    "latitude": 33.3841527,
    "longitude": -111.9011703,
    "description": "140 dog owners have reviewed Cole Park at 2000 E Carson Dr in Tempe, averaging 4.4 stars. Open from 6am to 12am daily, dog owners have a window to spend time with their pups. Dog owners looking for variety can also visit Arredondo Park (0.9 miles) or Dobson Ranch Park (1.5 miles) with their four-legged friends."
  },
  {
    "name": "‍ Celaya Park",
    "street": "601 W Vaughn St",
    "city": "Tempe",
    "state": "AZ",
    "zip": "85283",
    "latitude": 33.360997,
    "longitude": -111.949509,
    "description": "For dog owners in Tempe, Celaya Park at 601 W Vaughn St has a 4.3-star rating (148 reviews). Open from 6am to 12am daily, dog owners have a window to spend time with their pups. For dog owners who like to explore, Tempe Sports Complex Dog Park (1.5 miles) and Svob Park (2.3 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "Arredondo Park",
    "street": "1302 E Carson Dr",
    "city": "Tempe",
    "state": "AZ",
    "zip": "85282",
    "latitude": 33.3835553,
    "longitude": -111.917216,
    "description": "At 1302 E Carson Dr, Arredondo Park has 4.3 stars based on 162 reviews from Tempe dog owners. Open from 6am to 12am daily, the park fits conveniently into different routines. For dog owners who like to explore, Cole Park (0.9 miles) and Dobson Ranch Park (2.3 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "‍ Svob Park",
    "street": "2600 W Vineyard Rd",
    "city": "Tempe",
    "state": "AZ",
    "zip": "85282",
    "latitude": 33.3855503,
    "longitude": -111.9754543,
    "description": "Located at 2600 W Vineyard Rd, Svob Park in Tempe is rated 4.3 stars by 231 dog owners. Open from 6am to 10pm daily, local dog owners have time to explore with their furry companions. Dog owners might also enjoy Esteban Park, another dog park just 2.2 miles away."
  },
  {
    "name": "Clark Park",
    "street": "1730 S Roosevelt St",
    "city": "Tempe",
    "state": "AZ",
    "zip": "85281",
    "latitude": 33.4101884,
    "longitude": -111.94795,
    "description": "Clark Park at 1730 S Roosevelt St in Tempe has 4.1 stars from 176 dog owner reviews. The park gives neighborhood dog owners a destination for outings with their four-legged friends. Dog owners might also enjoy Tempe Beach Park, another dog park just 1.4 miles away."
  },
  {
    "name": "McDonald Park",
    "street": "4100 N Harrison Rd",
    "city": "Tucson",
    "state": "AZ",
    "zip": "85749",
    "latitude": 32.2407451,
    "longitude": -110.7897569,
    "description": "McDonald Park (4.7 stars from 785 reviews) is a popular destination for Tucson dog owners, located at 4100 N Harrison Rd. Open from 5am to 10pm daily, the park accommodates early risers and evening visitors alike. For variety, the neighborhood offers more dog parks to explore: Jesse Owens Park (2.2 miles) and Udall Dog Park (2.7 miles)."
  },
  {
    "name": "Wagging Tails Dog Park",
    "street": "8330 E Escalante Rd",
    "city": "Tucson",
    "state": "AZ",
    "zip": "85730",
    "latitude": 32.177247,
    "longitude": -110.8131597,
    "description": "Wagging Tails Dog Park at 8330 E Escalante Rd is well-regarded by Tucson dog owners, holding 4.7 stars across 71 reviews. Open from 6am to 10:30pm, every day except Wednesday, dog owners can easily fit a visit into busy schedules. Other dog parks in the area include Lower Lincoln Park (0.1 miles) and Lincoln Park (0.3 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "‍ Gene C. Reid Park",
    "street": "900 S Randolph Way",
    "city": "Tucson",
    "state": "AZ",
    "zip": "85716",
    "latitude": 32.2118675,
    "longitude": -110.9243776,
    "description": "Gene C. Reid Park at 900 S Randolph Way in Tucson has earned its reputation with 4.6 stars from 7,472 dog owner reviews. Open from 6am to 10:30pm daily, there's plenty of opportunity for dog owners to experience what makes this park special. While you're in the area, dog owners also recommend taking your pup to Miko's Corner Playground Dog, another excellent dog park 0.3 miles away."
  },
  {
    "name": "Brandi Fenton Memorial Park",
    "street": "3482 E River Rd",
    "city": "Tucson",
    "state": "AZ",
    "zip": "85718",
    "latitude": 32.2766225,
    "longitude": -110.9078796,
    "description": "Brandi Fenton Memorial Park at 3482 E River Rd is a favorite among Tucson dog owners, earning 4.6 stars from 2,306 reviews. Open from 6am to 10pm daily, it's easy for dog owners to stop by whenever works best. Other popular dog parks nearby include George Mehl Family Foothills (0.0 miles) and Smiling Dog Ranch Dog Park (0.2 miles)—both favorites among local pup parents."
  },
  {
    "name": "Crossroads at Silverbell Distr",
    "street": "7548 N Silverbell Rd",
    "city": "Tucson",
    "state": "AZ",
    "zip": "85743",
    "latitude": 32.2978555,
    "longitude": -111.0461467,
    "description": "At 7548 N Silverbell Rd in Tucson, Crossroads at Silverbell Distr stands out with 4.6 stars from 1,354 happy dog owners. Open from 6am to 10pm daily, dog owners can easily fit a visit into their day, whether morning or evening. Keep the adventure going at other nearby dog parks like Danny Lopez Park (1.0 miles) or Flowing Wells District Park (3.2 miles)."
  },
  {
    "name": "Rillito River Park",
    "street": "4200 N Campbell Ave",
    "city": "Tucson",
    "state": "AZ",
    "zip": "85719",
    "latitude": 32.2228765,
    "longitude": -110.974847,
    "description": "1,311 dog owners have made Rillito River Park (4200 N Campbell Ave) one of Tucson's most trusted parks (4.6 stars). Open from 6am to 6pm daily, the park accommodates a variety of dog owner schedules and routines. For more dog park adventures, explore Iron Horse Dog Park (0.7 miles) or Iron Horse Park (0.8 miles) with your furry companion."
  },
  {
    "name": "Naranja Park",
    "street": "810 W Naranja Dr",
    "city": "Tucson",
    "state": "AZ",
    "zip": "85737",
    "latitude": 32.409677,
    "longitude": -110.9841437,
    "description": "Located at 810 W Naranja Dr in Tucson, Naranja Park earns strong marks from local dog owners—4.6 stars from 740 reviews. Open from 6am to 10pm daily, dog owners have plenty of flexibility to plan a visit. Dog owners can also take their pups to nearby Tangerine Sky Community - Dog (4.5 miles) or Tangerine Sky Community Park (4.5 miles)."
  },
  {
    "name": "Arthur Pack Regional Park",
    "street": "9101 N Thornydale Rd",
    "city": "Tucson",
    "state": "AZ",
    "zip": "85742",
    "latitude": 32.374983,
    "longitude": -111.0558353,
    "description": "With 4.6 stars from 454 reviews, Arthur Pack Regional Park at 9101 N Thornydale Rd has become a favorite among Tucson dog owners. Open from 7am to 6pm daily, the park offers flexibility for dog owners with varying routines. Dog owners can also take their pups to nearby Ann Day Community Park (2.8 miles) or Tangerine Sky Community - Dog (3.4 miles)."
  },
  {
    "name": "Ivan's Spot Dog Park",
    "street": "9820 Rees Loop",
    "city": "Tucson",
    "state": "AZ",
    "zip": "85747",
    "latitude": 32.102344,
    "longitude": -110.78235,
    "description": "Dog owners in Tucson have made Ivan's Spot Dog Park at 9820 Rees Loop a go-to spot, rating it 4.6 stars across 388 reviews. Open from 7am to 10pm daily, dog owners have plenty of flexibility to plan a visit. Other dog parks in the area include Purple Heart Park (0.7 miles) and Sierra Morado Park (3.0 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Purple Heart Park",
    "street": "9800 E Rita Rd",
    "city": "Tucson",
    "state": "AZ",
    "zip": "85747",
    "latitude": 32.1026003,
    "longitude": -110.7705475,
    "description": "Purple Heart Park at 9800 E Rita Rd is well-regarded by Tucson dog owners, holding 4.6 stars across 273 reviews. Open from 6am to 10:30pm daily, dog owners have plenty of flexibility to plan a visit. Dog owners can also take their pups to nearby Ivan's Spot Dog Park (0.7 miles) or Sierra Morado Park (2.9 miles)."
  },
  {
    "name": "Smiling Dog Ranch Dog Park",
    "street": "4110 E River Rd",
    "city": "Tucson",
    "state": "AZ",
    "zip": "85718",
    "latitude": 32.2775464,
    "longitude": -110.9051054,
    "description": "Located at 4110 E River Rd in Tucson, Smiling Dog Ranch Dog Park earns strong marks from local dog owners—4.6 stars from 236 reviews. Open from 6:30am to 9:30pm daily, dog owners can plan visits around work or their pup's energy level. Nearby, Brandi Fenton Memorial Park (0.2 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Lower Lincoln Park",
    "street": "8280 E Escalante Rd",
    "city": "Tucson",
    "state": "AZ",
    "zip": "85730",
    "latitude": 32.177243,
    "longitude": -110.8146651,
    "description": "For dog owners in the Tucson area, Lower Lincoln Park (8280 E Escalante Rd) offers a 4.6-star experience based on 231 reviews. Open from 6am to 10:30pm daily, there's room in the day for dog owners to bring their furry friends. Dog owners can also take their pups to nearby Wagging Tails Dog Park (0.1 miles) or Lincoln Park (0.2 miles)."
  },
  {
    "name": "‍ Iron Horse Dog Park",
    "street": "560 E 10th St",
    "city": "Tucson",
    "state": "AZ",
    "zip": "85719",
    "latitude": 32.2224258,
    "longitude": -110.9630005,
    "description": "With 4.8 stars from 9 reviews, Iron Horse Dog Park at 560 E 10th St has become a favorite among Tucson dog owners. Dog owners in the area consistently choose this park as a go-to destination for their pups. Dog owners exploring the neighborhood can also bring their furry friends to Iron Horse Park (0.1 miles)."
  },
  {
    "name": "Cherry Avenue Park",
    "street": "5085 S Cherry Ave",
    "city": "Tucson",
    "state": "AZ",
    "zip": "85706",
    "latitude": 32.1608078,
    "longitude": -110.9475195,
    "description": "Located at 5085 S Cherry Ave in Tucson, Cherry Avenue Park earns strong marks from local dog owners—4.6 stars from 29 reviews. Open from 6am to 10:30pm daily, dog owners can easily fit a visit into busy schedules. Dog owners exploring the neighborhood can also bring their furry friends to Mission Manor Park (2.2 miles)."
  },
  {
    "name": "Miko's Corner Playground Dog",
    "street": "S Country Club Rd",
    "city": "Tucson",
    "state": "AZ",
    "zip": "85716",
    "latitude": 32.2153479,
    "longitude": -110.9266248,
    "description": "For dog owners in the Tucson area, Miko's Corner Playground Dog offers a 4.5-star experience based on 780 reviews. Open from 7am to 10pm, every day except Wednesday, there's plenty of opportunity for dog owners to find a time that works. For variety, the neighborhood offers more dog parks to explore: Gene C. Reid Park (0.3 miles) and Feld Davis Pocket Park (1.2 miles)."
  },
  {
    "name": "Tahoe Park",
    "street": "2051 E Hampton St",
    "city": "Tucson",
    "state": "AZ",
    "zip": "85719",
    "latitude": 32.2477219,
    "longitude": -110.9418998,
    "description": "Tahoe Park at 2051 E Hampton St is well-regarded by Tucson dog owners, holding 4.5 stars across 157 reviews. Open from 6am to 10:30pm daily, the park accommodates early risers and evening visitors alike. Nearby, Conner Park (0.7 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Dog Bark Park",
    "street": "E Palo Verde St",
    "city": "Yuma",
    "state": "AZ",
    "zip": "85365",
    "latitude": 32.6767961,
    "longitude": -114.5944509,
    "description": "For dog owners in the Yuma area, Dog Bark Park offers a 4.6-star experience based on 489 reviews. Open from 6:30am to 9pm, every day except Tuesday, dog owners can easily fit a visit into busy schedules. Nearby, Terraces Park (3.8 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "‍ Foothills Optimist Park",
    "street": "10440 S Camino Del Sol",
    "city": "Yuma",
    "state": "AZ",
    "zip": "85367",
    "latitude": 32.6777553,
    "longitude": -114.4247708,
    "description": "Dog owners in Yuma have rated Foothills Optimist Park (10440 S Camino Del Sol) 4.4 stars across 15 reviews. This park provides dog owners in the community with a place to visit with their dogs. Looking to explore more? Saguaro Park is another dog-friendly park 3.1 miles from here."
  },
  {
    "name": "Terraces Park",
    "street": "2601 S View Pkwy",
    "city": "Yuma",
    "state": "AZ",
    "zip": "85365",
    "latitude": 32.6810743,
    "longitude": -114.5296013,
    "description": "20 dog owners have reviewed Terraces Park at 2601 S View Pkwy in Yuma, averaging 4.4 stars. Open from 6am to 10pm daily, the park fits conveniently into different routines. Dog owners in the neighborhood can also take their furry friends to Saguaro Park, 3.3 miles away."
  },
  {
    "name": "Saguaro Park",
    "street": "",
    "city": "Yuma",
    "state": "AZ",
    "zip": "",
    "latitude": 32.665135,
    "longitude": -114.4760316,
    "description": "Dog owners in Yuma have rated Saguaro Park 4.2 stars across 60 reviews. This park provides dog owners in the community with a place to visit with their dogs. Dog owners in the neighborhood can also take their furry friends to Foothills Optimist Park, 3.1 miles away."
  }
]