[
  {
    "name": "North Bentonville Trail",
    "street": "3000 NW A St",
    "city": "Bentonville",
    "state": "AR",
    "zip": "72712",
    "latitude": 36.4085588,
    "longitude": -94.2159146,
    "description": "North Bentonville Trail at 3000 NW A St is well-regarded by Bentonville dog owners, holding 4.9 stars across 169 reviews. The steady stream of dog owner visits speaks to the park's appeal. More dog-friendly parks nearby include Bark Park (0.7 miles) and Osage Dog Park (2.5 miles)—perfect for pups who love adventure."
  },
  {
    "name": "‍ Bentonville Bike Playground",
    "street": "",
    "city": "Bentonville",
    "state": "AR",
    "zip": "",
    "latitude": 36.3728538,
    "longitude": -94.2088172,
    "description": "In Bentonville, Bentonville Bike Playground has built a loyal following—4.8 stars from 93 dog owner reviews. Dog owners in the area consistently choose this park as a go-to destination for their pups. Looking for more places to take your pup? Osage Dog Park is another popular dog park just 0.0 miles away."
  },
  {
    "name": "Orchards Park",
    "street": "1100 NE John Deshields Blvd",
    "city": "Bentonville",
    "state": "AR",
    "zip": "72712",
    "latitude": 36.3769487,
    "longitude": -94.1859901,
    "description": "With 4.7 stars across 1,127 reviews, Orchards Park at 1100 NE John Deshields Blvd has clearly won over Bentonville dog owners. Open from 6am to 10pm daily, there's always time for dog owners to bring their pup for some quality time. Looking to mix things up? Osage Dog Park is a nearby dog park 1.3 miles away that's worth exploring with your pup."
  },
  {
    "name": "Bella Vista K9 Corral Dog Park",
    "street": "59 Glasgow Rd",
    "city": "Bentonville",
    "state": "AR",
    "zip": "72715",
    "latitude": 36.4819873,
    "longitude": -94.3218543,
    "description": "For dog owners in the Bentonville area, Bella Vista K9 Corral Dog Park (59 Glasgow Rd) offers a 4.6-star experience based on 95 reviews. Dog owners looking for a solid destination will find this park delivers. Local dog owners have clearly found this to be a worthwhile destination."
  },
  {
    "name": "‍ Creekside Park",
    "street": "3104 SW Bright Rd",
    "city": "Bentonville",
    "state": "AR",
    "zip": "72712",
    "latitude": 36.3551353,
    "longitude": -94.2329756,
    "description": "Located at 3104 SW Bright Rd in Bentonville, Creekside Park earns strong marks from local dog owners—4.5 stars from 100 reviews. Open from 6am to 11pm daily, there's plenty of opportunity for dog owners to find a time that works. Other dog parks in the area include Osage Park (1.1 miles) and Osage Dog Park (1.8 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Keller Road Dog Park",
    "street": "",
    "city": "Bentonville",
    "state": "AR",
    "zip": "",
    "latitude": 36.3652679,
    "longitude": -94.2886875,
    "description": "Dog owners in Bentonville have rated Keller Road Dog Park 4.2 stars across 18 reviews. This park provides dog owners in the community with a place to visit with their dogs. More dog parks in the area include Creekside Park (3.2 miles) and Osage Park (4.3 miles)—great options for mixing up your pup's routine."
  },
  {
    "name": "Freedom Park",
    "street": "957 E Main St",
    "city": "Fort Smith",
    "state": "AR",
    "zip": "72956",
    "latitude": 35.436895,
    "longitude": -94.3504717,
    "description": "Located at 957 E Main St in Fort Smith, Freedom Park earns strong marks from local dog owners—4.7 stars from 373 reviews. Open from 10am to 10pm daily, there's plenty of opportunity for dog owners to find a time that works. Other dog parks in the area include Fort Smith Park (1.3 miles) and Spradling Park (3.3 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "‍ Ronnie Udouj Walking Trail",
    "street": "6600 Grand Ave",
    "city": "Fort Smith",
    "state": "AR",
    "zip": "72904",
    "latitude": 35.384946,
    "longitude": -94.359725,
    "description": "For dog owners in the Fort Smith area, Ronnie Udouj Walking Trail (6600 Grand Ave) offers a 4.7-star experience based on 71 reviews. Open from 6am to 11pm daily, dog owners have plenty of flexibility to plan a visit. More dog-friendly parks nearby include Carol Ann Cross Park (1.4 miles) and Spradling Park (3.2 miles)—perfect for pups who love adventure."
  },
  {
    "name": "‍ Riley Farm Park",
    "street": "11598 Maple Park Dr",
    "city": "Fort Smith",
    "state": "AR",
    "zip": "72916",
    "latitude": 35.274433,
    "longitude": -94.3634145,
    "description": "For dog owners in the Fort Smith area, Riley Farm Park (11598 Maple Park Dr) offers a 4.6-star experience based on 36 reviews. Open from 6am to 11pm daily, dog owners can plan visits around work or their pup's energy level. For a change of scenery, Chaffee Crossing Dog Park is another dog-friendly destination 4.0 miles from here."
  },
  {
    "name": "‍ Carol Ann Cross Park",
    "street": "1601 S 74th St",
    "city": "Fort Smith",
    "state": "AR",
    "zip": "72903",
    "latitude": 35.366013,
    "longitude": -94.35054,
    "description": "Dog owners in Fort Smith have made Carol Ann Cross Park at 1601 S 74th St a go-to spot, rating it 4.5 stars across 928 reviews. Open from 6am to 11pm daily, there's room in the day for dog owners to bring their furry friends. Nearby, Ronnie Udouj Walking Trail (1.4 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Fort Smith Park",
    "street": "5301 Riverfront Dr",
    "city": "Fort Smith",
    "state": "AR",
    "zip": "72904",
    "latitude": 35.4299043,
    "longitude": -94.3715454,
    "description": "For dog owners in Fort Smith, Fort Smith Park at 5301 Riverfront Dr has a 4.4-star rating (417 reviews). Open from 6am to 11pm daily, dog owners can stop by when it fits their schedule. Dog owners looking for variety can also visit Freedom Park (1.3 miles) or Spradling Park (2.0 miles) with their four-legged friends."
  },
  {
    "name": "Spradling Park",
    "street": "2722 Spradling Ave",
    "city": "Fort Smith",
    "state": "AR",
    "zip": "72904",
    "latitude": 35.4151298,
    "longitude": -94.4019542,
    "description": "Dog owners in Fort Smith have rated Spradling Park (2722 Spradling Ave) 4.2 stars across 85 reviews. Open from 6am to 11pm daily, dog owners have a window to spend time with their pups. Looking to explore more? Fort Smith Park is another dog-friendly park 2.0 miles from here."
  },
  {
    "name": "‍ Chaffee Crossing Dog Park",
    "street": "8204 Veterans Ave",
    "city": "Fort Smith",
    "state": "AR",
    "zip": "72923",
    "latitude": 35.3201583,
    "longitude": -94.3191138,
    "description": "Located at 8204 Veterans Ave, Chaffee Crossing Dog Park offers Fort Smith dog owners a neighborhood destination for their four-legged friends. Open from 6am to 11pm daily, the park fits conveniently into different routines. Dog owners looking for variety can also visit Carol Ann Cross Park (3.6 miles) or Riley Farm Park (4.0 miles) with their four-legged friends."
  },
  {
    "name": "The Bark Park",
    "street": "408 Parkview St",
    "city": "Jonesboro",
    "state": "AR",
    "zip": "72401",
    "latitude": 35.8210205,
    "longitude": -90.7104755,
    "description": "With 5.0 stars from 6 reviews, The Bark Park at 408 Parkview St has become a favorite among Jonesboro dog owners. Dog owners frequent this park for its consistent quality and welcoming atmosphere. Nearby, Midtown Dog Park (0.9 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Midtown Dog Park",
    "street": "1110 S Church St",
    "city": "Jonesboro",
    "state": "AR",
    "zip": "72401",
    "latitude": 35.8326587,
    "longitude": -90.704138,
    "description": "For dog owners in Jonesboro, Midtown Dog Park at 1110 S Church St has a 4.1-star rating (46 reviews). Open from 7am to 8pm daily, dog owners can stop by when it fits their schedule. Looking to explore more? The Bark Park is another dog-friendly park 0.9 miles from here."
  },
  {
    "name": "Bark Bar",
    "street": "1201 S Spring St",
    "city": "Little Rock",
    "state": "AR",
    "zip": "72202",
    "latitude": 34.7375378,
    "longitude": -92.2758708,
    "description": "For dog owners in the Little Rock area, Bark Bar (1201 S Spring St) offers a 4.8-star experience based on 395 reviews. Dog owners in the area consistently choose this park as a go-to destination for their pups. For variety, the neighborhood offers more dog parks to explore: MacArthur Dog Park (0.6 miles) and MacArthur Park (0.7 miles)."
  },
  {
    "name": "Paws Park",
    "street": "",
    "city": "Little Rock",
    "state": "AR",
    "zip": "",
    "latitude": 34.7465071,
    "longitude": -92.2896267,
    "description": "Paws Park is well-regarded by Little Rock dog owners, holding 4.7 stars across 331 reviews. Dog owners in the area consistently choose this park as a go-to destination for their pups. Dog owners exploring the neighborhood can also bring their furry friends to Bark Bar (1.0 miles)."
  },
  {
    "name": "William E. Clark Presidential",
    "street": "618 President Clinton Ave",
    "city": "Little Rock",
    "state": "AR",
    "zip": "72201",
    "latitude": 34.7476096,
    "longitude": -92.2667322,
    "description": "Little Rock dog owners rate William E. Clark Presidential at 618 President Clinton Ave highly, with 4.6 stars from 245 visits. Dog owners in the area consistently choose this park as a go-to destination for their pups. More dog-friendly parks nearby include MacArthur Park (0.7 miles) and MacArthur Dog Park (0.8 miles)—perfect for pups who love adventure."
  },
  {
    "name": "MacArthur Dog Park",
    "street": "Pulaski County Ln",
    "city": "Little Rock",
    "state": "AR",
    "zip": "72202",
    "latitude": 34.7353476,
    "longitude": -92.2658661,
    "description": "MacArthur Dog Park is well-regarded by Little Rock dog owners, holding 5.0 stars across 7 reviews. Dog owners looking for a solid destination will find this park delivers. Nearby, MacArthur Park (0.2 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Bark Park",
    "street": "1110 Shobe Rd",
    "city": "Little Rock",
    "state": "AR",
    "zip": "72022",
    "latitude": 34.6131393,
    "longitude": -92.4799338,
    "description": "With 4.6 stars from 29 reviews, Bark Park at 1110 Shobe Rd has become a favorite among Little Rock dog owners. For dog owners in the area, this park has become a trusted spot for time with their pups. Dog owners looking for a dependable spot will find this park lives up to its ratings."
  },
  {
    "name": "Pugh Park",
    "street": "5416 N Locust St",
    "city": "Little Rock",
    "state": "AR",
    "zip": "72116",
    "latitude": 34.8048076,
    "longitude": -92.2588259,
    "description": "Pugh Park (4.6 stars from 14 reviews) is a popular destination for Little Rock dog owners, located at 5416 N Locust St. The steady stream of dog owner visits speaks to the park's appeal. Dog owners can also take their pups to nearby Burns Park (2.2 miles) or Rebsamen Park (3.6 miles)."
  },
  {
    "name": "Murray Park",
    "street": "5900 Rebsamen Park Rd",
    "city": "Little Rock",
    "state": "AR",
    "zip": "72202",
    "latitude": 34.785232,
    "longitude": -92.342567,
    "description": "With 4.5 stars from 536 reviews, Murray Park at 5900 Rebsamen Park Rd has become a favorite among Little Rock dog owners. Open from 6am to 10pm daily, dog owners can plan visits around work or their pup's energy level. Dog owners can also take their pups to nearby Meriwether Park (1.6 miles) or Rebsamen Park (1.6 miles)."
  },
  {
    "name": "Meriwether Park",
    "street": "1407 Florida Ave",
    "city": "Little Rock",
    "state": "AR",
    "zip": "72207",
    "latitude": 34.7646287,
    "longitude": -92.3540483,
    "description": "For dog owners in the Little Rock area, Meriwether Park (1407 Florida Ave) offers a 4.5-star experience based on 206 reviews. Open from 6am to 5:05pm daily, dog owners have plenty of flexibility to plan a visit. Looking for more places to take your pup? Murray Park is another popular dog park just 1.6 miles away."
  },
  {
    "name": "‍ Brodie Creek Park",
    "street": "9100 Tall Timber Blvd",
    "city": "Little Rock",
    "state": "AR",
    "zip": "72204",
    "latitude": 34.7011198,
    "longitude": -92.3784204,
    "description": "Dog owners in Little Rock have rated Brodie Creek Park (9100 Tall Timber Blvd) 4.4 stars across 25 reviews. For dog owners in the neighborhood, this park offers a place to take their pups. Dog owners might also enjoy Oak Forest Park, another dog park just 3.4 miles away."
  },
  {
    "name": "Rebsamen Park",
    "street": "3400 Rebsamen Park Rd",
    "city": "Little Rock",
    "state": "AR",
    "zip": "72202",
    "latitude": 34.7804837,
    "longitude": -92.3152897,
    "description": "At 3400 Rebsamen Park Rd, Rebsamen Park has 4.4 stars based on 110 reviews from Little Rock dog owners. Open from 6am to 9pm daily, dog owners can stop by when it fits their schedule. For dog owners who like to explore, Murray Park (1.6 miles) and Burns Park (1.8 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "‍ Conway's PetSafe Dog Park",
    "street": "Acorn Kid Loop",
    "city": "Little Rock",
    "state": "AR",
    "zip": "72032",
    "latitude": 35.1094065,
    "longitude": -92.4238266,
    "description": "In Little Rock, Conway's PetSafe Dog Park carries 4.4 stars from 221 dog owner reviews. The park serves as a gathering spot for dog owners and their four-legged friends in the area. Dog owners visiting for the first time may want to read recent reviews to learn what to expect."
  },
  {
    "name": "MacArthur Park",
    "street": "1000 Mc",
    "city": "Little Rock",
    "state": "AR",
    "zip": "72202",
    "latitude": 34.738021,
    "longitude": -92.263555,
    "description": "Dog owners in Little Rock have made MacArthur Park at 1000 McMath Ave a go-to spot, rating it 4.4 stars across 952 reviews. Open from 6am to 10pm daily, the park works well for dog owners with different schedules. Dog owners exploring the neighborhood can also bring their furry friends to MacArthur Dog Park (0.2 miles)."
  },
  {
    "name": "Burns Park",
    "street": "4200 Joe Poch Rd",
    "city": "Little Rock",
    "state": "AR",
    "zip": "72118",
    "latitude": 34.8032467,
    "longitude": -92.2981285,
    "description": "At 4200 Joe Poch Rd, Burns Park has 4.3 stars based on 150 reviews from Little Rock dog owners. Open from 5am to 12am daily, dog owners in the area can work a visit into their day. Dog owners looking for variety can also visit Rebsamen Park (1.8 miles) or Pugh Park (2.2 miles) with their four-legged friends."
  },
  {
    "name": "Birchwood Park",
    "street": "Creek Cir",
    "city": "Little Rock",
    "state": "AR",
    "zip": "72211",
    "latitude": 34.7514018,
    "longitude": -92.3976378,
    "description": "For dog owners in Little Rock, Birchwood Park has a 4.2-star rating (141 reviews). Open from 7am to 6pm daily, the park is accessible for dog owners in the area. Looking to explore more? Meriwether Park is another dog-friendly park 2.6 miles from here."
  },
  {
    "name": "Oak Forest Park",
    "street": "5826 W 14th St",
    "city": "Little Rock",
    "state": "AR",
    "zip": "72204",
    "latitude": 34.7395104,
    "longitude": -92.3397467,
    "description": "Oak Forest Park (5826 W 14th St) serves dog owners in the Little Rock neighborhood looking for a place to visit with their pups. Open from 8am to 10pm daily, dog owners have flexibility to plan a visit with their four-legged friends. Dog owners might also enjoy Meriwether Park, another dog park just 1.9 miles away."
  },
  {
    "name": "Pettaway Park",
    "street": "515 E 21st St",
    "city": "Little Rock",
    "state": "AR",
    "zip": "72206",
    "latitude": 34.728449,
    "longitude": -92.2685138,
    "description": "Pettaway Park (515 E 21st St) serves dog owners in the Little Rock neighborhood looking for a place to visit with their pups. Open from 6am to 5:15pm daily, dog owners have a window to spend time with their pups. Looking to explore more? MacArthur Dog Park is another dog-friendly park 0.5 miles from here."
  },
  {
    "name": "‍ Jacksonville Dog Park",
    "street": "1300 Marshall Rd",
    "city": "North Little Rock",
    "state": "AR",
    "zip": "72076",
    "latitude": 34.878945,
    "longitude": -92.126397,
    "description": "Dog owners in North Little Rock have rated Jacksonville Dog Park (1300 Marshall Rd) 4.2 stars across 40 reviews. Open from 7am to 10pm daily, dog owners can stop by when it fits their schedule. Dog owners visiting for the first time may want to read recent reviews to learn what to expect."
  },
  {
    "name": "‍ Osage Park",
    "street": "700 SW 16th St",
    "city": "Rogers",
    "state": "AR",
    "zip": "72712",
    "latitude": 36.3548896,
    "longitude": -94.2132154,
    "description": "With 4.9 stars from 350 reviews, Osage Park at 700 SW 16th St has become a favorite among Rogers dog owners. Open from 7am to 11pm daily, dog owners can easily fit a visit into busy schedules. Looking for more places to take your pup? Creekside Park is another popular dog park just 1.1 miles away."
  },
  {
    "name": "Mt Hebron Park",
    "street": "6174 Mount Hebron Rd",
    "city": "Rogers",
    "state": "AR",
    "zip": "72758",
    "latitude": 36.2724614,
    "longitude": -94.1945969,
    "description": "For dog owners in the Rogers area, Mt Hebron Park (6174 Mount Hebron Rd) offers a 4.9-star experience based on 273 reviews. Dog owners in the area consistently choose this park as a go-to destination for their pups. For variety, the neighborhood offers more dog parks to explore: New Hope Park (3.7 miles) and Shaw Family Park (3.7 miles)."
  },
  {
    "name": "The Railyard Bike Park",
    "street": "299 E Cherry St",
    "city": "Rogers",
    "state": "AR",
    "zip": "72756",
    "latitude": 36.3298658,
    "longitude": -94.1152072,
    "description": "With 4.8 stars from 764 reviews, The Railyard Bike Park at 299 E Cherry St has become a favorite among Rogers dog owners. Open from 6am to 10pm daily, the park works well for dog owners with different schedules. For variety, the neighborhood offers more dog parks to explore: Lake Atalanta Park (0.3 miles) and Lake Atlanta Dog Park (0.6 miles)."
  },
  {
    "name": "Lake Atalanta Park",
    "street": "500 E Walnut St",
    "city": "Rogers",
    "state": "AR",
    "zip": "72758",
    "latitude": 36.3329435,
    "longitude": -94.1111786,
    "description": "For Rogers dog owners, Lake Atalanta Park at 500 E Walnut St has become a reliable favorite—4.7 stars from 1,476 reviews. Open from 6am to 10pm daily, the park is convenient for before work, after work, or weekend adventures. Dog owners in the area also love bringing their pups to The Railyard Bike Park (0.3 miles) and Lake Atlanta Dog Park (0.7 miles)."
  },
  {
    "name": "New Hope Park",
    "street": "W New Hope Rd",
    "city": "Rogers",
    "state": "AR",
    "zip": "72758",
    "latitude": 36.3119687,
    "longitude": -94.1497224,
    "description": "New Hope Park in Rogers has 4.4 stars from 18 dog owner reviews. Open from 6am to 10pm daily, the park fits conveniently into different routines. Dog owners in the neighborhood can also take their furry friends to The Railyard Bike Park, 2.3 miles away."
  },
  {
    "name": "‍ Bark Park",
    "street": "2400 N Walton Blvd",
    "city": "Rogers",
    "state": "AR",
    "zip": "72712",
    "latitude": 36.399082,
    "longitude": -94.216159,
    "description": "Located at 2400 N Walton Blvd in Rogers, Bark Park earns strong marks from local dog owners—4.6 stars from 728 reviews. Open from 6am to 11pm daily, dog owners can plan visits around work or their pup's energy level. Other dog parks in the area include North Bentonville Trail (0.7 miles) and Osage Dog Park (1.9 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "‍ Shaw Family Park",
    "street": "7293 Charlotte Ave",
    "city": "Springdale",
    "state": "AR",
    "zip": "72762",
    "latitude": 36.2199064,
    "longitude": -94.2104901,
    "description": "Springdale dog owners rate Shaw Family Park at 7293 Charlotte Ave highly, with 4.8 stars from 63 visits. Local dog owners appreciate what this park offers their four-legged friends. Dog owners exploring the neighborhood can also bring their furry friends to Shaw Family Park (0.1 miles)."
  },
  {
    "name": "Osage Dog Park",
    "street": "",
    "city": "Springdale",
    "state": "AR",
    "zip": "",
    "latitude": 36.3728538,
    "longitude": -94.2088172,
    "description": "In Springdale, Osage Dog Park has built a loyal following—4.8 stars from 57 dog owner reviews. Open Tue through Fri, the park offers flexibility for dog owners with varying routines. Dog owners exploring the neighborhood can also bring their furry friends to Bentonville Bike Playground (0.0 miles)."
  },
  {
    "name": "‍ Springdale Dog Park",
    "street": "4774 Horn Ln",
    "city": "Springdale",
    "state": "AR",
    "zip": "72764",
    "latitude": 36.1513269,
    "longitude": -94.0727606,
    "description": "With 4.9 stars from 16 reviews, Springdale Dog Park at 4774 Horn Ln has become a favorite among Springdale dog owners. Dog owners in the area consistently choose this park as a go-to destination for their pups. For variety, the neighborhood offers more dog parks to explore: C.L. \"Charlie\" and Willie (0.8 miles) and Bobby Hopper Park (3.3 miles)."
  },
  {
    "name": "‍ Gulley Park",
    "street": "1850 E Township St",
    "city": "Springdale",
    "state": "AR",
    "zip": "72703",
    "latitude": 36.0958432,
    "longitude": -94.1349106,
    "description": "With 4.7 stars across 1,066 reviews, Gulley Park at 1850 E Township St has clearly won over Springdale dog owners. Dog owners in the area know they can count on this park for quality time with their pups. Nearby, Bryce Davis Park (4.4 miles) is another dog park favorite where you can take your four-legged friend."
  },
  {
    "name": "C.L. \"Charlie\" and Willie",
    "street": "4023 Hylton Rd",
    "city": "Springdale",
    "state": "AR",
    "zip": "72764",
    "latitude": 36.1473726,
    "longitude": -94.085853,
    "description": "With 4.7 stars from 995 reviews, C.L. \"Charlie\" and Willie at 4023 Hylton Rd has become a favorite among Springdale dog owners. Dog owners frequent this park for its consistent quality and welcoming atmosphere. More dog-friendly parks nearby include Springdale Dog Park (0.8 miles) and Bobby Hopper Park (3.1 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Dog Park",
    "street": "14159 Ball St",
    "city": "Springdale",
    "state": "AR",
    "zip": "72762",
    "latitude": 36.2172147,
    "longitude": -94.215068,
    "description": "Dog Park (4.7 stars from 39 reviews) is a popular destination for Springdale dog owners, located at 14159 Ball St. The park has earned its reputation among dog owners in the neighborhood as a reliable choice. For variety, the neighborhood offers more dog parks to explore: Shaw Family Park (0.2 miles) and Shaw Family Park (0.3 miles)."
  },
  {
    "name": "Shaw Family Park",
    "street": "7341 W Downum Rd",
    "city": "Springdale",
    "state": "AR",
    "zip": "72762",
    "latitude": 36.2195622,
    "longitude": -94.2116765,
    "description": "Located at 7341 W Downum Rd in Springdale, Shaw Family Park earns strong marks from local dog owners—4.7 stars from 36 reviews. Open from 6:30am to 10pm daily, dog owners can plan visits around work or their pup's energy level. For variety, the neighborhood offers more dog parks to explore: Shaw Family Park (0.1 miles) and Dog Park (0.2 miles)."
  },
  {
    "name": "Lake Atlanta Dog Park",
    "street": "1615 S Pleasant Ridge Rd",
    "city": "Springdale",
    "state": "AR",
    "zip": "72756",
    "latitude": 36.3224958,
    "longitude": -94.1091816,
    "description": "Located at 1615 S Pleasant Ridge Rd in Springdale, Lake Atlanta Dog Park earns strong marks from local dog owners—4.6 stars from 297 reviews. Open from 6am to 9pm daily, dog owners have plenty of flexibility to plan a visit. For variety, the neighborhood offers more dog parks to explore: The Railyard Bike Park (0.6 miles) and Lake Atalanta Park (0.7 miles)."
  },
  {
    "name": "Bryce Davis Park",
    "street": "1595 N Dartmouth Ave",
    "city": "Springdale",
    "state": "AR",
    "zip": "72704",
    "latitude": 36.0840671,
    "longitude": -94.2115453,
    "description": "Bryce Davis Park (4.5 stars from 452 reviews) is a popular destination for Springdale dog owners, located at 1595 N Dartmouth Ave. Open from 6am to 11pm daily, the park accommodates early risers and evening visitors alike. For a change of scenery, Gulley Park is another dog-friendly destination 4.4 miles from here."
  },
  {
    "name": "Crumpacker Park",
    "street": "Tall Oaks Loop N",
    "city": "Springdale",
    "state": "AR",
    "zip": "72762",
    "latitude": 36.1828025,
    "longitude": -94.2020795,
    "description": "30 dog owners have reviewed Crumpacker Park in Springdale, averaging 4.4 stars. Open from 6am to 9pm daily, dog owners have a window to spend time with their pups. For pups who want more adventure, Dog Park is a nearby dog park worth visiting (2.5 miles)."
  },
  {
    "name": "Murphy Park",
    "street": "501 S Pleasant St",
    "city": "Springdale",
    "state": "AR",
    "zip": "72764",
    "latitude": 36.181395,
    "longitude": -94.142965,
    "description": "Springdale dog owners rate Murphy Park at 501 S Pleasant St highly, with 4.4 stars from 834 visits. Open from 6am to 10pm daily, the park offers flexibility for dog owners with varying routines. Dog owners can also take their pups to nearby Bobby Hopper Park (1.9 miles) or Crumpacker Park (3.3 miles)."
  },
  {
    "name": "Bobby Hopper Park",
    "street": "1981 E Huntsville Ave",
    "city": "Springdale",
    "state": "AR",
    "zip": "72764",
    "latitude": 36.1879537,
    "longitude": -94.1095435,
    "description": "Bobby Hopper Park at 1981 E Huntsville Ave holds a 4.1-star rating from 43 Springdale dog owner visits. Open from 6am to 10pm daily, dog owners in the area can work a visit into their day. For dog owners who like to explore, Murphy Park (1.9 miles) and C.L. \"Charlie\" and Willie (3.1 miles) are both nearby parks to try with your dog."
  }
]