[
  {
    "name": "George M. Wallace Park",
    "street": "4505 S Yosemite St",
    "city": "Aurora",
    "state": "CO",
    "zip": "80237",
    "latitude": 39.6435211,
    "longitude": -104.8851463,
    "description": "With 4.7 stars from 536 reviews, George M. Wallace Park at 4505 S Yosemite St has become a favorite among Aurora dog owners. Local dog owners appreciate what this park offers their four-legged friends. For variety, the neighborhood offers more dog parks to explore: Kennedy Dog Park (0.8 miles) and Belleview station dog park (1.5 miles)."
  },
  {
    "name": "Sagebrush Park",
    "street": "4744 S Evanston Way",
    "city": "Aurora",
    "state": "CO",
    "zip": "80015",
    "latitude": 39.6287751,
    "longitude": -104.8143646,
    "description": "At 4744 S Evanston Way in Aurora, Sagebrush Park has built a loyal following—4.6 stars from 250 dog owner reviews. Open from 5am to 11pm daily, the park works well for dog owners with different schedules. Dog owners exploring the neighborhood can also bring their furry friends to Cherry Creek State Park (1.6 miles)."
  },
  {
    "name": "Sand Creek Park",
    "street": "2700 Peoria St",
    "city": "Aurora",
    "state": "CO",
    "zip": "80011",
    "latitude": 39.7573134,
    "longitude": -104.8456542,
    "description": "Dog owners in Aurora have made Sand Creek Park at 2700 Peoria St a go-to spot, rating it 4.5 stars across 920 reviews. Open from 5am to 11pm daily, dog owners can easily fit a visit into busy schedules. Dog owners can also take their pups to nearby Cherry Creek ​Dog Of​f Leash (1.3 miles) or Bicentennial Park (1.4 miles)."
  },
  {
    "name": "Copperleaf Bark Park",
    "street": "",
    "city": "Aurora",
    "state": "CO",
    "zip": "",
    "latitude": 39.7405111,
    "longitude": -104.830994,
    "description": "With 4.5 stars from 108 reviews, Copperleaf Bark Park has become a favorite among Aurora dog owners. Local dog owners appreciate what this park offers their four-legged friends. For variety, the neighborhood offers more dog parks to explore: Bicentennial Park (0.0 miles) and Southshore Dog Park (0.0 miles)."
  },
  {
    "name": "‍ Homestead Park",
    "street": "23945 E Florida Ave",
    "city": "Aurora",
    "state": "CO",
    "zip": "80018",
    "latitude": 39.6902129,
    "longitude": -104.7068017,
    "description": "At 23945 E Florida Ave in Aurora, Homestead Park carries 4.4 stars from 40 dog owner reviews. Open from 5am to 11pm daily, the park gives dog owners in the neighborhood time to bring their pups. For dog owners considering a visit, the reviews offer firsthand accounts from other visitors."
  },
  {
    "name": "Summer Valley Park",
    "street": "",
    "city": "Aurora",
    "state": "CO",
    "zip": "",
    "latitude": 39.7405111,
    "longitude": -104.830994,
    "description": "Summer Valley Park in Aurora is rated 4.4 stars by 48 dog owners. Open from 5am to 11pm daily, dog owners have flexibility to plan a visit with their four-legged friends. Looking to explore more? Bicentennial Park is another dog-friendly park 0.0 miles from here."
  },
  {
    "name": "Southshore Dog Park",
    "street": "",
    "city": "Aurora",
    "state": "CO",
    "zip": "",
    "latitude": 39.7405111,
    "longitude": -104.830994,
    "description": "For dog owners in Aurora, Southshore Dog Park has a 4.2-star rating (6 reviews). The park serves as a gathering spot for dog owners and their four-legged friends in the area. More dog parks in the area include Bicentennial Park (0.0 miles) and Copperleaf Bark Park (0.0 miles)—great options for mixing up your pup's routine."
  },
  {
    "name": "Bicentennial Park",
    "street": "",
    "city": "Aurora",
    "state": "CO",
    "zip": "",
    "latitude": 39.7405111,
    "longitude": -104.830994,
    "description": "Bicentennial Park holds a 4.3-star rating from 210 Aurora dog owner visits. Open from 5am to 11pm daily, dog owners can stop by when it fits their schedule. Looking to explore more? Southshore Dog Park is another dog-friendly park 0.0 miles from here."
  },
  {
    "name": "Singletree Park",
    "street": "19590 E 58th Ave",
    "city": "Aurora",
    "state": "CO",
    "zip": "80019",
    "latitude": 39.8008588,
    "longitude": -104.7593329,
    "description": "179 dog owners have reviewed Singletree Park at 19590 E 58th Ave in Aurora, averaging 4.2 stars. Open from 5am to 11pm daily, the park is accessible for dog owners in the area. Dog owners looking for variety can also visit Green Valley Ranch East Park (1.6 miles) or Second Creek Open Space (4.6 miles) with their four-legged friends."
  },
  {
    "name": "Valmont Bike Park",
    "street": "3160 Airport Rd",
    "city": "Boulder",
    "state": "CO",
    "zip": "80301",
    "latitude": 40.0338745,
    "longitude": -105.2342172,
    "description": "For Boulder dog owners, Valmont Bike Park at 3160 Airport Rd has become a reliable favorite—4.8 stars from 1,190 reviews. Open from 5am to 11pm daily, dog owners have room to work around busy schedules. Nearby, Howard Heuston Park (0.8 miles) is another dog park favorite where you can take your four-legged friend."
  },
  {
    "name": "CU Boulder South",
    "street": "4886 Table Mesa Dr",
    "city": "Boulder",
    "state": "CO",
    "zip": "80305",
    "latitude": 39.985941,
    "longitude": -105.2398681,
    "description": "CU Boulder South (4.9 stars from 10 reviews) is a popular destination for Boulder dog owners, located at 4886 Table Mesa Dr. The park has earned its reputation among dog owners in the neighborhood as a reliable choice. More dog-friendly parks nearby include Tantra Park (0.3 miles) and Admiral Arleigh A. Burke Park (0.7 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Eben G. Fine Park",
    "street": "101 Arapahoe Ave",
    "city": "Boulder",
    "state": "CO",
    "zip": "80302",
    "latitude": 40.0124956,
    "longitude": -105.2965546,
    "description": "Eben G. Fine Park at 101 Arapahoe Ave in Boulder is a community favorite, with 1,792 dog owners giving it 4.7 stars. Open from 5am to 11pm daily, the park accommodates a variety of dog owner schedules and routines. Looking to mix things up? Boulder Canyon Trail is a nearby dog park 0.7 miles away that's worth exploring with your pup."
  },
  {
    "name": "Boulder Canyon Trail",
    "street": "Boulder Creek Path",
    "city": "Boulder",
    "state": "CO",
    "zip": "80302",
    "latitude": 40.0144825,
    "longitude": -105.2830186,
    "description": "For dog owners in the Boulder area, Boulder Canyon Trail offers a 4.7-star experience based on 682 reviews. The park serves dog owners well, providing a destination the community values. For variety, the neighborhood offers more dog parks to explore: Barker Park (0.5 miles) and Sawhill Ponds (0.7 miles)."
  },
  {
    "name": "Foothills Community Park",
    "street": "800 Cherry Ave",
    "city": "Boulder",
    "state": "CO",
    "zip": "80304",
    "latitude": 40.0573451,
    "longitude": -105.2882896,
    "description": "At 800 Cherry Ave in Boulder, Foothills Community Park has built a loyal following—4.7 stars from 615 dog owner reviews. Open from 5am to 11pm daily, the park works well for dog owners with different schedules. For a change of scenery, Fourmile Canyon Creek Trailhea is another dog-friendly destination 0.3 miles from here."
  },
  {
    "name": "Gregory Canyon Trailhead",
    "street": "Gregory Canyon Rd",
    "city": "Boulder",
    "state": "CO",
    "zip": "80302",
    "latitude": 39.9982505,
    "longitude": -105.2919309,
    "description": "With 4.7 stars from 528 reviews, Gregory Canyon Trailhead has become a favorite among Boulder dog owners. The park serves dog owners well, providing a destination the community values. Looking for more places to take your pup? Eben G. Fine Park is another popular dog park just 1.0 miles away."
  },
  {
    "name": "Wonderland Lake Park",
    "street": "601 Poplar Ave",
    "city": "Boulder",
    "state": "CO",
    "zip": "80304",
    "latitude": 40.046756,
    "longitude": -105.28917,
    "description": "With 4.7 stars from 318 reviews, Wonderland Lake Park at 601 Poplar Ave has become a favorite among Boulder dog owners. Open from 5am to 11pm daily, dog owners can easily fit a visit into busy schedules. More dog-friendly parks nearby include Foothills Community Park (0.7 miles) and Fourmile Canyon Creek Trailhea (1.1 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Twin Lakes Open Space",
    "street": "Nautilus Dr",
    "city": "Boulder",
    "state": "CO",
    "zip": "80301",
    "latitude": 40.061714,
    "longitude": -105.2058602,
    "description": "Dog owners in Boulder have made Twin Lakes Open Space a go-to spot, rating it 4.7 stars across 212 reviews. Open from 5am to 6pm daily, the park works well for dog owners with different schedules. Dog owners can also take their pups to nearby Valmont Bike Park (2.4 miles) or East Palo Park (2.6 miles)."
  },
  {
    "name": "East Boulder Community Park",
    "street": "5660 Sioux Dr",
    "city": "Boulder",
    "state": "CO",
    "zip": "80303",
    "latitude": 39.9921555,
    "longitude": -105.2199563,
    "description": "East Boulder Community Park (4.7 stars from 97 reviews) is a popular destination for Boulder dog owners, located at 5660 Sioux Dr. Open from 7am to 5pm daily, the park accommodates early risers and evening visitors alike. Dog owners exploring the neighborhood can also bring their furry friends to Keewaydin Meadows Park (0.5 miles)."
  },
  {
    "name": "Sawhill Ponds",
    "street": "",
    "city": "Boulder",
    "state": "CO",
    "zip": "",
    "latitude": 40.0149856,
    "longitude": -105.270545,
    "description": "Dog owners in Boulder have made Sawhill Ponds a go-to spot, rating it 4.7 stars across 87 reviews. Open from 5am to 11pm daily, there's plenty of opportunity for dog owners to find a time that works. Other dog parks in the area include Emma Gomez Martinez Park (0.2 miles) and Barker Park (0.4 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Fourmile Canyon Creek Trailhea",
    "street": "420 Lee Hill Dr",
    "city": "Boulder",
    "state": "CO",
    "zip": "80304",
    "latitude": 40.0618506,
    "longitude": -105.2865338,
    "description": "Located at 420 Lee Hill Dr in Boulder, Fourmile Canyon Creek Trailhea earns strong marks from local dog owners—4.7 stars from 82 reviews. Dog owners looking for a solid destination will find this park delivers. Nearby, Foothills Community Park (0.3 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Bear Creek Park",
    "street": "1095 Lehigh St",
    "city": "Boulder",
    "state": "CO",
    "zip": "80305",
    "latitude": 39.978913,
    "longitude": -105.2602211,
    "description": "For dog owners in the Boulder area, Bear Creek Park (1095 Lehigh St) offers a 4.6-star experience based on 49 reviews. Open from 5am to 11pm daily, there's plenty of opportunity for dog owners to find a time that works. For a change of scenery, Tantra Park is another dog-friendly destination 1.0 miles from here."
  },
  {
    "name": "East Palo Park",
    "street": "4340 Corriente Dr",
    "city": "Boulder",
    "state": "CO",
    "zip": "80301",
    "latitude": 40.046385,
    "longitude": -105.2501397,
    "description": "With 4.6 stars from 64 reviews, East Palo Park at 4340 Corriente Dr has become a favorite among Boulder dog owners. Open from 5am to 11pm daily, dog owners have plenty of flexibility to plan a visit. Other dog parks in the area include Howard Heuston Park (1.0 miles) and Valmont Bike Park (1.2 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Admiral Arleigh A. Burke Park",
    "street": "490 Mohawk Dr",
    "city": "Boulder",
    "state": "CO",
    "zip": "80303",
    "latitude": 39.9960326,
    "longitude": -105.2366177,
    "description": "Admiral Arleigh A. Burke Park (4.6 stars from 76 reviews) is a popular destination for Boulder dog owners, located at 490 Mohawk Dr. Open from 5am to 11pm daily, the park offers flexibility for dog owners with varying routines. Dog owners can also take their pups to nearby Keewaydin Meadows Park (0.5 miles) or CU Boulder South (0.7 miles)."
  },
  {
    "name": "Boulder Valley Ranch Trailhead",
    "street": "3900 Longhorn Rd",
    "city": "Boulder",
    "state": "CO",
    "zip": "80302",
    "latitude": 40.0799428,
    "longitude": -105.2698763,
    "description": "At 3900 Longhorn Rd in Boulder, Boulder Valley Ranch Trailhead has built a loyal following—4.6 stars from 99 dog owner reviews. Open from 5am to 11pm daily, dog owners can plan visits around work or their pup's energy level. Dog owners exploring the neighborhood can also bring their furry friends to Fourmile Canyon Creek Trailhea (1.5 miles)."
  },
  {
    "name": "‍ Dry Creek Trailhead",
    "street": "6802 Baseline Rd",
    "city": "Boulder",
    "state": "CO",
    "zip": "80303",
    "latitude": 39.9961046,
    "longitude": -105.1956779,
    "description": "Dog owners in Boulder have made Dry Creek Trailhead at 6802 Baseline Rd a go-to spot, rating it 4.6 stars across 163 reviews. Open from 5am to 11pm daily, there's plenty of opportunity for dog owners to find a time that works. For a change of scenery, Bobolink Trailhead is another dog-friendly destination 1.1 miles from here."
  },
  {
    "name": "Del Corso Park",
    "street": "13780 Del Corso Way",
    "city": "Broomfield",
    "state": "CO",
    "zip": "80020",
    "latitude": 39.945392,
    "longitude": -105.1217145,
    "description": "At 13780 Del Corso Way in Broomfield, Del Corso Park welcomes dog owners from the surrounding neighborhood. Open from 6am to 10pm daily, dog owners can stop by when it fits their schedule. Dog owners looking for variety can also visit Louisville Community (Dog) (1.8 miles) or Westminster Hills Open Space (4.0 miles) with their four-legged friends."
  },
  {
    "name": "Douglas County Off-leash Area",
    "street": "1100 E Plum Creek Pkwy",
    "city": "‍ Castle Rock",
    "state": "CO",
    "zip": "80104",
    "latitude": 39.358777,
    "longitude": -104.84986,
    "description": "Douglas County Off-leash Area at 1100 E Plum Creek Pkwy is well-regarded by Castle Rock dog owners, holding 4.5 stars across 262 reviews. Open from 6am to 8pm daily, there's plenty of opportunity for dog owners to find a time that works. Dog owners exploring the neighborhood can also bring their furry friends to Fairgrounds Regional Park (0.5 miles)."
  },
  {
    "name": "‍ Fairgrounds Regional Park",
    "street": "500 Fairgrounds Rd",
    "city": "‍ Castle Rock",
    "state": "CO",
    "zip": "80104",
    "latitude": 39.3635299,
    "longitude": -104.8562934,
    "description": "At 500 Fairgrounds Rd in Castle Rock, Fairgrounds Regional Park carries 4.4 stars from 85 dog owner reviews. This park provides dog owners in the community with a place to visit with their dogs. Looking to explore more? Douglas County Off-leash Area is another dog-friendly park 0.5 miles from here."
  },
  {
    "name": "Red Rock Canyon Open Space",
    "street": "3550 W High St",
    "city": "Colorado Springs",
    "state": "CO",
    "zip": "80904",
    "latitude": 38.8535956,
    "longitude": -104.8824239,
    "description": "For Colorado Springs dog owners, Red Rock Canyon Open Space at 3550 W High St needs no introduction—4.8 stars, 6,626 reviews. Open from 5am to 11pm daily, the park accommodates everything from early morning walks to evening adventures. While you're in the area, dog owners also recommend taking your pup to Red Rocks Dog Park, another excellent dog park 0.1 miles away."
  },
  {
    "name": "Bear Creek Dog Park",
    "street": "21st St",
    "city": "Colorado Springs",
    "state": "CO",
    "zip": "80904",
    "latitude": 38.839846,
    "longitude": -104.8592047,
    "description": "3,854 dog owners have made Bear Creek Dog Park (21st St) one of Colorado Springs's most trusted parks (4.8 stars). Open from 5am to 9pm daily, the park is convenient for before work, after work, or weekend adventures. Want to give your pup even more adventure? Red Rock Canyon Open Space is another beloved dog park just 1.6 miles away."
  },
  {
    "name": "Fox Run Regional Park",
    "street": "2110 Stella Dr",
    "city": "Colorado Springs",
    "state": "CO",
    "zip": "80921",
    "latitude": 38.9193549,
    "longitude": -104.7037998,
    "description": "For Colorado Springs dog owners, Fox Run Regional Park at 2110 Stella Dr has become a reliable favorite—4.8 stars from 1,951 reviews. Open from 5am to 9pm daily, it's easy for dog owners to stop by whenever works best. Keep the adventure going at other nearby dog parks like Fred McKown Park (1.5 miles) or Wolf Ranch Dog Park (2.8 miles)."
  },
  {
    "name": "‍ Seven Bridges Trail",
    "street": "N Cheyenne Canyon Rd",
    "city": "Colorado Springs",
    "state": "CO",
    "zip": "80906",
    "latitude": 38.7909023,
    "longitude": -104.8643686,
    "description": "Local dog owners love Seven Bridges Trail in Colorado Springs—4.8 stars from an impressive 1,159 reviews. The strong community of dog owners here reflects how much the park is valued. Dog owners in the area also love bringing their pups to Stratton Open Space (0.5 miles) and Broadmoor Valley Park (1.9 miles)."
  },
  {
    "name": "Fox Run Dog Park",
    "street": "",
    "city": "Colorado Springs",
    "state": "CO",
    "zip": "",
    "latitude": 38.8339578,
    "longitude": -104.825348,
    "description": "Colorado Springs dog owners rate Fox Run Dog Park highly, with 4.8 stars from 405 visits. Dog owners frequent this park for its consistent quality and welcoming atmosphere. Other dog parks in the area include Vista Dog Park (0.0 miles) and Bear Creek Dog Park (0.0 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "‍ Red Rocks Dog Park",
    "street": "3615 W High St",
    "city": "Colorado Springs",
    "state": "CO",
    "zip": "80904",
    "latitude": 38.853966,
    "longitude": -104.8845677,
    "description": "Located at 3615 W High St in Colorado Springs, Red Rocks Dog Park earns strong marks from local dog owners—4.8 stars from 23 reviews. Dog owners in the area consistently choose this park as a go-to destination for their pups. Dog owners exploring the neighborhood can also bring their furry friends to Red Rock Canyon Open Space (0.1 miles)."
  },
  {
    "name": "Cheyenne Mountain State Park",
    "street": "410 JL Ranch Heights Rd",
    "city": "Colorado Springs",
    "state": "CO",
    "zip": "80926",
    "latitude": 38.7352964,
    "longitude": -104.8194222,
    "description": "2,325 dog owners have made Cheyenne Mountain State Park (410 JL Ranch Heights Rd) one of Colorado Springs's most trusted parks (4.7 stars). Open from 5am to 10pm daily, it's easy for dog owners to stop by whenever works best. Dog owners in the area also love bringing their pups to Cheyenne Meadows Dog Park (2.7 miles) and Cheyenne Meadows Park (2.9 miles)."
  },
  {
    "name": "Pulpit Rock Park",
    "street": "1005 Garlock Ln",
    "city": "Colorado Springs",
    "state": "CO",
    "zip": "80918",
    "latitude": 38.9208151,
    "longitude": -104.8045064,
    "description": "With 4.7 stars across 1,175 reviews, Pulpit Rock Park at 1005 Garlock Ln has clearly won over Colorado Springs dog owners. Open from 5am to 9pm daily, dog owners can plan visits around their pup's favorite times to be active. For more dog park adventures, explore Grant Park (2.5 miles) or Rampart Dog Park (2.7 miles) with your furry companion."
  },
  {
    "name": "Stratton Open Space",
    "street": "1504 Ridgeway Ave",
    "city": "Colorado Springs",
    "state": "CO",
    "zip": "80906",
    "latitude": 38.7956327,
    "longitude": -104.8569222,
    "description": "With 4.7 stars from 655 reviews, Stratton Open Space at 1504 Ridgeway Ave has become a favorite among Colorado Springs dog owners. Open from 5am to 10pm daily, dog owners can easily fit a visit into busy schedules. Dog owners can also take their pups to nearby Seven Bridges Trail (0.5 miles) or Broadmoor Valley Park (1.7 miles)."
  },
  {
    "name": "‍ Roswell Park",
    "street": "515 W Polk St",
    "city": "Colorado Springs",
    "state": "CO",
    "zip": "80907",
    "latitude": 38.8724481,
    "longitude": -104.830469,
    "description": "Dog owners in Colorado Springs have made Roswell Park at 515 W Polk St a go-to spot, rating it 4.6 stars across 134 reviews. For dog owners in the area, this park has become a trusted spot for time with their pups. For variety, the neighborhood offers more dog parks to explore: Austin Bluffs Open Space (1.3 miles) and Garden of the Gods Off-Leash (2.1 miles)."
  },
  {
    "name": "Austin Bluffs Open Space",
    "street": "1401 Recreation Way",
    "city": "Colorado Springs",
    "state": "CO",
    "zip": "80918",
    "latitude": 38.8537096,
    "longitude": -104.8312149,
    "description": "Austin Bluffs Open Space at 1401 Recreation Way is well-regarded by Colorado Springs dog owners, holding 4.6 stars across 283 reviews. Open from 5am to 9pm daily, dog owners can plan visits around work or their pup's energy level. Other dog parks in the area include Roswell Park (1.3 miles) and Antlers Park (1.4 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Rampart Park",
    "street": "7850 N Union Blvd",
    "city": "Colorado Springs",
    "state": "CO",
    "zip": "80920",
    "latitude": 38.9636663,
    "longitude": -104.7575416,
    "description": "For dog owners in the Colorado Springs area, Rampart Park (7850 N Union Blvd) offers a 4.6-star experience based on 721 reviews. Open from 5am to 11pm daily, the park offers flexibility for dog owners with varying routines. Nearby, Rampart Dog Park (1.2 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Grant Park",
    "street": "2821 Shadowglen Dr",
    "city": "Colorado Springs",
    "state": "CO",
    "zip": "80918",
    "latitude": 38.8944743,
    "longitude": -104.771647,
    "description": "For dog owners in the Colorado Springs area, Grant Park (2821 Shadowglen Dr) offers a 4.5-star experience based on 56 reviews. For dog owners in the area, this park has become a trusted spot for time with their pups. For a change of scenery, Keller Park is another dog-friendly destination 0.8 miles from here."
  },
  {
    "name": "Otero Park",
    "street": "",
    "city": "Colorado Springs",
    "state": "CO",
    "zip": "",
    "latitude": 38.8339578,
    "longitude": -104.825348,
    "description": "Otero Park is well-regarded by Colorado Springs dog owners, holding 4.5 stars across 128 reviews. The steady stream of dog owner visits speaks to the park's appeal. Nearby, Fox Run Dog Park (0.0 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "‍ Fred McKown Park",
    "street": "5035 Balsam St",
    "city": "Colorado Springs",
    "state": "CO",
    "zip": "80923",
    "latitude": 38.9238966,
    "longitude": -104.7317334,
    "description": "For dog owners in the Colorado Springs area, Fred McKown Park (5035 Balsam St) offers a 4.5-star experience based on 162 reviews. The steady stream of dog owner visits speaks to the park's appeal. More dog-friendly parks nearby include Fox Run Regional Park (1.5 miles) and Keller Park (2.2 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Rocky Mountain Arsenal Nationa",
    "street": "6550 Gateway Rd",
    "city": "Commerce City",
    "state": "CO",
    "zip": "80022",
    "latitude": 39.8151168,
    "longitude": -104.88036,
    "description": "With 4.6 stars across 4,941 reviews, Rocky Mountain Arsenal Nationa at 6550 Gateway Rd has clearly won over Commerce City dog owners. Open from 9am to 4pm, every day except Monday and Tuesday, dog owners have room to work around busy schedules. Want to give your pup even more adventure? Willow Bark Park is another beloved dog park just 1.4 miles away."
  },
  {
    "name": "Second Creek Open Space",
    "street": "Landmark Dr",
    "city": "Commerce City",
    "state": "CO",
    "zip": "80022",
    "latitude": 39.8647466,
    "longitude": -104.7855087,
    "description": "Dog owners in Commerce City have rated Second Creek Open Space 4.4 stars across 10 reviews. This park provides dog owners in the community with a place to visit with their dogs. Looking to explore more? Singletree Park is another dog-friendly park 4.6 miles from here."
  },
  {
    "name": "‍ Gifford Park",
    "street": "6120 Gifford Dr",
    "city": "Commerce City",
    "state": "CO",
    "zip": "80022",
    "latitude": 39.8086446,
    "longitude": -104.9117231,
    "description": "At 6120 Gifford Dr in Commerce City, Gifford Park carries 4.3 stars from 16 dog owner reviews. The neighborhood benefits from having this park as an option for dog owners and their pups. Nearby dog parks worth exploring with your pup include Willow Bark Park (1.6 miles) and Rocky Mountain Arsenal Nationa (1.7 miles)."
  },
  {
    "name": "Washington Park",
    "street": "701 S Franklin St",
    "city": "Denver",
    "state": "CO",
    "zip": "80209",
    "latitude": 39.7026709,
    "longitude": -104.9705739,
    "description": "Dog owners have made Washington Park at 701 S Franklin St one of Denver's most popular destinations—4.8 stars from 6,454 visits. The park has achieved landmark status among dog owners for good reason. While you're in the area, dog owners also recommend taking your pup to Washington Park, another excellent dog park 0.4 miles away."
  },
  {
    "name": "Cherry Creek ​Dog Of​f Leash",
    "street": "S Entrance Rd",
    "city": "Denver",
    "state": "CO",
    "zip": "80015",
    "latitude": 39.7415051,
    "longitude": -104.8308214,
    "description": "In Denver, Cherry Creek ​Dog Of​f Leash stands out with 4.8 stars from 2,077 happy dog owners. Open from 5am to 10pm daily, it's easy for dog owners to stop by whenever works best. Want to give your pup even more adventure? Bicentennial Park is another beloved dog park just 0.1 miles away."
  },
  {
    "name": "Westminster Hills Open Space",
    "street": "10499 Simms St",
    "city": "Denver",
    "state": "CO",
    "zip": "80005",
    "latitude": 39.8883441,
    "longitude": -105.1287005,
    "description": "Dog owners in Denver have embraced Westminster Hills Open Space (10499 Simms St) as a top destination—4.8 stars from 1,960 visits. Open from 6am to 8pm daily, dog owners have room to work around busy schedules. For more dog park adventures, explore Dog Park (0.7 miles) or Ketner Open Space (0.8 miles) with your furry companion."
  },
  {
    "name": "Chatfield Dog Park",
    "street": "",
    "city": "Denver",
    "state": "CO",
    "zip": "",
    "latitude": 39.613321,
    "longitude": -105.016649,
    "description": "Chatfield Dog Park (4.8 stars from 830 reviews) is a popular destination for Denver dog owners. Open from 5am to 10pm daily, there's room in the day for dog owners to bring their furry friends. Looking for more places to take your pup? Englewood Canine Corral is another popular dog park just 0.5 miles away."
  },
  {
    "name": "‍ Washington Park",
    "street": "1073 S Downing St",
    "city": "Denver",
    "state": "CO",
    "zip": "80209",
    "latitude": 39.6970678,
    "longitude": -104.9737277,
    "description": "At 1073 S Downing St in Denver, Washington Park has built a loyal following—4.8 stars from 335 dog owner reviews. Local dog owners appreciate what this park offers their four-legged friends. Other dog parks in the area include Washington Park (0.4 miles) and Bonnie Brae Park (1.1 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Cheesman Park",
    "street": "1599 E 8th Ave",
    "city": "Denver",
    "state": "CO",
    "zip": "80218",
    "latitude": 39.7392364,
    "longitude": -104.984862,
    "description": "2,692 dog owners have made Cheesman Park (1599 E 8th Ave) one of Denver's most trusted parks (4.7 stars). Open from 5am to 11pm daily, dog owners have room to work around busy schedules. Other popular dog parks nearby include Dog Park (0.0 miles) and Ruby Hill Dog Park (0.0 miles)—both favorites among local pup parents."
  },
  {
    "name": "West Arvada Dog Park",
    "street": "17975 W 64th Pkwy",
    "city": "Denver",
    "state": "CO",
    "zip": "80002",
    "latitude": 39.8173762,
    "longitude": -105.2051317,
    "description": "At 17975 W 64th Pkwy in Denver, West Arvada Dog Park has built a loyal following—4.7 stars from 457 dog owner reviews. Open from 6:30am to 7:30pm daily, dog owners can easily fit a visit into busy schedules. Nearby, Tony Grampsas Dog Park (3.2 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Jefferson Park",
    "street": "2290 Eliot St",
    "city": "Denver",
    "state": "CO",
    "zip": "80211",
    "latitude": 39.7510088,
    "longitude": -105.0235167,
    "description": "Denver dog owners rate Jefferson Park at 2290 Eliot St highly, with 4.7 stars from 100 visits. Open from 5am to 11pm daily, there's room in the day for dog owners to bring their furry friends. Dog owners can also take their pups to nearby Confluence Park (0.9 miles) or Speer Blvd Park (1.3 miles)."
  },
  {
    "name": "Ruby Hill Dog Park",
    "street": "",
    "city": "Denver",
    "state": "CO",
    "zip": "",
    "latitude": 39.7392364,
    "longitude": -104.984862,
    "description": "Ruby Hill Dog Park is well-regarded by Denver dog owners, holding 4.7 stars across 7 reviews. Dog owners looking for a solid destination will find this park delivers. Nearby, Cheesman Park (0.0 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Chaffee Park",
    "street": "1901 W 43rd Ave",
    "city": "Denver",
    "state": "CO",
    "zip": "80211",
    "latitude": 39.775423,
    "longitude": -105.010119,
    "description": "At 1901 W 43rd Ave in Denver, Chaffee Park has built a loyal following—4.6 stars from 67 dog owner reviews. The park serves dog owners well, providing a destination the community values. More dog-friendly parks nearby include Rail Yard Dog Park (1.4 miles) and Confluence Park (1.4 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Tony Grampsas Dog Park",
    "street": "4471 Salvia StGolden",
    "city": "Denver",
    "state": "CO",
    "zip": "80403",
    "latitude": 39.7731854,
    "longitude": -105.1890954,
    "description": "Dog owners in Denver have made Tony Grampsas Dog Park at 4471 Salvia St a go-to spot, rating it 4.6 stars across 329 reviews. Open from 6am to 10pm daily, the park offers flexibility for dog owners with varying routines. Other dog parks in the area include Chester-Portsmouth Park (2.9 miles) and West Arvada Dog Park (3.2 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Cherry Creek Park",
    "street": "4 S University Blvd",
    "city": "Denver",
    "state": "CO",
    "zip": "80209",
    "latitude": 39.7165142,
    "longitude": -104.959419,
    "description": "Denver dog owners rate Cherry Creek Park at 4 S University Blvd highly, with 4.6 stars from 692 visits. Open from 6am to 9pm daily, the park offers flexibility for dog owners with varying routines. Other dog parks in the area include Washington Park (1.1 miles) and Bonnie Brae Park (1.2 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Forsberg Iron Spring Park",
    "street": "15900 W Alameda Pkwy",
    "city": "Denver",
    "state": "CO",
    "zip": "80228",
    "latitude": 39.6837287,
    "longitude": -105.1807041,
    "description": "Denver dog owners rate Forsberg Iron Spring Park at 15900 W Alameda Pkwy highly, with 4.6 stars from 999 visits. Open from 5am to 10pm daily, there's plenty of opportunity for dog owners to find a time that works. For variety, the neighborhood offers more dog parks to explore: Parks, Forestry and Open Space (0.0 miles) and Beech Park (1.7 miles)."
  },
  {
    "name": "Berkeley Lake Park",
    "street": "4601 W 46th Ave",
    "city": "Denver",
    "state": "CO",
    "zip": "80212",
    "latitude": 39.781308,
    "longitude": -105.0478152,
    "description": "1,636 dog owners have made Berkeley Lake Park (4601 W 46th Ave) one of Denver's most trusted parks (4.6 stars). Open from 5am to 11pm daily, the park accommodates a variety of dog owner schedules and routines. Keep the adventure going at other nearby dog parks like Berkeley Dog Park (0.8 miles) or Pferdesteller Park (1.3 miles)."
  },
  {
    "name": "Confluence Park",
    "street": "2250 15th St",
    "city": "Denver",
    "state": "CO",
    "zip": "80202",
    "latitude": 39.7547644,
    "longitude": -105.0072196,
    "description": "2,936 dog owners have made Confluence Park (2250 15th St) one of Denver's most trusted parks (4.6 stars). Open from 5am to 11pm daily, the park accommodates a variety of dog owner schedules and routines. For more dog park adventures, explore Rail Yard Dog Park (0.4 miles) or Speer Blvd Park (0.7 miles) with your furry companion."
  },
  {
    "name": "Cherry Creek State Park",
    "street": "4201 S Parker Rd",
    "city": "Denver",
    "state": "CO",
    "zip": "80014",
    "latitude": 39.6201141,
    "longitude": -104.8414341,
    "description": "Cherry Creek State Park at 4201 S Parker Rd has become essential for Denver dog owners, earning 4.6 stars from 9,064 visitors. Open from 5am to 10pm daily, dog owners can visit during quieter hours or join the regular crowd. Nearby, Sagebrush Park (1.6 miles) gives dog owners even more space to explore with their four-legged companions."
  },
  {
    "name": "Spring Canyon Park",
    "street": "3156 S Overland Trail",
    "city": "Fort Collins",
    "state": "CO",
    "zip": "80526",
    "latitude": 40.545466,
    "longitude": -105.131479,
    "description": "For Fort Collins dog owners, Spring Canyon Park at 3156 S Overland Trail has become a reliable favorite—4.8 stars from 1,710 reviews. Open from 5am to 11pm daily, the park is convenient for before work, after work, or weekend adventures. Want to give your pup even more adventure? Spring Canyon Dog Park is another beloved dog park just 0.6 miles away."
  },
  {
    "name": "Fort Collins City Park",
    "street": "1500 W Mulberry St",
    "city": "Fort Collins",
    "state": "CO",
    "zip": "80521",
    "latitude": 40.58193,
    "longitude": -105.102022,
    "description": "Local dog owners love Fort Collins City Park at 1500 W Mulberry St in Fort Collins—4.7 stars from an impressive 2,873 reviews. Open from 5am to 11pm daily, dog owners can easily fit a visit into their day, whether morning or evening. For variety, many dog owners also bring their furry friends to Rogers Park (1.2 miles)—another great dog park in the area."
  },
  {
    "name": "Fossil Creek Park",
    "street": "5821 S Lemay Ave",
    "city": "Fort Collins",
    "state": "CO",
    "zip": "80525",
    "latitude": 40.507568,
    "longitude": -105.0582278,
    "description": "Fossil Creek Park at 5821 S Lemay Ave is a favorite among Fort Collins dog owners, earning 4.7 stars from 1,183 reviews. Open from 5am to 11pm daily, the park is convenient for before work, after work, or weekend adventures. Keep the adventure going at other nearby dog parks like Prairie Dog Meadow Natural (0.7 miles) or Landings Park (1.4 miles)."
  },
  {
    "name": "‍ Riverbend Ponds Natural Area",
    "street": "E Prospect Rd",
    "city": "Fort Collins",
    "state": "CO",
    "zip": "80525",
    "latitude": 40.5670525,
    "longitude": -105.0523728,
    "description": "In Fort Collins, Riverbend Ponds Natural Area earns strong marks from local dog owners—4.7 stars from 988 reviews. Open from 5am to 11pm daily, dog owners have plenty of flexibility to plan a visit. For variety, the neighborhood offers more dog parks to explore: Mallard's Nest Natural Area (0.1 miles) and Creekside Park (1.4 miles)."
  },
  {
    "name": "Reservoir Ridge Natural Area",
    "street": "1425 N Overland Trail",
    "city": "Fort Collins",
    "state": "CO",
    "zip": "80521",
    "latitude": 40.5888819,
    "longitude": -105.1337367,
    "description": "Fort Collins dog owners rate Reservoir Ridge Natural Area at 1425 N Overland Trail highly, with 4.7 stars from 452 visits. Open from 5am to 11pm daily, dog owners can plan visits around work or their pup's energy level. Other dog parks in the area include Rogers Park (0.7 miles) and Overland Park (1.1 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Cathy Fromme Prairie Natural",
    "street": "5381 S Shields St",
    "city": "Fort Collins",
    "state": "CO",
    "zip": "80526",
    "latitude": 40.514802,
    "longitude": -105.0963,
    "description": "At 5381 S Shields St in Fort Collins, Cathy Fromme Prairie Natural has built a loyal following—4.7 stars from 393 dog owner reviews. Open from 5am to 11pm daily, the park works well for dog owners with different schedules. Dog owners can also take their pups to nearby Ridgeview Park (0.5 miles) or Troutman Park (1.0 miles)."
  },
  {
    "name": "Red Fox Meadows Natural Area",
    "street": "1810 S Taft Hill Rd",
    "city": "Fort Collins",
    "state": "CO",
    "zip": "80526",
    "latitude": 40.5640753,
    "longitude": -105.1146128,
    "description": "Dog owners in Fort Collins have made Red Fox Meadows Natural Area at 1810 S Taft Hill Rd a go-to spot, rating it 4.7 stars across 164 reviews. Open from 5am to 11pm daily, there's room in the day for dog owners to bring their furry friends. More dog-friendly parks nearby include Overland Park (1.1 miles) and Rogers Park (1.4 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Sugar Beet Park",
    "street": "607 9th St",
    "city": "Fort Collins",
    "state": "CO",
    "zip": "80524",
    "latitude": 40.5941835,
    "longitude": -105.0576913,
    "description": "With 4.7 stars from 147 reviews, Sugar Beet Park at 607 9th St has become a favorite among Fort Collins dog owners. Open from 5am to 11pm daily, dog owners can plan visits around work or their pup's energy level. Other dog parks in the area include Library Park (1.0 miles) and Soft Gold Park (1.7 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "‍ Mallard's Nest Natural Area",
    "street": "Spring Creek Trl",
    "city": "Fort Collins",
    "state": "CO",
    "zip": "80525",
    "latitude": 40.5651909,
    "longitude": -105.0516697,
    "description": "Mallard's Nest Natural Area (4.7 stars from 64 reviews) is a popular destination for Fort Collins dog owners. Open from 5am to 11pm daily, the park accommodates early risers and evening visitors alike. More dog-friendly parks nearby include Riverbend Ponds Natural Area (0.1 miles) and Creekside Park (1.4 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Severance Dog Park",
    "street": "599 1st StSeverance",
    "city": "Fort Collins",
    "state": "CO",
    "zip": "80550",
    "latitude": 40.5180128,
    "longitude": -104.8512081,
    "description": "Fort Collins dog owners rate Severance Dog Park at 599 1st St highly, with 4.7 stars from 15 visits. For dog owners in the area, this park has become a trusted spot for time with their pups. The consistent ratings suggest dog owners know what to expect here."
  },
  {
    "name": "Troutman Park",
    "street": "500 W Troutman Pkwy",
    "city": "Fort Collins",
    "state": "CO",
    "zip": "80526",
    "latitude": 40.5296438,
    "longitude": -105.092664,
    "description": "For dog owners in the Fort Collins area, Troutman Park (500 W Troutman Pkwy) offers a 4.6-star experience based on 317 reviews. Open from 5am to 11pm daily, dog owners can plan visits around work or their pup's energy level. More dog-friendly parks nearby include Ridgeview Park (0.9 miles) and Cathy Fromme Prairie Natural (1.0 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Library Park",
    "street": "207 Peterson St",
    "city": "Fort Collins",
    "state": "CO",
    "zip": "80524",
    "latitude": 40.5853706,
    "longitude": -105.0720434,
    "description": "For Fort Collins dog owners, Library Park at 207 Peterson St has become a reliable favorite—4.6 stars from 1,000 reviews. Dog owners in the area know they can count on this park for quality time with their pups. Nearby, Sugar Beet Park (1.0 miles) is another dog park favorite where you can take your four-legged friend."
  },
  {
    "name": "Spring Canyon Dog Park",
    "street": "2626 W Horsetooth Rd",
    "city": "Fort Collins",
    "state": "CO",
    "zip": "80526",
    "latitude": 40.5382193,
    "longitude": -105.1244134,
    "description": "Spring Canyon Dog Park at 2626 W Horsetooth Rd is a favorite among Fort Collins dog owners, earning 4.6 stars from 1,182 reviews. For dog owners seeking a tried-and-true destination, this park delivers consistently. Dog owners in the area also love bringing their pups to Spring Canyon Park (0.6 miles) and Rossborough Park (1.0 miles)."
  },
  {
    "name": "Twin Silo Dog Park",
    "street": "5400 Ziegler Rd",
    "city": "Fort Collins",
    "state": "CO",
    "zip": "80528",
    "latitude": 40.5135225,
    "longitude": -105.019873,
    "description": "Twin Silo Dog Park (4.5 stars from 34 reviews) is a popular destination for Fort Collins dog owners, located at 5400 Ziegler Rd. Dog owners frequent this park for its consistent quality and welcoming atmosphere. Nearby, Harmony Park (0.3 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Beattie Park",
    "street": "3013 Meadowlark Ave",
    "city": "Fort Collins",
    "state": "CO",
    "zip": "80526",
    "latitude": 40.5461571,
    "longitude": -105.0861946,
    "description": "Dog owners in Fort Collins have made Beattie Park at 3013 Meadowlark Ave a go-to spot, rating it 4.5 stars across 35 reviews. Local dog owners appreciate what this park offers their four-legged friends. Looking for more places to take your pup? Woodwest Park is another popular dog park just 0.3 miles away."
  },
  {
    "name": "Registry Park",
    "street": "6820 Ranger Dr",
    "city": "Fort Collins",
    "state": "CO",
    "zip": "80526",
    "latitude": 40.4906177,
    "longitude": -105.1051954,
    "description": "Registry Park (4.5 stars from 50 reviews) is a popular destination for Fort Collins dog owners, located at 6820 Ranger Dr. Open from 5am to 11pm daily, the park offers flexibility for dog owners with varying routines. Nearby, Cathy Fromme Prairie Natural (1.7 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Canyon View Park",
    "street": "730 24 Rd",
    "city": "Grand Junction",
    "state": "CO",
    "zip": "81505",
    "latitude": 39.109532,
    "longitude": -108.6082681,
    "description": "Canyon View Park at 730 24 Rd in Grand Junction is a community favorite, with 2,210 dog owners giving it 4.7 stars. Open from 5am to 9pm daily, dog owners have room to work around busy schedules. Nearby, Las Colonias Dog Park (4.9 miles) is another dog park favorite where you can take your four-legged friend."
  },
  {
    "name": "Las Colonias Park",
    "street": "1601 Riverfront Dr",
    "city": "Grand Junction",
    "state": "CO",
    "zip": "81501",
    "latitude": 39.0560952,
    "longitude": -108.546753,
    "description": "Las Colonias Park at 1601 Riverfront Dr is well-regarded by Grand Junction dog owners, holding 4.6 stars across 96 reviews. Dog owners frequent this park for its consistent quality and welcoming atmosphere. Dog owners exploring the neighborhood can also bring their furry friends to Las Colonias Dog Park (0.1 miles)."
  },
  {
    "name": "Las Colonias Dog Park",
    "street": "1351 Riverfront Dr",
    "city": "Grand Junction",
    "state": "CO",
    "zip": "81501",
    "latitude": 39.0557602,
    "longitude": -108.5484788,
    "description": "Grand Junction dog owners rate Las Colonias Dog Park at 1351 Riverfront Dr highly, with 4.5 stars from 80 visits. Dog owners looking for a solid destination will find this park delivers. Other dog parks in the area include Las Colonias Park (0.1 miles) and Canyon View Park (4.9 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Glenmere Park",
    "street": "",
    "city": "Greeley",
    "state": "CO",
    "zip": "",
    "latitude": 40.4233142,
    "longitude": -104.7091322,
    "description": "With 4.7 stars across 1,165 reviews, Glenmere Park has clearly won over Greeley dog owners. Open from 5am to 11pm daily, dog owners have room to work around busy schedules. Other popular dog parks nearby include Brentwood Park (1.0 miles) and Woodbriar Park (1.3 miles)—both favorites among local pup parents."
  },
  {
    "name": "Woodbriar Park",
    "street": "2910 W 18th St",
    "city": "Greeley",
    "state": "CO",
    "zip": "80634",
    "latitude": 40.41089,
    "longitude": -104.7282343,
    "description": "Woodbriar Park at 2910 W 18th St is well-regarded by Greeley dog owners, holding 4.6 stars across 254 reviews. Dog owners frequent this park for its consistent quality and welcoming atmosphere. Dog owners can also take their pups to nearby Broadview Park (0.2 miles) or Glenmere Park (1.3 miles)."
  },
  {
    "name": "Monfort Park",
    "street": "2122 50th Ave",
    "city": "Greeley",
    "state": "CO",
    "zip": "80634",
    "latitude": 40.4042308,
    "longitude": -104.7608371,
    "description": "With 4.5 stars from 325 reviews, Monfort Park at 2122 50th Ave has become a favorite among Greeley dog owners. Open from 5am to 11pm daily, the park accommodates early risers and evening visitors alike. Dog owners exploring the neighborhood can also bring their furry friends to Broadview Park (1.7 miles)."
  },
  {
    "name": "Freedom Park",
    "street": "2095 42nd StEvans",
    "city": "Greeley",
    "state": "CO",
    "zip": "80620",
    "latitude": 40.3709245,
    "longitude": -104.7127881,
    "description": "At 2095 42nd St in Greeley, Freedom Park has built a loyal following—4.5 stars from 359 dog owner reviews. Open from 5am to 10pm daily, there's room in the day for dog owners to bring their furry friends. More dog-friendly parks nearby include Broadview Park (2.7 miles) and Woodbriar Park (2.9 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Rover Run Dog Park",
    "street": "Poudre River Trail",
    "city": "Greeley",
    "state": "CO",
    "zip": "80631",
    "latitude": 40.4410336,
    "longitude": -104.6981349,
    "description": "Rover Run Dog Park holds a 4.4-star rating from 117 Greeley dog owner visits. Open from 5am to 11pm daily, the park is accessible for dog owners in the area. Nearby dog parks worth exploring with your pup include Brentwood Park (0.5 miles) and Glenmere Park (1.4 miles)."
  },
  {
    "name": "Brentwood Park",
    "street": "1607 C St",
    "city": "Greeley",
    "state": "CO",
    "zip": "80631",
    "latitude": 40.4372276,
    "longitude": -104.7055587,
    "description": "At 1607 C St, Brentwood Park has 4.2 stars based on 35 reviews from Greeley dog owners. This park provides dog owners in the community with a place to visit with their dogs. Nearby dog parks worth exploring with your pup include Rover Run Dog Park (0.5 miles) and Glenmere Park (1.0 miles)."
  },
  {
    "name": "Broadview Park",
    "street": "16 28th Ave",
    "city": "Greeley",
    "state": "CO",
    "zip": "80634",
    "latitude": 40.4074525,
    "longitude": -104.7283421,
    "description": "Broadview Park at 16 28th Ave holds a 4.3-star rating from 219 Greeley dog owner visits. This park provides dog owners in the community with a place to visit with their dogs. Nearby dog parks worth exploring with your pup include Woodbriar Park (0.2 miles) and Glenmere Park (1.5 miles)."
  },
  {
    "name": "Coyote Run Park",
    "street": "5051 A St",
    "city": "Greeley",
    "state": "CO",
    "zip": "80634",
    "latitude": 40.4352981,
    "longitude": -104.7616976,
    "description": "At 5051 A St in Greeley, Coyote Run Park carries 4.2 stars from 82 dog owner reviews. Open from 5am to 11pm daily, dog owners have flexibility to plan a visit with their four-legged friends. For pups who want more adventure, Monfort Park is a nearby dog park worth visiting (2.1 miles)."
  },
  {
    "name": "‍ Bear Creek Greenbelt",
    "street": "2800 S Estes St",
    "city": "Lakewood",
    "state": "CO",
    "zip": "80227",
    "latitude": 39.6651569,
    "longitude": -105.0946377,
    "description": "At 2800 S Estes St in Lakewood, Bear Creek Greenbelt stands out with 4.7 stars from 1,008 happy dog owners. Open from 5am to 10pm daily, the park is convenient for before work, after work, or weekend adventures. Nearby, Lakewood City Urban Parks Park (0.1 miles) is another dog park favorite where you can take your four-legged friend."
  },
  {
    "name": "Parks, Forestry and Open Space",
    "street": "15900 W Alameda Pkwy",
    "city": "Lakewood",
    "state": "CO",
    "zip": "80228",
    "latitude": 39.6837287,
    "longitude": -105.1807041,
    "description": "Parks, Forestry and Open Space at 15900 W Alameda Pkwy is well-regarded by Lakewood dog owners, holding 4.7 stars across 254 reviews. Local dog owners appreciate what this park offers their four-legged friends. Looking for more places to take your pup? Forsberg Iron Spring Park is another popular dog park just 0.0 miles away."
  },
  {
    "name": "‍ Lakewood City Urban Parks Park",
    "street": "2775 S Estes St",
    "city": "Lakewood",
    "state": "CO",
    "zip": "80227",
    "latitude": 39.664779,
    "longitude": -105.0963574,
    "description": "Lakewood City Urban Parks Park (4.8 stars from 32 reviews) is a popular destination for Lakewood dog owners, located at 2775 S Estes St. Open from 6am to 10pm daily, dog owners can plan visits around work or their pup's energy level. For a change of scenery, Bear Creek Greenbelt is another dog-friendly destination 0.1 miles from here."
  },
  {
    "name": "Foothills Park",
    "street": "",
    "city": "Lakewood",
    "state": "CO",
    "zip": "",
    "latitude": 39.7085736,
    "longitude": -105.0846694,
    "description": "Foothills Park is well-regarded by Lakewood dog owners, holding 4.6 stars across 165 reviews. Open from 5am to 10pm daily, the park offers flexibility for dog owners with varying routines. Looking for more places to take your pup? O'Kane Park is another popular dog park just 0.9 miles away."
  },
  {
    "name": "Hutchinson Park",
    "street": "2030 S Wright St",
    "city": "Lakewood",
    "state": "CO",
    "zip": "80228",
    "latitude": 39.6761132,
    "longitude": -105.1345189,
    "description": "Dog owners in Lakewood have made Hutchinson Park at 2030 S Wright St a go-to spot, rating it 4.6 stars across 32 reviews. Open from 5am to 10pm daily, there's plenty of opportunity for dog owners to find a time that works. More dog-friendly parks nearby include Beech Park (1.1 miles) and Jewell Park (1.9 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Union Square Park",
    "street": "12200 W 2nd Pl",
    "city": "Lakewood",
    "state": "CO",
    "zip": "80228",
    "latitude": 39.7186418,
    "longitude": -105.1356398,
    "description": "Lakewood dog owners rate Union Square Park at 12200 W 2nd Pl highly, with 4.5 stars from 226 visits. Open from 5am to 10pm daily, dog owners can plan visits around work or their pup's energy level. Other dog parks in the area include Union Ridge Park (0.6 miles) and Sunset Park (1.5 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Beech Park",
    "street": "1682 S Beech St",
    "city": "Lakewood",
    "state": "CO",
    "zip": "80228",
    "latitude": 39.6877996,
    "longitude": -105.1482992,
    "description": "Beech Park (4.5 stars from 107 reviews) is a popular destination for Lakewood dog owners, located at 1682 S Beech St. Open from 5am to 10pm daily, the park offers flexibility for dog owners with varying routines. For variety, the neighborhood offers more dog parks to explore: Hutchinson Park (1.1 miles) and Forsberg Iron Spring Park (1.7 miles)."
  },
  {
    "name": "Jewell Park",
    "street": "1850 S Garrison St",
    "city": "Lakewood",
    "state": "CO",
    "zip": "80232",
    "latitude": 39.6836509,
    "longitude": -105.1001484,
    "description": "With 4.5 stars from 79 reviews, Jewell Park at 1850 S Garrison St has become a favorite among Lakewood dog owners. Open from 6am to 10pm daily, the park offers flexibility for dog owners with varying routines. More dog-friendly parks nearby include Bear Creek Greenbelt (1.3 miles) and Lakewood City Urban Parks Park (1.3 miles)—perfect for pups who love adventure."
  },
  {
    "name": "‍ Union Ridge Park",
    "street": "500 Zang St",
    "city": "Lakewood",
    "state": "CO",
    "zip": "80228",
    "latitude": 39.72159,
    "longitude": -105.145701,
    "description": "Lakewood dog owners rate Union Ridge Park at 500 Zang St highly, with 4.5 stars from 55 visits. Open from 5am to 10pm daily, the park accommodates early risers and evening visitors alike. Nearby, Union Square Park (0.6 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Chester-Portsmouth Park",
    "street": "12555 W 27th Ave",
    "city": "Lakewood",
    "state": "CO",
    "zip": "80215",
    "latitude": 39.7556974,
    "longitude": -105.1391169,
    "description": "Dog owners in Lakewood have rated Chester-Portsmouth Park (12555 W 27th Ave) 4.4 stars across 164 reviews. Open from 6am to 9pm daily, local dog owners have time to explore with their furry companions. Dog owners might also enjoy Sunset Park, another dog park just 1.9 miles away."
  },
  {
    "name": "Sunset Park",
    "street": "10500 W 12th Ave",
    "city": "Lakewood",
    "state": "CO",
    "zip": "80215",
    "latitude": 39.734597,
    "longitude": -105.115654,
    "description": "At 10500 W 12th Ave, Sunset Park has 4.3 stars based on 302 reviews from Lakewood dog owners. Open from 5am to 10pm daily, the park fits conveniently into different routines. Looking to explore more? Union Square Park is another dog-friendly park 1.5 miles from here."
  },
  {
    "name": "Westborough Park",
    "street": "9600 W Dartmouth Ave",
    "city": "Lakewood",
    "state": "CO",
    "zip": "80227",
    "latitude": 39.659581,
    "longitude": -105.0957395,
    "description": "At 9600 W Dartmouth Ave, Westborough Park has 4.1 stars based on 22 reviews from Lakewood dog owners. Open from 5:30am to 10pm daily, the park fits conveniently into different routines. Dog owners looking for variety can also visit Lakewood City Urban Parks Park (0.4 miles) or Bear Creek Greenbelt (0.4 miles) with their four-legged friends."
  },
  {
    "name": "Walker-Branch Park",
    "street": "5825 W 16th Ave",
    "city": "Lakewood",
    "state": "CO",
    "zip": "80214",
    "latitude": 39.7422659,
    "longitude": -105.0606214,
    "description": "At 5825 W 16th Ave in Lakewood, Walker-Branch Park carries 4.2 stars from 258 dog owner reviews. Open from 5am to 10pm daily, the park is accessible for dog owners in the area. Dog owners in the neighborhood can also take their furry friends to Mountair Park, 0.3 miles away."
  },
  {
    "name": "Fruitdale Park",
    "street": "4700 Miller StWheat Ridge",
    "city": "Lakewood",
    "state": "CO",
    "zip": "80033",
    "latitude": 39.782799,
    "longitude": -105.11423,
    "description": "Fruitdale Park at 4700 Miller St in Lakewood has 4.2 stars from 309 dog owner reviews. Open from 5am to 10pm daily, local dog owners have time to explore with their furry companions. For dog owners who like to explore, Fruitdale Dog Park (0.3 miles) and Chester-Portsmouth Park (2.3 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "Mountair Park",
    "street": "5620 W 14th Ave",
    "city": "Lakewood",
    "state": "CO",
    "zip": "80214",
    "latitude": 39.7377151,
    "longitude": -105.0586962,
    "description": "Dog owners in Lakewood have rated Mountair Park (5620 W 14th Ave) 4.1 stars across 409 reviews. Open from 5am to 10pm daily, the park gives dog owners in the neighborhood time to bring their pups. For dog owners who like to explore, Walker-Branch Park (0.3 miles) and O'Kane Park (1.5 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "Dawson Park",
    "street": "1757 Harvard St",
    "city": "Longmont",
    "state": "CO",
    "zip": "80503",
    "latitude": 40.1919048,
    "longitude": -105.1387977,
    "description": "Dawson Park at 1757 Harvard St is well-regarded by Longmont dog owners, holding 4.7 stars across 581 reviews. Open from 9am to 10pm daily, there's room in the day for dog owners to bring their furry friends. For a change of scenery, Willow Farm Park is another dog-friendly destination 1.0 miles from here."
  },
  {
    "name": "Left Hand Creek Park",
    "street": "1800 Creekside Dr",
    "city": "Longmont",
    "state": "CO",
    "zip": "80504",
    "latitude": 40.137009,
    "longitude": -105.115419,
    "description": "Left Hand Creek Park (4.7 stars from 315 reviews) is a popular destination for Longmont dog owners, located at 1800 Creekside Dr. The park serves dog owners well, providing a destination the community values. Nearby, Kensington Park (2.6 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "‍ Willow Farm Park",
    "street": "901 S Fordham St",
    "city": "Longmont",
    "state": "CO",
    "zip": "80503",
    "latitude": 40.177525,
    "longitude": -105.1362229,
    "description": "Willow Farm Park at 901 S Fordham St is well-regarded by Longmont dog owners, holding 4.7 stars across 293 reviews. Open from 5am to 11pm daily, there's plenty of opportunity for dog owners to find a time that works. Dog owners can also take their pups to nearby Dawson Park (1.0 miles) or City of Longmont Dog Park (1.8 miles)."
  },
  {
    "name": "Stephen Day Park",
    "street": "1340 Deerwood Dr",
    "city": "Longmont",
    "state": "CO",
    "zip": "80501",
    "latitude": 40.1824926,
    "longitude": -105.0648097,
    "description": "Longmont dog owners rate Stephen Day Park at 1340 Deerwood Dr highly, with 4.6 stars from 248 visits. Open from 5am to 11pm daily, the park offers flexibility for dog owners with varying routines. Nearby, Rough & Ready Park (1.6 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Rough & Ready Park",
    "street": "301 E 21st Ave",
    "city": "Longmont",
    "state": "CO",
    "zip": "80504",
    "latitude": 40.1957869,
    "longitude": -105.0888991,
    "description": "For dog owners in Longmont, Rough & Ready Park at 301 E 21st Ave has a 4.4-star rating (375 reviews). Open from 7am to 8pm daily, dog owners can stop by when it fits their schedule. Nearby dog parks worth exploring with your pup include City of Longmont Dog Park (1.2 miles) and Stephen Day Park (1.6 miles)."
  },
  {
    "name": "Blue Skies Park",
    "street": "1520 Mountain Dr",
    "city": "Longmont",
    "state": "CO",
    "zip": "80503",
    "latitude": 40.1414797,
    "longitude": -105.1749568,
    "description": "115 dog owners have reviewed Blue Skies Park at 1520 Mountain Dr in Longmont, averaging 4.3 stars. The park gives neighborhood dog owners a destination for outings with their four-legged friends. More dog parks in the area include Left Hand Creek Park (3.2 miles) and Willow Farm Park (3.2 miles)—great options for mixing up your pup's routine."
  },
  {
    "name": "Kensington Park",
    "street": "100 Longs Peak Ave",
    "city": "Longmont",
    "state": "CO",
    "zip": "80504",
    "latitude": 40.170742,
    "longitude": -105.094945,
    "description": "At 100 Longs Peak Ave, Kensington Park has 4.3 stars based on 140 reviews from Longmont dog owners. This park provides dog owners in the community with a place to visit with their dogs. More dog parks in the area include Rough & Ready Park (1.8 miles) and Stephen Day Park (1.8 miles)—great options for mixing up your pup's routine."
  },
  {
    "name": "‍ City of Longmont Dog Park",
    "street": "1505 21st Ave",
    "city": "Longmont",
    "state": "CO",
    "zip": "80501",
    "latitude": 40.1959988,
    "longitude": -105.1123933,
    "description": "338 dog owners have reviewed City of Longmont Dog Park at 1505 21st Ave in Longmont, averaging 4.3 stars. The neighborhood benefits from having this park as an option for dog owners and their pups. More dog parks in the area include Rough & Ready Park (1.2 miles) and Dawson Park (1.4 miles)—great options for mixing up your pup's routine."
  },
  {
    "name": "Mehaffey Park",
    "street": "3285 W 22nd St",
    "city": "Loveland",
    "state": "CO",
    "zip": "80538",
    "latitude": 40.4146735,
    "longitude": -105.1221235,
    "description": "With 4.7 stars from 638 reviews, Mehaffey Park at 3285 W 22nd St has become a favorite among Loveland dog owners. Open from 6am to 10:30pm daily, the park offers flexibility for dog owners with varying routines. For a change of scenery, Dwayne Webster Veterans Park is another dog-friendly destination 0.7 miles from here."
  },
  {
    "name": "Kirkview Park",
    "street": "2305 Mountain View Dr",
    "city": "Loveland",
    "state": "CO",
    "zip": "80538",
    "latitude": 40.4172656,
    "longitude": -105.0739407,
    "description": "Kirkview Park at 2305 Mountain View Dr is well-regarded by Loveland dog owners, holding 4.7 stars across 36 reviews. Open from 6am to 10:30pm daily, there's plenty of opportunity for dog owners to find a time that works. Other dog parks in the area include Fairgrounds Park (2.1 miles) and Dwayne Webster Veterans Park (2.2 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Fairgrounds Park",
    "street": "700 S Railroad Ave",
    "city": "Loveland",
    "state": "CO",
    "zip": "80537",
    "latitude": 40.3876197,
    "longitude": -105.078755,
    "description": "Local dog owners love Fairgrounds Park at 700 S Railroad Ave in Loveland—4.6 stars from an impressive 1,508 reviews. Open from 6am to 10:30pm daily, the park accommodates a variety of dog owner schedules and routines. Keep the adventure going at other nearby dog parks like Dog Park (0.3 miles) or Kirkview Park (2.1 miles)."
  },
  {
    "name": "Dwayne Webster Veterans Park",
    "street": "400-422 W Eisenhower Blvd",
    "city": "Loveland",
    "state": "CO",
    "zip": "80537",
    "latitude": 40.4073893,
    "longitude": -105.1138871,
    "description": "Dog owners in Loveland have made Dwayne Webster Veterans Park at 400-422 W Eisenhower Blvd a go-to spot, rating it 4.6 stars across 509 reviews. Open from 6:30am to 10:30pm daily, there's plenty of opportunity for dog owners to find a time that works. Looking for more places to take your pup? Mehaffey Park is another popular dog park just 0.7 miles away."
  },
  {
    "name": "Berthoud Dog Park",
    "street": "202 10th StBerthoud",
    "city": "Loveland",
    "state": "CO",
    "zip": "80513",
    "latitude": 40.2989916,
    "longitude": -105.0898091,
    "description": "At 202 10th St, Berthoud Dog Park has 4.3 stars based on 30 reviews from Loveland dog owners. Open from 5am to 9pm daily, dog owners can stop by when it fits their schedule. Reading what other dog owners have experienced here can help with planning a visit."
  },
  {
    "name": "Dog Park",
    "street": "Fire Engine Red Rd",
    "city": "Loveland",
    "state": "CO",
    "zip": "80537",
    "latitude": 40.382813,
    "longitude": -105.0794464,
    "description": "Dog owners in Loveland have rated Dog Park 4.3 stars across 270 reviews. Open from 6am to 10:30pm daily, dog owners can stop by when it fits their schedule. Nearby dog parks worth exploring with your pup include Fairgrounds Park (0.3 miles) and Kirkview Park (2.4 miles)."
  },
  {
    "name": "Bluffs Regional Park",
    "street": "",
    "city": "Parker",
    "state": "CO",
    "zip": "",
    "latitude": 39.5364152,
    "longitude": -104.9041528,
    "description": "1,067 dog owners have made Bluffs Regional Park one of Parker's most trusted parks (4.7 stars). This park has clearly won over local dog owners who return again and again with their furry friends. The community of dog owners has clearly embraced this as a trusted spot."
  },
  {
    "name": "Dove Village Park",
    "street": "8936 Snowball Wy",
    "city": "Parker",
    "state": "CO",
    "zip": "80134",
    "latitude": 39.554411,
    "longitude": -104.7979511,
    "description": "Dove Village Park at 8936 Snowball Wy is well-regarded by Parker dog owners, holding 4.7 stars across 7 reviews. The steady stream of dog owner visits speaks to the park's appeal. For variety, the neighborhood offers more dog parks to explore: USMC CPL David M. Sonka Dog (1.1 miles) and Bar CCC Park (3.5 miles)."
  },
  {
    "name": "Bayou Gulch Dog Park",
    "street": "4728 Fox Sparrow Rd",
    "city": "Parker",
    "state": "CO",
    "zip": "80134",
    "latitude": 39.4306648,
    "longitude": -104.7331428,
    "description": "Parker dog owners rate Bayou Gulch Dog Park at 4728 Fox Sparrow Rd highly, with 4.6 stars from 192 visits. Open from 6am to 8:30pm daily, the park accommodates early risers and evening visitors alike. The steady stream of positive reviews suggests dog owners consistently have good experiences here."
  },
  {
    "name": "USMC CPL David M. Sonka Dog",
    "street": "17855 Pine Ln",
    "city": "Parker",
    "state": "CO",
    "zip": "80134",
    "latitude": 39.5449477,
    "longitude": -104.7815303,
    "description": "Parker dog owners rate USMC CPL David M. Sonka Dog at 17855 Pine Ln highly, with 4.6 stars from 597 visits. Open from 6am to 11pm daily, dog owners can plan visits around work or their pup's energy level. Nearby, Dove Village Park (1.1 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Riva Ridge Parks Park",
    "street": "Riva Ridge Dr",
    "city": "Parker",
    "state": "CO",
    "zip": "80138",
    "latitude": 39.5135479,
    "longitude": -104.739021,
    "description": "Riva Ridge Parks Park (4.5 stars from 85 reviews) is a popular destination for Parker dog owners. Local dog owners appreciate what this park offers their four-legged friends. For a change of scenery, Iron Horse Park is another dog-friendly destination 1.0 miles from here."
  },
  {
    "name": "Iron Horse Park",
    "street": "20151 Tallman Dr",
    "city": "Parker",
    "state": "CO",
    "zip": "80138",
    "latitude": 39.5060532,
    "longitude": -104.7551748,
    "description": "At 20151 Tallman Dr, Iron Horse Park has 4.3 stars based on 72 reviews from Parker dog owners. Open from 6am to 11pm daily, dog owners have flexibility to plan a visit with their four-legged friends. For pups who want more adventure, Bar CCC Park is a nearby dog park worth visiting (0.6 miles)."
  },
  {
    "name": "Bar CCC Park",
    "street": "10951 S Twenty Mile Rd",
    "city": "Parker",
    "state": "CO",
    "zip": "80134",
    "latitude": 39.5101239,
    "longitude": -104.7645175,
    "description": "Bar CCC Park at 10951 S Twenty Mile Rd holds a 4.2-star rating from 75 Parker dog owner visits. Open from 6am to 11pm daily, dog owners in the area can work a visit into their day. Nearby dog parks worth exploring with your pup include Iron Horse Park (0.6 miles) and Riva Ridge Parks Park (1.4 miles)."
  },
  {
    "name": "City Park",
    "street": "301 Parkside Ln",
    "city": "Pueblo",
    "state": "CO",
    "zip": "81005",
    "latitude": 38.2662286,
    "longitude": -104.6598551,
    "description": "At 301 Parkside Ln in Pueblo, City Park has built a loyal following—4.4 stars from 711 dog owner reviews. Open from 6am to 10pm daily, the park offers flexibility for dog owners with varying routines. Dog owners looking for a dependable spot will find this park lives up to its ratings."
  },
  {
    "name": "Waggin’ Tails Dog Park",
    "street": "340 E Hahns Peak Ave",
    "city": "Pueblo",
    "state": "CO",
    "zip": "81007",
    "latitude": 38.319666,
    "longitude": -104.727162,
    "description": "Waggin’ Tails Dog Park at 340 E Hahns Peak Ave in Pueblo has 4.1 stars from 114 dog owner reviews. Open from 5am to 9pm daily, local dog owners have time to explore with their furry companions. Dog owners new to the area may find the visitor reviews useful for learning about this park."
  },
  {
    "name": "‍ Carpenter Park",
    "street": "3498 E 112th Ave",
    "city": "Thornton",
    "state": "CO",
    "zip": "80233",
    "latitude": 39.899302,
    "longitude": -104.945069,
    "description": "Carpenter Park at 3498 E 112th Ave in Thornton is a community favorite, with 2,208 dog owners giving it 4.7 stars. Open from 6am to 11pm daily, the park accommodates a variety of dog owner schedules and routines. For variety, many dog owners also bring their furry friends to Carpenter Park (0.3 miles)—another great dog park in the area."
  },
  {
    "name": "The Great Bark Dog Park",
    "street": "597 N 119th St",
    "city": "Thornton",
    "state": "CO",
    "zip": "80026",
    "latitude": 40.0047263,
    "longitude": -105.0757811,
    "description": "Dog owners in Thornton have made The Great Bark Dog Park at 597 N 119th St a go-to spot, rating it 4.6 stars across 508 reviews. Open from 6am to 10pm daily, the park accommodates early risers and evening visitors alike. Dog owners exploring the neighborhood can also bring their furry friends to Louisville Community (Dog) (3.8 miles)."
  },
  {
    "name": "Eastlake #3 Park",
    "street": "12500 Fillmore St",
    "city": "Thornton",
    "state": "CO",
    "zip": "80241",
    "latitude": 39.925824,
    "longitude": -104.9554055,
    "description": "Thornton dog owners rate Eastlake #3 Park at 12500 Fillmore St highly, with 4.6 stars from 106 visits. The park serves dog owners well, providing a destination the community values. More dog-friendly parks nearby include Cottonwood Park (0.6 miles) and Brookshire Park (0.9 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Cottonwood Park",
    "street": "13090 Cottonwood Lakes Blvd",
    "city": "Thornton",
    "state": "CO",
    "zip": "80241",
    "latitude": 39.9322599,
    "longitude": -104.9464933,
    "description": "For dog owners in the Thornton area, Cottonwood Park (13090 Cottonwood Lakes Blvd) offers a 4.6-star experience based on 64 reviews. Open from 6am to 10pm daily, the park offers flexibility for dog owners with varying routines. Dog owners can also take their pups to nearby Summit Grove Park (0.4 miles) or Eastlake #3 Park (0.6 miles)."
  },
  {
    "name": "Summit Grove Park",
    "street": "13420 Garfield Pkwy",
    "city": "Thornton",
    "state": "CO",
    "zip": "80241",
    "latitude": 39.9379392,
    "longitude": -104.9439053,
    "description": "For dog owners in the Thornton area, Summit Grove Park (13420 Garfield Pkwy) offers a 4.6-star experience based on 45 reviews. Open from 6am to 11pm daily, the park offers flexibility for dog owners with varying routines. Other dog parks in the area include Cottonwood Park (0.4 miles) and Cherrywood Park (0.6 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Niver Creek Open Space",
    "street": "",
    "city": "Thornton",
    "state": "CO",
    "zip": "",
    "latitude": 39.8695516,
    "longitude": -104.985181,
    "description": "In Thornton, Niver Creek Open Space earns strong marks from local dog owners—4.6 stars from 21 reviews. Open from 6am to 10pm daily, dog owners have plenty of flexibility to plan a visit. Looking for more places to take your pup? Colony Park is another popular dog park just 0.0 miles away."
  },
  {
    "name": "Pelican Ponds Open Space",
    "street": "9200 Riverdale Rd",
    "city": "Thornton",
    "state": "CO",
    "zip": "80229",
    "latitude": 39.8590545,
    "longitude": -104.9374923,
    "description": "At 9200 Riverdale Rd in Thornton, Pelican Ponds Open Space has built a loyal following—4.5 stars from 324 dog owner reviews. Dog owners looking for a solid destination will find this park delivers. More dog-friendly parks nearby include Lilly Park (1.3 miles) and Northstar Park (2.3 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Happy Tails Dog Park",
    "street": "1111 Judicial Center Dr",
    "city": "Thornton",
    "state": "CO",
    "zip": "80601",
    "latitude": 39.9679164,
    "longitude": -104.763232,
    "description": "At 1111 Judicial Center Dr in Thornton, Happy Tails Dog Park has built a loyal following—4.5 stars from 292 dog owner reviews. Open from 8am to 5pm weekdays, the park accommodates early risers and evening visitors alike. A solid track record makes this a reliable choice for dog owners."
  },
  {
    "name": "Homestead Hills Park",
    "street": "4500 E 140th Ave",
    "city": "Thornton",
    "state": "CO",
    "zip": "80602",
    "latitude": 39.9500527,
    "longitude": -104.9357704,
    "description": "Homestead Hills Park (4.5 stars from 170 reviews) is a popular destination for Thornton dog owners, located at 4500 E 140th Ave. The steady stream of dog owner visits speaks to the park's appeal. Dog owners exploring the neighborhood can also bring their furry friends to Northbrook Park (0.5 miles)."
  },
  {
    "name": "Alvin B. Thomas Park",
    "street": "1800 Leroy DrNorthglenn",
    "city": "Thornton",
    "state": "CO",
    "zip": "80233",
    "latitude": 39.889919,
    "longitude": -104.966145,
    "description": "Located at 1800 Leroy Dr in Thornton, Alvin B. Thomas Park earns strong marks from local dog owners—4.5 stars from 75 reviews. Open from 6am to 11pm daily, the park offers flexibility for dog owners with varying routines. For a change of scenery, Jaycee Park is another dog-friendly destination 0.2 miles from here."
  },
  {
    "name": "Sage Creek Park",
    "street": "12796 Jasmine St",
    "city": "Thornton",
    "state": "CO",
    "zip": "80602",
    "latitude": 39.9276499,
    "longitude": -104.9185159,
    "description": "Sage Creek Park at 12796 Jasmine St is well-regarded by Thornton dog owners, holding 4.5 stars across 62 reviews. Open from 5:30am to 9pm daily, the park works well for dog owners with different schedules. Other dog parks in the area include Trail Winds Park (0.8 miles) and Woodglen Meadows Park (1.0 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Cherrywood Park",
    "street": "13807 Madison St",
    "city": "Thornton",
    "state": "CO",
    "zip": "80602",
    "latitude": 39.9458632,
    "longitude": -104.9467746,
    "description": "Cherrywood Park at 13807 Madison St is well-regarded by Thornton dog owners, holding 4.5 stars across 58 reviews. Open from 6am to 11pm daily, dog owners can plan visits around work or their pup's energy level. More dog-friendly parks nearby include Summit Grove Park (0.6 miles) and Homestead Hills Park (0.7 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Northstar Park",
    "street": "400 E 88th Ave",
    "city": "Thornton",
    "state": "CO",
    "zip": "80260",
    "latitude": 39.8561496,
    "longitude": -104.9804036,
    "description": "Northstar Park at 400 E 88th Ave is well-regarded by Thornton dog owners, holding 4.5 stars across 48 reviews. For dog owners in the area, this park has become a trusted spot for time with their pups. For a change of scenery, Civic Center Park is another dog-friendly destination 0.9 miles from here."
  },
  {
    "name": "Briar Ridge Park",
    "street": "4060 Woodglen Blvd",
    "city": "Thornton",
    "state": "CO",
    "zip": "80233",
    "latitude": 39.9074801,
    "longitude": -104.9396447,
    "description": "With 4.5 stars from 24 reviews, Briar Ridge Park at 4060 Woodglen Blvd has become a favorite among Thornton dog owners. Open from 6am to 10pm daily, the park works well for dog owners with different schedules. Other dog parks in the area include Woodglen / Brookshire Park (0.4 miles) and Cherry Park (0.4 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "North Creek Farms Park",
    "street": "1903 E 164th Pl",
    "city": "Thornton",
    "state": "CO",
    "zip": "80602",
    "latitude": 39.9940989,
    "longitude": -104.9636547,
    "description": "Dog owners in Thornton have rated North Creek Farms Park (1903 E 164th Pl) 4.4 stars across 33 reviews. Open from 6am to 11pm daily, dog owners have a window to spend time with their pups. For dog owners who like to explore, Homestead Hills Park (3.4 miles) and Cherrywood Park (3.5 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "Ketner Open Space",
    "street": "10200 Countryside Dr",
    "city": "‍ Westminster",
    "state": "CO",
    "zip": "80021",
    "latitude": 39.883157,
    "longitude": -105.115126,
    "description": "Westminster dog owners rate Ketner Open Space at 10200 Countryside Dr highly, with 4.6 stars from 241 visits. The steady stream of dog owner visits speaks to the park's appeal. Looking for more places to take your pup? Dog Park is another popular dog park just 0.7 miles away."
  },
  {
    "name": "TeBockhorst Park",
    "street": "6450 W 95th Pl",
    "city": "‍ Westminster",
    "state": "CO",
    "zip": "80021",
    "latitude": 39.8700168,
    "longitude": -105.065353,
    "description": "With 4.6 stars from 16 reviews, TeBockhorst Park at 6450 W 95th Pl has become a favorite among Westminster dog owners. Dog owners frequent this park for its consistent quality and welcoming atmosphere. Nearby, Carroll Butts Park (1.3 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "‍ Squires Park",
    "street": "3450 W 99th Ave",
    "city": "‍ Westminster",
    "state": "CO",
    "zip": "80031",
    "latitude": 39.8759676,
    "longitude": -105.0323241,
    "description": "Westminster dog owners rate Squires Park at 3450 W 99th Ave highly, with 4.5 stars from 246 visits. The park serves dog owners well, providing a destination the community values. For a change of scenery, Carroll Butts Park is another dog-friendly destination 0.7 miles from here."
  },
  {
    "name": "Westminster Hills Park",
    "street": "4105 W 80th Ave",
    "city": "‍ Westminster",
    "state": "CO",
    "zip": "80030",
    "latitude": 39.8417162,
    "longitude": -105.0421784,
    "description": "Dog owners in Westminster have rated Westminster Hills Park (4105 W 80th Ave) 4.4 stars across 104 reviews. This park provides dog owners in the community with a place to visit with their dogs. For dog owners who like to explore, Sunset Park (0.3 miles) and Little Dry Creek Dog Park (1.4 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "Carroll Butts Park",
    "street": "4201 W 94th Ave",
    "city": "‍ Westminster",
    "state": "CO",
    "zip": "80031",
    "latitude": 39.8686285,
    "longitude": -105.0411212,
    "description": "Carroll Butts Park at 4201 W 94th Ave is well-regarded by Westminster dog owners, holding 4.4 stars across 548 reviews. Open from 6am to 11pm daily, the park accommodates early risers and evening visitors alike. Other dog parks in the area include Squires Park (0.7 miles) and TeBockhorst Park (1.3 miles)—both great for exploring with your four-legged friend."
  }
]