[
  {
    "name": "Winslow Park",
    "street": "25 CT-136",
    "city": "Bridgeport",
    "state": "CT",
    "zip": "06880",
    "latitude": 41.1393332,
    "longitude": -73.3528263,
    "description": "For dog owners in the Bridgeport area, Winslow Park (25 CT-136) offers a 4.8-star experience based on 175 reviews. Open from 6am to 9pm daily, dog owners can plan visits around work or their pup's energy level. Dog owners can also take their pups to nearby Riverside Park (1.3 miles) or Gallaher Mansion and Cranbury (3.2 miles)."
  },
  {
    "name": "Rowayton Dog Park",
    "street": "36 McKinley St",
    "city": "Bridgeport",
    "state": "CT",
    "zip": "06853",
    "latitude": 41.0640954,
    "longitude": -73.438052,
    "description": "Bridgeport dog owners rate Rowayton Dog Park at 36 McKinley St highly, with 4.7 stars from 186 visits. For dog owners in the area, this park has become a trusted spot for time with their pups. For a change of scenery, Rowayton Community Center is another dog-friendly destination 0.1 miles from here."
  },
  {
    "name": "Veteran's Dog Park",
    "street": "Park Ave",
    "city": "Bridgeport",
    "state": "CT",
    "zip": "06606",
    "latitude": 41.1927892,
    "longitude": -73.2149254,
    "description": "Veteran's Dog Park (4.9 stars from 22 reviews) is a popular destination for Bridgeport dog owners. Open from 6am to 6pm daily, dog owners can easily fit a visit into busy schedules. For variety, the neighborhood offers more dog parks to explore: Veterans Memorial Park (1.6 miles) and West End Park (1.6 miles)."
  },
  {
    "name": "Woodbridge Dog Park",
    "street": "112-126 Beecher Rd",
    "city": "Bridgeport",
    "state": "CT",
    "zip": "06525",
    "latitude": 41.3420685,
    "longitude": -73.0080545,
    "description": "For dog owners in the Bridgeport area, Woodbridge Dog Park (112-126 Beecher Rd) offers a 4.7-star experience based on 74 reviews. For dog owners in the area, this park has become a trusted spot for time with their pups. Looking for more places to take your pup? Edgewood Park is another popular dog park just 4.9 miles away."
  },
  {
    "name": "Puglio Park",
    "street": "3455 Madison Ave",
    "city": "Bridgeport",
    "state": "CT",
    "zip": "06606",
    "latitude": 41.2201661,
    "longitude": -73.2278287,
    "description": "At 3455 Madison Ave in Bridgeport, Puglio Park has built a loyal following—4.6 stars from 266 dog owner reviews. The park has earned its reputation among dog owners in the neighborhood as a reliable choice. More dog-friendly parks nearby include Veteran's Dog Park (2.0 miles) and Connecticut's Beardsley Zoo (2.5 miles)—perfect for pups who love adventure."
  },
  {
    "name": "‍ Veterans Memorial Park",
    "street": "",
    "city": "Bridgeport",
    "state": "CT",
    "zip": "",
    "latitude": 41.1792695,
    "longitude": -73.1887863,
    "description": "Veterans Memorial Park (4.6 stars from 251 reviews) is a popular destination for Bridgeport dog owners. Open from 5am to 11pm daily, the park accommodates early risers and evening visitors alike. For a change of scenery, West End Park is another dog-friendly destination 0.0 miles from here."
  },
  {
    "name": "Indian Ledge Park",
    "street": "Indian Ledge Park Rd",
    "city": "Bridgeport",
    "state": "CT",
    "zip": "06611",
    "latitude": 41.2786613,
    "longitude": -73.2179956,
    "description": "Indian Ledge Park (4.6 stars from 215 reviews) is a popular destination for Bridgeport dog owners. Open from 9am to 7pm daily, the park works well for dog owners with different schedules. Looking for more places to take your pup? Easton Dog Park is another popular dog park just 3.6 miles away."
  },
  {
    "name": "‍ Jared's Dog Park",
    "street": "700 Peters Ln",
    "city": "Bridgeport",
    "state": "CT",
    "zip": "06614",
    "latitude": 41.2442106,
    "longitude": -73.1218496,
    "description": "Jared's Dog Park (4.6 stars from 28 reviews) is a popular destination for Bridgeport dog owners, located at 700 Peters Ln. Dog owners frequent this park for its consistent quality and welcoming atmosphere. Nearby, Eisenhower Dog Park (3.5 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Seaside Park",
    "street": "1 Barnum Dyke",
    "city": "Bridgeport",
    "state": "CT",
    "zip": "06604",
    "latitude": 41.159981,
    "longitude": -73.204307,
    "description": "Seaside Park at 1 Barnum Dyke is a favorite among Bridgeport dog owners, earning 4.5 stars from 4,925 reviews. Dog owners have embraced this park as a top choice for spending time with their pups. Nearby, Veterans Memorial Park (1.6 miles) is another dog park favorite where you can take your four-legged friend."
  },
  {
    "name": "Shelton Dog Park",
    "street": "Nells Rock Rd",
    "city": "Bridgeport",
    "state": "CT",
    "zip": "06484",
    "latitude": 41.3030662,
    "longitude": -73.1167496,
    "description": "For dog owners in the Bridgeport area, Shelton Dog Park offers a 4.5-star experience based on 197 reviews. Dog owners in the area consistently choose this park as a go-to destination for their pups. Nearby, Jared's Dog Park (4.1 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "‍ Easton Dog Park",
    "street": "360 Sport Hill Rd",
    "city": "Bridgeport",
    "state": "CT",
    "zip": "06612",
    "latitude": 41.2446712,
    "longitude": -73.2715613,
    "description": "44 dog owners have reviewed Easton Dog Park at 360 Sport Hill Rd in Bridgeport, averaging 4.4 stars. Local dog owners use this park as a spot to spend time with their furry companions. Dog owners looking for variety can also visit Puglio Park (2.8 miles) or Indian Ledge Park (3.6 miles) with their four-legged friends."
  },
  {
    "name": "Taylor Farm Dog Park",
    "street": "7 Calf Pasture Beach Rd",
    "city": "Bridgeport",
    "state": "CT",
    "zip": "06855",
    "latitude": 41.094642,
    "longitude": -73.3968997,
    "description": "228 dog owners have reviewed Taylor Farm Dog Park at 7 Calf Pasture Beach Rd in Bridgeport, averaging 4.4 stars. Open from 7am to 8pm daily, the park is accessible for dog owners in the area. Looking to explore more? Shady Beach Park is another dog-friendly park 0.3 miles from here."
  },
  {
    "name": "Eisenhower Dog Park",
    "street": "1001 W River St",
    "city": "Bridgeport",
    "state": "CT",
    "zip": "06461",
    "latitude": 41.256579,
    "longitude": -73.057227,
    "description": "Eisenhower Dog Park at 1001 W River St holds a 4.4-star rating from 255 Bridgeport dog owner visits. The park gives neighborhood dog owners a destination for outings with their four-legged friends. Dog owners looking for variety can also visit Jared's Dog Park (3.5 miles) or Veterans Memorial Dog Park (4.1 miles) with their four-legged friends."
  },
  {
    "name": "Connecticut's Beardsley Zoo",
    "street": "1875 Noble Ave",
    "city": "Bridgeport",
    "state": "CT",
    "zip": "06610",
    "latitude": 41.2108769,
    "longitude": -73.1812118,
    "description": "Bridgeport dog owners rate Connecticut's Beardsley Zoo at 1875 Noble Ave highly, with 4.4 stars from 4,939 visits. Open from 9am to 4pm daily, dog owners have plenty of flexibility to plan a visit. Looking for more places to take your pup? Nob Hill Park is another popular dog park just 0.3 miles away."
  },
  {
    "name": "West End Park",
    "street": "",
    "city": "Bridgeport",
    "state": "CT",
    "zip": "",
    "latitude": 41.1792695,
    "longitude": -73.1887863,
    "description": "West End Park serves dog owners in the Bridgeport neighborhood looking for a place to visit with their pups. Local dog owners use this park as a spot to spend time with their furry companions. Dog owners looking for variety can also visit Veterans Memorial Park (0.0 miles) or Seaside Park (1.6 miles) with their four-legged friends."
  },
  {
    "name": "Nob Hill Park",
    "street": "115 Virginia Ave",
    "city": "Bridgeport",
    "state": "CT",
    "zip": "06610",
    "latitude": 41.2110405,
    "longitude": -73.1763171,
    "description": "Located at 115 Virginia Ave, Nob Hill Park offers Bridgeport dog owners a neighborhood destination for their four-legged friends. Open from 6am to 9pm daily, dog owners have a window to spend time with their pups. Dog owners might also enjoy Connecticut's Beardsley Zoo, another dog park just 0.3 miles away."
  },
  {
    "name": "East Windsor Dog Park",
    "street": "24 Reservoir Ave",
    "city": "Broad Brook",
    "state": "CT",
    "zip": "06016",
    "latitude": 41.9093877,
    "longitude": -72.5402394,
    "description": "Located at 24 Reservoir Ave in Broad Brook, East Windsor Dog Park earns strong marks from local dog owners—4.5 stars from 68 reviews. Open from 6am to 8pm daily, dog owners can plan visits around work or their pup's energy level. Dog owners exploring the neighborhood can also bring their furry friends to The Enfield Dog Park (3.4 miles)."
  },
  {
    "name": "Danbury Dog Park",
    "street": "76 Miry Brook Rd",
    "city": "Danbury",
    "state": "CT",
    "zip": "06810",
    "latitude": 41.3676735,
    "longitude": -73.4865562,
    "description": "Dog owners in Danbury have rated Danbury Dog Park (76 Miry Brook Rd) 4.4 stars across 156 reviews. Open from 7am to 9pm daily, dog owners have a window to spend time with their pups. Looking to explore more? Danbury Dog Park is another dog-friendly park 2.5 miles from here."
  },
  {
    "name": "The Enfield Dog Park",
    "street": "Ecology Dr",
    "city": "Enfield",
    "state": "CT",
    "zip": "06082",
    "latitude": 41.9581131,
    "longitude": -72.5496679,
    "description": "Enfield dog owners rate The Enfield Dog Park highly, with 4.6 stars from 148 visits. Open from 7am to 7pm daily, the park accommodates early risers and evening visitors alike. For a change of scenery, East Windsor Dog Park is another dog-friendly destination 3.4 miles from here."
  },
  {
    "name": "‍ West Hartford Reservoir",
    "street": "",
    "city": "Hartford",
    "state": "CT",
    "zip": "",
    "latitude": 41.7620447,
    "longitude": -72.7420399,
    "description": "In Hartford, West Hartford Reservoir earns strong marks from local dog owners—4.8 stars from 339 reviews. Open from 6:30am to 7:30pm daily, dog owners can plan visits around work or their pup's energy level. Looking for more places to take your pup? Friends of Elizabeth Park is another popular dog park just 1.6 miles away."
  },
  {
    "name": "Friends of Elizabeth Park",
    "street": "1561 Asylum Ave",
    "city": "Hartford",
    "state": "CT",
    "zip": "06117",
    "latitude": 41.777746,
    "longitude": -72.7186115,
    "description": "Hartford dog owners rate Friends of Elizabeth Park at 1561 Asylum Ave highly, with 4.8 stars from 264 visits. Dog owners frequent this park for its consistent quality and welcoming atmosphere. More dog-friendly parks nearby include West Hartford Reservoir (1.6 miles) and Bushnell Park (2.2 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Riverfront Park",
    "street": "300 Welles St",
    "city": "Hartford",
    "state": "CT",
    "zip": "06033",
    "latitude": 41.7140074,
    "longitude": -72.6177477,
    "description": "Riverfront Park at 300 Welles St is a favorite among Hartford dog owners, earning 4.7 stars from 1,003 reviews. Open from 6am to 8:30pm daily, there's always time for dog owners to bring their pup for some quality time. Keep the adventure going at other nearby dog parks like Wethersfield Dog Park (3.0 miles) or Rocky Hill Dog Park (4.0 miles)."
  },
  {
    "name": "Bushnell Park",
    "street": "99 Trinity St",
    "city": "Hartford",
    "state": "CT",
    "zip": "06123",
    "latitude": 41.765482,
    "longitude": -72.679882,
    "description": "For dog owners in the Hartford area, Bushnell Park (99 Trinity St) offers a 4.7-star experience based on 746 reviews. The park has earned its reputation among dog owners in the neighborhood as a reliable choice. Looking for more places to take your pup? Friends of Elizabeth Park is another popular dog park just 2.2 miles away."
  },
  {
    "name": "Friends of Canton Dog Park",
    "street": "79 Commerce Dr",
    "city": "Hartford",
    "state": "CT",
    "zip": "06019",
    "latitude": 41.8204532,
    "longitude": -72.9035701,
    "description": "Friends of Canton Dog Park (4.7 stars from 75 reviews) is a popular destination for Hartford dog owners, located at 79 Commerce Dr. For dog owners in the area, this park has become a trusted spot for time with their pups. Based on the reviews, dog owners can expect a reliable spot for spending time with their pup."
  },
  {
    "name": "Berlin Dog Park",
    "street": "600 Spruce Brook Rd",
    "city": "Hartford",
    "state": "CT",
    "zip": "06037",
    "latitude": 41.6007604,
    "longitude": -72.7315969,
    "description": "With 4.6 stars from 16 reviews, Berlin Dog Park at 600 Spruce Brook Rd has become a favorite among Hartford dog owners. Dog owners frequent this park for its consistent quality and welcoming atmosphere. Dog owners exploring the neighborhood can also bring their furry friends to Meriden Dog Park (3.8 miles)."
  },
  {
    "name": "West Hartford Parks Park",
    "street": "847 Quaker Ln S",
    "city": "Hartford",
    "state": "CT",
    "zip": "06110",
    "latitude": 41.7368807,
    "longitude": -72.7301752,
    "description": "West Hartford Parks Park (4.6 stars from 106 reviews) is a popular destination for Hartford dog owners, located at 847 Quaker Ln S. Open from 8am to 6pm daily, dog owners have plenty of flexibility to plan a visit. Looking for more places to take your pup? West Hartford Dog Park is another popular dog park just 0.3 miles away."
  },
  {
    "name": "Rocky Hill Dog Park",
    "street": "376 Elm St",
    "city": "Hartford",
    "state": "CT",
    "zip": "06067",
    "latitude": 41.662915,
    "longitude": -72.652743,
    "description": "Rocky Hill Dog Park (4.6 stars from 170 reviews) is a popular destination for Hartford dog owners, located at 376 Elm St. Open from 6am to 8pm daily, there's room in the day for dog owners to bring their furry friends. Dog owners exploring the neighborhood can also bring their furry friends to Wethersfield Dog Park (2.1 miles)."
  },
  {
    "name": "Middlefield Dog Park",
    "street": "",
    "city": "Hartford",
    "state": "CT",
    "zip": "",
    "latitude": 41.5165161,
    "longitude": -72.7120793,
    "description": "In Hartford, Middlefield Dog Park earns strong marks from local dog owners—4.5 stars from 78 reviews. Open from 6am to 8pm daily, dog owners can plan visits around work or their pup's energy level. Based on the reviews, dog owners can expect a reliable spot for spending time with their pup."
  },
  {
    "name": "Cromwell Dog Park",
    "street": "",
    "city": "Hartford",
    "state": "CT",
    "zip": "",
    "latitude": 41.5949942,
    "longitude": -72.6455665,
    "description": "Dog owners in Hartford have made Cromwell Dog Park a go-to spot, rating it 4.5 stars across 143 reviews. Open from 6am to 8:30pm daily, dog owners have plenty of flexibility to plan a visit. Looking for more places to take your pup? Berlin Dog Park is another popular dog park just 4.5 miles away."
  },
  {
    "name": "Newington Dog Park",
    "street": "",
    "city": "Hartford",
    "state": "CT",
    "zip": "",
    "latitude": 41.6978777,
    "longitude": -72.7237063,
    "description": "For dog owners in Hartford, Newington Dog Park has a 4.4-star rating (29 reviews). The park gives neighborhood dog owners a destination for outings with their four-legged friends. More dog parks in the area include Wolcott Park (2.5 miles) and Stanley Quarter Park (2.7 miles)—great options for mixing up your pup's routine."
  },
  {
    "name": "B.A.R.K. Park",
    "street": "99 Rockwell Park Rd",
    "city": "Hartford",
    "state": "CT",
    "zip": "06010",
    "latitude": 41.6771951,
    "longitude": -72.9578834,
    "description": "B.A.R.K. Park at 99 Rockwell Park Rd in Hartford has 4.4 stars from 112 dog owner reviews. Open from 6am to 10pm daily, the park is accessible for dog owners in the area. For dog owners who like to explore, Birge Pond/Hoppers (0.9 miles) and Peterson Memorial Park (4.9 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "West Hartford Dog Park",
    "street": "100 Mayflower St",
    "city": "Hartford",
    "state": "CT",
    "zip": "06110",
    "latitude": 41.7360523,
    "longitude": -72.7359101,
    "description": "Located at 100 Mayflower St, West Hartford Dog Park offers Hartford dog owners a neighborhood destination for their four-legged friends. Open from 6am to 9pm daily, the park fits conveniently into different routines. More dog parks in the area include West Hartford Parks Park (0.3 miles) and Wolcott Park (0.9 miles)—great options for mixing up your pup's routine."
  },
  {
    "name": "Wethersfield Dog Park",
    "street": "154 Prospect St",
    "city": "Hartford",
    "state": "CT",
    "zip": "06109",
    "latitude": 41.6917505,
    "longitude": -72.6670294,
    "description": "For dog owners in Hartford, Wethersfield Dog Park at 154 Prospect St has a 4.3-star rating (146 reviews). The neighborhood benefits from having this park as an option for dog owners and their pups. More dog parks in the area include Rocky Hill Dog Park (2.1 miles) and Newington Dog Park (3.0 miles)—great options for mixing up your pup's routine."
  },
  {
    "name": "Windsor Dog Park",
    "street": "145 Lang Rd",
    "city": "Hartford",
    "state": "CT",
    "zip": "06095",
    "latitude": 41.9075434,
    "longitude": -72.7003705,
    "description": "Windsor Dog Park (145 Lang Rd) serves dog owners in the Hartford neighborhood looking for a place to visit with their pups. Open from 6am to 9pm daily, dog owners have a window to spend time with their pups. Reading what other dog owners have experienced here can help with planning a visit."
  },
  {
    "name": "Meriden Dog Park",
    "street": "165 Hicks Ave",
    "city": "Meriden",
    "state": "CT",
    "zip": "06451",
    "latitude": 41.5658655,
    "longitude": -72.7881723,
    "description": "At 165 Hicks Ave in Meriden, Meriden Dog Park has built a loyal following—4.5 stars from 191 dog owner reviews. For dog owners in the area, this park has become a trusted spot for time with their pups. Nearby, Berlin Dog Park (3.8 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Walnut Hill Park",
    "street": "184 W Main St",
    "city": "New Britain",
    "state": "CT",
    "zip": "06052",
    "latitude": 41.6666304,
    "longitude": -72.7866427,
    "description": "Local dog owners love Walnut Hill Park at 184 W Main St in New Britain—4.7 stars from an impressive 1,438 reviews. Dog owners in the area know they can count on this park for quality time with their pups. Other popular dog parks nearby include Ron Jakubowski Park (0.5 miles) and Martha Hart park (1.1 miles)—both favorites among local pup parents."
  },
  {
    "name": "City of New Britain Park",
    "street": "635 S Main St",
    "city": "New Britain",
    "state": "CT",
    "zip": "06051",
    "latitude": 41.6491407,
    "longitude": -72.7725199,
    "description": "City of New Britain Park (4.6 stars from 11 reviews) is a popular destination for New Britain dog owners, located at 635 S Main St. Open from 6am to 9:30pm daily, there's room in the day for dog owners to bring their furry friends. For variety, the neighborhood offers more dog parks to explore: Willow Brook Park (0.4 miles) and Ron Jakubowski Park (0.9 miles)."
  },
  {
    "name": "‍ Stanley Quarter Park",
    "street": "451 Blake Rd",
    "city": "New Britain",
    "state": "CT",
    "zip": "06053",
    "latitude": 41.6958557,
    "longitude": -72.7756832,
    "description": "For New Britain dog owners, Stanley Quarter Park at 451 Blake Rd has become a reliable favorite—4.5 stars from 1,277 reviews. Open from 6am to 11pm daily, there's always time for dog owners to bring their pup for some quality time. Dog owners in the area also love bringing their pups to Walnut Hill Park (2.1 miles) and Ron Jakubowski Park (2.4 miles)."
  },
  {
    "name": "Ron Jakubowski Park",
    "street": "",
    "city": "New Britain",
    "state": "CT",
    "zip": "",
    "latitude": 41.6612104,
    "longitude": -72.7795419,
    "description": "Ron Jakubowski Park in New Britain is rated 4.4 stars by 19 dog owners. Open from 6am to 10pm daily, dog owners in the area can work a visit into their day. For pups who want more adventure, Walnut Hill Park is a nearby dog park worth visiting (0.5 miles)."
  },
  {
    "name": "‍ Willow Brook Park",
    "street": "200 Mill St",
    "city": "New Britain",
    "state": "CT",
    "zip": "06051",
    "latitude": 41.650847,
    "longitude": -72.780423,
    "description": "At 200 Mill St, Willow Brook Park has 4.4 stars based on 335 reviews from New Britain dog owners. Open from 6am to 10pm daily, dog owners in the area can work a visit into their day. Dog owners looking for variety can also visit City of New Britain Park (0.4 miles) or Martha Hart park (0.6 miles) with their four-legged friends."
  },
  {
    "name": "Wolcott Park",
    "street": "1341 New Britain Ave",
    "city": "New Britain",
    "state": "CT",
    "zip": "06110",
    "latitude": 41.728545,
    "longitude": -72.7495107,
    "description": "Located at 1341 New Britain Ave, Wolcott Park in New Britain is rated 4.4 stars by 457 dog owners. The neighborhood benefits from having this park as an option for dog owners and their pups. For pups who want more adventure, West Hartford Dog Park is a nearby dog park worth visiting (0.9 miles)."
  },
  {
    "name": "Martha Hart park",
    "street": "135 Corbin Ave",
    "city": "New Britain",
    "state": "CT",
    "zip": "06052",
    "latitude": 41.6515392,
    "longitude": -72.7922481,
    "description": "At 135 Corbin Ave, Martha Hart park has 4.3 stars based on 230 reviews from New Britain dog owners. Open from 6am to 11pm daily, the park gives dog owners in the neighborhood time to bring their pups. For dog owners who like to explore, Willow Brook Park (0.6 miles) and Ron Jakubowski Park (0.9 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "Fort Hale Dog Park",
    "street": "408 Townsend Ave",
    "city": "New Haven",
    "state": "CT",
    "zip": "06512",
    "latitude": 41.2685744,
    "longitude": -72.8970038,
    "description": "Dog owners in New Haven have made Fort Hale Dog Park at 408 Townsend Ave a go-to spot, rating it 4.7 stars across 12 reviews. For dog owners in the area, this park has become a trusted spot for time with their pups. Nearby, Union Street Dog Park (2.7 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Union Street Dog Park",
    "street": "59 Fair St",
    "city": "New Haven",
    "state": "CT",
    "zip": "06511",
    "latitude": 41.3029259,
    "longitude": -72.9226876,
    "description": "Dog owners in New Haven have rated Union Street Dog Park (59 Fair St) 4.4 stars across 93 reviews. The neighborhood benefits from having this park as an option for dog owners and their pups. Dog owners in the neighborhood can also take their furry friends to Edgewood Park, 0.4 miles away."
  },
  {
    "name": "East Rock Dog Park",
    "street": "107 Mechanic St",
    "city": "New Haven",
    "state": "CT",
    "zip": "06511",
    "latitude": 41.3187786,
    "longitude": -72.9069315,
    "description": "At 107 Mechanic St in New Haven, East Rock Dog Park carries 4.4 stars from 45 dog owner reviews. The neighborhood benefits from having this park as an option for dog owners and their pups. For pups who want more adventure, Edgewood Park is a nearby dog park worth visiting (1.2 miles)."
  },
  {
    "name": "Edgewood Park",
    "street": "",
    "city": "New Haven",
    "state": "CT",
    "zip": "",
    "latitude": 41.3082138,
    "longitude": -72.9250518,
    "description": "74 dog owners have reviewed Edgewood Park in New Haven, averaging 4.1 stars. Open from 7am to 7pm daily, the park fits conveniently into different routines. Dog owners looking for variety can also visit Union Street Dog Park (0.4 miles) or East Rock Dog Park (1.2 miles) with their four-legged friends."
  },
  {
    "name": "‍ Waveny Park",
    "street": "677 South Ave",
    "city": "Norwalk",
    "state": "CT",
    "zip": "06840",
    "latitude": 41.121522,
    "longitude": -73.4901129,
    "description": "For dog owners in the Norwalk area, Waveny Park (677 South Ave) offers a 4.8-star experience based on 931 reviews. Local dog owners appreciate what this park offers their four-legged friends. For a change of scenery, Irving Freese Park is another dog-friendly destination 4.0 miles from here."
  },
  {
    "name": "Rowayton Community Center",
    "street": "33 Highland Ave",
    "city": "Norwalk",
    "state": "CT",
    "zip": "06853",
    "latitude": 41.0654378,
    "longitude": -73.4373768,
    "description": "Located at 33 Highland Ave in Norwalk, Rowayton Community Center earns strong marks from local dog owners—4.7 stars from 52 reviews. Local dog owners appreciate what this park offers their four-legged friends. Other dog parks in the area include Rowayton Dog Park (0.1 miles) and Bayley Beach (0.4 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Riverside Park",
    "street": "427 Riverside Ave",
    "city": "Norwalk",
    "state": "CT",
    "zip": "06880",
    "latitude": 41.125909,
    "longitude": -73.371527,
    "description": "With 4.7 stars from 22 reviews, Riverside Park at 427 Riverside Ave has become a favorite among Norwalk dog owners. The steady stream of dog owner visits speaks to the park's appeal. Other dog parks in the area include Winslow Park (1.3 miles) and Norwalk Town Green (2.0 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Gallaher Mansion and Cranbury",
    "street": "300 Grumman Ave",
    "city": "Norwalk",
    "state": "CT",
    "zip": "06851",
    "latitude": 41.1639897,
    "longitude": -73.4048364,
    "description": "With 4.6 stars from 528 reviews, Gallaher Mansion and Cranbury at 300 Grumman Ave has become a favorite among Norwalk dog owners. Open from 7am to 8pm daily, there's plenty of opportunity for dog owners to find a time that works. For a change of scenery, Irving Freese Park is another dog-friendly destination 3.0 miles from here."
  },
  {
    "name": "Norwalk Town Green",
    "street": "8 Park St",
    "city": "Norwalk",
    "state": "CT",
    "zip": "06851",
    "latitude": 41.1193528,
    "longitude": -73.4082492,
    "description": "For dog owners in the Norwalk area, Norwalk Town Green (8 Park St) offers a 4.6-star experience based on 151 reviews. Dog owners frequent this park for its consistent quality and welcoming atmosphere. Dog owners exploring the neighborhood can also bring their furry friends to Irving Freese Park (0.3 miles)."
  },
  {
    "name": "Irving Freese Park",
    "street": "22 Main St",
    "city": "Norwalk",
    "state": "CT",
    "zip": "06851",
    "latitude": 41.1213673,
    "longitude": -73.4134527,
    "description": "Irving Freese Park at 22 Main St in Norwalk has 4.3 stars from 26 dog owner reviews. The park gives neighborhood dog owners a destination for outings with their four-legged friends. Looking to explore more? Norwalk Town Green is another dog-friendly park 0.3 miles from here."
  },
  {
    "name": "Bayley Beach",
    "street": "11 Pine Point Rd",
    "city": "Norwalk",
    "state": "CT",
    "zip": "06853",
    "latitude": 41.0596726,
    "longitude": -73.4395607,
    "description": "At 11 Pine Point Rd in Norwalk, Bayley Beach carries 4.4 stars from 189 dog owner reviews. Open from 8am to 8pm daily, dog owners have a window to spend time with their pups. Nearby dog parks worth exploring with your pup include Rowayton Dog Park (0.3 miles) and Rowayton Community Center (0.4 miles)."
  },
  {
    "name": "Oyster Shell Park",
    "street": "95 N Water St",
    "city": "Norwalk",
    "state": "CT",
    "zip": "06854",
    "latitude": 41.0990916,
    "longitude": -73.4161163,
    "description": "Oyster Shell Park at 95 N Water St in Norwalk has 4.4 stars from 467 dog owner reviews. Open from 7am to 9pm daily, the park gives dog owners in the neighborhood time to bring their pups. Looking to explore more? Taylor Farm Dog Park is another dog-friendly park 1.0 miles from here."
  },
  {
    "name": "Shady Beach Park",
    "street": "14 Canfield Ave",
    "city": "Norwalk",
    "state": "CT",
    "zip": "06855",
    "latitude": 41.0968359,
    "longitude": -73.3925521,
    "description": "With 4.4 stars from 545 reviews, Shady Beach Park at 14 Canfield Ave has become a favorite among Norwalk dog owners. Open from 9am to 9pm daily, dog owners can plan visits around work or their pup's energy level. Dog owners exploring the neighborhood can also bring their furry friends to Taylor Farm Dog Park (0.3 miles)."
  },
  {
    "name": "‍ Paw Meadow Dog Park",
    "street": "22 Iron Horse Blvd",
    "city": "Simsbury",
    "state": "CT",
    "zip": "06070",
    "latitude": 41.8706718,
    "longitude": -72.801509,
    "description": "For dog owners in the Simsbury area, Paw Meadow Dog Park (22 Iron Horse Blvd) offers a 4.5-star experience based on 149 reviews. Open from 6am to 9pm daily, dog owners can easily fit a visit into busy schedules. Dog owners looking for a dependable spot will find this park lives up to its ratings."
  },
  {
    "name": "South Windsor Bark Park",
    "street": "",
    "city": "South Windsor",
    "state": "CT",
    "zip": "",
    "latitude": 41.8489872,
    "longitude": -72.5717551,
    "description": "South Windsor dog owners rate South Windsor Bark Park highly, with 4.5 stars from 251 visits. Open from 7am to 8pm daily, there's plenty of opportunity for dog owners to find a time that works. Nearby, East Windsor Dog Park (4.5 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Triangle Park",
    "street": "7 Hbr Pt Rd S",
    "city": "Stamford",
    "state": "CT",
    "zip": "06902",
    "latitude": 41.0404796,
    "longitude": -73.5429742,
    "description": "Triangle Park (4.8 stars from 17 reviews) is a popular destination for Stamford dog owners, located at 7 Hbr Pt Rd S. Open from 6am to 10pm daily, the park accommodates early risers and evening visitors alike. Dog owners exploring the neighborhood can also bring their furry friends to Harbor Point Dog Park (0.2 miles)."
  },
  {
    "name": "Mill River Bark Park",
    "street": "1050 Washington Blvd",
    "city": "Stamford",
    "state": "CT",
    "zip": "06901",
    "latitude": 41.0538224,
    "longitude": -73.5427623,
    "description": "Mill River Bark Park (4.5 stars from 27 reviews) is a popular destination for Stamford dog owners, located at 1050 Washington Blvd. Dog owners frequent this park for its consistent quality and welcoming atmosphere. For variety, the neighborhood offers more dog parks to explore: Harbor Point Dog Park (0.7 miles) and Triangle Park (0.9 miles)."
  },
  {
    "name": "Stamford Dog Park",
    "street": "53 Courtland Ave",
    "city": "Stamford",
    "state": "CT",
    "zip": "06902",
    "latitude": 41.0606893,
    "longitude": -73.5125615,
    "description": "At 53 Courtland Ave in Stamford, Stamford Dog Park carries 4.3 stars from 212 dog owner reviews. Open from 6am to 9pm daily, local dog owners have time to explore with their furry companions. Nearby dog parks worth exploring with your pup include Mill River Bark Park (1.6 miles) and Harbor Point Dog Park (1.9 miles)."
  },
  {
    "name": "Harbor Point Dog Park",
    "street": "804 Atlantic St",
    "city": "Stamford",
    "state": "CT",
    "zip": "06902",
    "latitude": 41.0432448,
    "longitude": -73.5410916,
    "description": "Located at 804 Atlantic St, Harbor Point Dog Park offers Stamford dog owners a neighborhood destination for their four-legged friends. Local dog owners use this park as a spot to spend time with their furry companions. Dog owners in the neighborhood can also take their furry friends to Triangle Park, 0.2 miles away."
  },
  {
    "name": "Southbury Dog Park",
    "street": "236 Roxbury Rd",
    "city": "Waterbury",
    "state": "CT",
    "zip": "06488",
    "latitude": 41.5087456,
    "longitude": -73.2159547,
    "description": "Southbury Dog Park (4.8 stars from 441 reviews) is a popular destination for Waterbury dog owners, located at 236 Roxbury Rd. Dog owners frequent this park for its consistent quality and welcoming atmosphere. The reviews indicate this is a trusted destination for dog owners in the area."
  },
  {
    "name": "Peterson Memorial Park",
    "street": "123 Mad River Rd",
    "city": "Waterbury",
    "state": "CT",
    "zip": "06716",
    "latitude": 41.6097143,
    "longitude": -72.9853016,
    "description": "Dog owners in Waterbury have made Peterson Memorial Park at 123 Mad River Rd a go-to spot, rating it 4.6 stars across 469 reviews. Open from 7:15am to 4:15pm daily, dog owners can easily fit a visit into busy schedules. For variety, the neighborhood offers more dog parks to explore: Sunrise Park (1.5 miles) and Bucks Hill Park (2.1 miles)."
  },
  {
    "name": "Andrew Mountain Park",
    "street": "Andrew Mountain Rd",
    "city": "Waterbury",
    "state": "CT",
    "zip": "06770",
    "latitude": 41.4833136,
    "longitude": -73.0949524,
    "description": "With 4.6 stars from 150 reviews, Andrew Mountain Park has become a favorite among Waterbury dog owners. Open from 5am to 8pm daily, the park accommodates early risers and evening visitors alike. Looking for more places to take your pup? Whittemore Glen State Park is another popular dog park just 2.3 miles away."
  },
  {
    "name": "Watertown Dog Park",
    "street": "1365 Main St",
    "city": "Waterbury",
    "state": "CT",
    "zip": "06795",
    "latitude": 41.5894526,
    "longitude": -73.0990685,
    "description": "Waterbury dog owners rate Watertown Dog Park at 1365 Main St highly, with 4.9 stars from 12 visits. Dog owners frequent this park for its consistent quality and welcoming atmosphere. Dog owners can also take their pups to nearby Schofield Park (2.2 miles) or Waterville Park (2.6 miles)."
  },
  {
    "name": "Blue Stone Quarry",
    "street": "299 Sheffield St",
    "city": "Waterbury",
    "state": "CT",
    "zip": "06704",
    "latitude": 41.5955527,
    "longitude": -73.0489264,
    "description": "Waterbury dog owners rate Blue Stone Quarry at 299 Sheffield St highly, with 4.8 stars from 13 visits. Dog owners in the area consistently choose this park as a go-to destination for their pups. For variety, the neighborhood offers more dog parks to explore: Waterville Park (0.5 miles) and Bucks Hill Park (1.4 miles)."
  },
  {
    "name": "Hop Brook Lake",
    "street": "4 Straits Turnpike",
    "city": "Waterbury",
    "state": "CT",
    "zip": "06762",
    "latitude": 41.5144313,
    "longitude": -73.0707445,
    "description": "Located at 4 Straits Turnpike in Waterbury, Hop Brook Lake earns strong marks from local dog owners—4.5 stars from 360 reviews. The park serves dog owners well, providing a destination the community values. Dog owners exploring the neighborhood can also bring their furry friends to Upper Murray Park (1.0 miles)."
  },
  {
    "name": "Waterville Park",
    "street": "Boyden St",
    "city": "Waterbury",
    "state": "CT",
    "zip": "06704",
    "latitude": 41.5887686,
    "longitude": -73.0488333,
    "description": "Dog owners in Waterbury have made Waterville Park a go-to spot, rating it 4.5 stars across 115 reviews. Dog owners in the area consistently choose this park as a go-to destination for their pups. Looking for more places to take your pup? Blue Stone Quarry is another popular dog park just 0.5 miles away."
  },
  {
    "name": "‍ Upper Murray Park",
    "street": "100 Valleyview Dr",
    "city": "Waterbury",
    "state": "CT",
    "zip": "06708",
    "latitude": 41.5281652,
    "longitude": -73.0636268,
    "description": "Waterbury dog owners rate Upper Murray Park at 100 Valleyview Dr highly, with 4.6 stars from 8 visits. Open from 6am to 10pm daily, the park offers flexibility for dog owners with varying routines. For a change of scenery, Murray Park is another dog-friendly destination 0.2 miles from here."
  },
  {
    "name": "Schofield Park",
    "street": "283 Bunker Hill Ave",
    "city": "Waterbury",
    "state": "CT",
    "zip": "06708",
    "latitude": 41.5699896,
    "longitude": -73.0656742,
    "description": "Schofield Park at 283 Bunker Hill Ave in Waterbury has 4.4 stars from 37 dog owner reviews. Dog owners looking for a local destination will find this park accessible. Dog owners might also enjoy Fulton Park, another dog park just 1.3 miles away."
  },
  {
    "name": "‍ Whittemore Glen State Park",
    "street": "",
    "city": "Waterbury",
    "state": "CT",
    "zip": "",
    "latitude": 41.4860186,
    "longitude": -73.0509432,
    "description": "Whittemore Glen State Park holds a 4.4-star rating from 85 Waterbury dog owner visits. Open from 9am to 5pm daily, dog owners have flexibility to plan a visit with their four-legged friends. Dog owners might also enjoy Hop Brook Lake, another dog park just 2.2 miles away."
  },
  {
    "name": "Fulton Park",
    "street": "Cooke St",
    "city": "Waterbury",
    "state": "CT",
    "zip": "06704",
    "latitude": 41.5677072,
    "longitude": -73.0404436,
    "description": "In Waterbury, Fulton Park has built a loyal following—4.4 stars from 1,056 dog owner reviews. Dog owners frequent this park for its consistent quality and welcoming atmosphere. More dog-friendly parks nearby include Library Park (1.0 miles) and Lakewood Park (1.0 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Murray Park",
    "street": "215 Anna Ave",
    "city": "Waterbury",
    "state": "CT",
    "zip": "06708",
    "latitude": 41.5268525,
    "longitude": -73.0600256,
    "description": "At 215 Anna Ave, Murray Park has 4.3 stars based on 82 reviews from Waterbury dog owners. Open from 7am to 7pm daily, the park gives dog owners in the neighborhood time to bring their pups. Dog owners looking for variety can also visit Upper Murray Park (0.2 miles) or Hop Brook Lake (1.0 miles) with their four-legged friends."
  },
  {
    "name": "Chase Park",
    "street": "",
    "city": "Waterbury",
    "state": "CT",
    "zip": "",
    "latitude": 41.5538091,
    "longitude": -73.0438362,
    "description": "Chase Park in Waterbury is rated 4.3 stars by 139 dog owners. Open from 7am to 9pm daily, the park fits conveniently into different routines. For dog owners who like to explore, Lakewood Park (0.0 miles) and Library Park (0.1 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "Bucks Hill Park",
    "street": "88 Montoe Rd",
    "city": "Waterbury",
    "state": "CT",
    "zip": "06704",
    "latitude": 41.595917,
    "longitude": -73.021719,
    "description": "Bucks Hill Park at 88 Montoe Rd in Waterbury has 4.3 stars from 294 dog owner reviews. Open from 6am to 8pm daily, dog owners in the area can work a visit into their day. Nearby dog parks worth exploring with your pup include Sunrise Park (1.1 miles) and Blue Stone Quarry (1.4 miles)."
  },
  {
    "name": "Birge Pond/Hoppers",
    "street": "54 Ambler Rd",
    "city": "Waterbury",
    "state": "CT",
    "zip": "06010",
    "latitude": 41.6887646,
    "longitude": -72.9521763,
    "description": "Located at 54 Ambler Rd, Birge Pond/Hoppers in Waterbury is rated 4.3 stars by 299 dog owners. Open from 6am to 10pm daily, the park gives dog owners in the neighborhood time to bring their pups. Looking to explore more? B.A.R.K. Park is another dog-friendly park 0.9 miles from here."
  },
  {
    "name": "Library Park",
    "street": "267 Grand St",
    "city": "Waterbury",
    "state": "CT",
    "zip": "06702",
    "latitude": 41.5543457,
    "longitude": -73.0448732,
    "description": "At 267 Grand St, Library Park has 4.3 stars based on 388 reviews from Waterbury dog owners. Open from 6am to 9pm daily, dog owners have flexibility to plan a visit with their four-legged friends. Dog owners might also enjoy Lakewood Park, another dog park just 0.1 miles away."
  },
  {
    "name": "Veterans Memorial Dog Park",
    "street": "91 Bull Hill Ln",
    "city": "‍ West Haven",
    "state": "CT",
    "zip": "06516",
    "latitude": 41.2700902,
    "longitude": -72.9801788,
    "description": "Veterans Memorial Dog Park (4.6 stars from 10 reviews) is a popular destination for West Haven dog owners, located at 91 Bull Hill Ln. Dog owners looking for a solid destination will find this park delivers. More dog-friendly parks nearby include Union Street Dog Park (3.7 miles) and Edgewood Park (3.9 miles)—perfect for pups who love adventure."
  }
]