[
  {
    "name": "Valley Garden Park",
    "street": "500 Campbell Rd",
    "city": "Wilmington",
    "state": "DE",
    "zip": "19807",
    "latitude": 39.7892954,
    "longitude": -75.6126018,
    "description": "Dog owners in Wilmington have made Valley Garden Park at 500 Campbell Rd a go-to spot, rating it 4.8 stars across 388 reviews. Open from 9am to 8pm daily, the park works well for dog owners with different schedules. For a change of scenery, Rockford Park is another dog-friendly destination 2.5 miles from here."
  },
  {
    "name": "Rockford Park",
    "street": "Lookout Dr",
    "city": "Wilmington",
    "state": "DE",
    "zip": "19806",
    "latitude": 39.7672036,
    "longitude": -75.5744502,
    "description": "Rockford Park (4.7 stars from 656 reviews) is a popular destination for Wilmington dog owners. Open from 7am to 6pm daily, dog owners can plan visits around work or their pup's energy level. Dog owners can also take their pups to nearby Brandywine Park (1.7 miles) or Kosciuszko Park (2.1 miles)."
  },
  {
    "name": "Brandywine Park",
    "street": "1080 N Park Dr",
    "city": "Wilmington",
    "state": "DE",
    "zip": "19802",
    "latitude": 39.752667,
    "longitude": -75.5476724,
    "description": "Brandywine Park at 1080 N Park Dr in Wilmington is a community favorite, with 2,278 dog owners giving it 4.6 stars. Open from 8am to 8pm daily, the park is convenient for before work, after work, or weekend adventures. Dog owners in the area also love bringing their pups to Kosciuszko Park (0.5 miles) and Haynes Park (1.6 miles)."
  },
  {
    "name": "New Castle County Bark Park",
    "street": "",
    "city": "Wilmington",
    "state": "DE",
    "zip": "",
    "latitude": 39.6828358,
    "longitude": -75.7515682,
    "description": "With 4.5 stars from 281 reviews, New Castle County Bark Park has become a favorite among Wilmington dog owners. Dog owners frequent this park for its consistent quality and welcoming atmosphere. Dog owners looking for a dependable spot will find this park lives up to its ratings."
  },
  {
    "name": "River Road Park",
    "street": "610 River Rd",
    "city": "Wilmington",
    "state": "DE",
    "zip": "19809",
    "latitude": 39.7157449,
    "longitude": -75.5203504,
    "description": "River Road Park at 610 River Rd holds a 4.3-star rating from 84 Wilmington dog owner visits. Open from 8am to 6pm daily, dog owners can stop by when it fits their schedule. Nearby dog parks worth exploring with your pup include Kosciuszko Park (2.5 miles) and Brandywine Park (2.9 miles)."
  },
  {
    "name": "Elsmere Dog Park",
    "street": "116 Western Ave",
    "city": "Wilmington",
    "state": "DE",
    "zip": "19805",
    "latitude": 39.7384766,
    "longitude": -75.5916935,
    "description": "Elsmere Dog Park at 116 Western Ave in Wilmington has 4.3 stars from 187 dog owner reviews. Open from 6am to 9pm daily, dog owners can stop by when it fits their schedule. Dog owners might also enjoy Rockford Park, another dog park just 2.2 miles away."
  },
  {
    "name": "Haynes Park",
    "street": "4398 Miller Rd",
    "city": "Wilmington",
    "state": "DE",
    "zip": "19802",
    "latitude": 39.771716,
    "longitude": -75.52983,
    "description": "In Wilmington, dog owners can find Haynes Park at 4398 Miller Rd—a local park worth exploring with their furry companions. For dog owners in the neighborhood, this park offers a place to take their pups. Dog owners might also enjoy Brandywine Park, another dog park just 1.6 miles away."
  },
  {
    "name": "Kosciuszko Park",
    "street": "",
    "city": "Wilmington",
    "state": "DE",
    "zip": "",
    "latitude": 39.7459468,
    "longitude": -75.546589,
    "description": "Kosciuszko Park in Wilmington has 4.1 stars based on 187 reviews from dog owners. Open from 5am to 7pm daily, dog owners in the area can work a visit into their day. Looking to explore more? Brandywine Park is another dog-friendly park 0.5 miles from here."
  }
]