[
  {"name":"Wag 'N Paddle","street":"1847 W Jefferson Ave","city":"Naperville","state":"IL","zip":"60540","latitude":41.769836,"longitude":-88.1997751,"description":"Wag 'N Paddle is an indoor climate-controlled park and heated swimming pool designed for dogs in Naperville, IL. This pet-friendly park is perfect for pooches who love to paddle and play. The 9,000-square-feet park is monitored by staff to make sure dogs and their owners are on their best behavior. In addition to providing a pool and park to play in, they also offer a number of swimming classes in the pool for senior dogs and training sessions with qualified dog trainers for all levels of pooch in the park too. Fido can gain unlimited access to the indoor dog park for a membership fee, and for for an extra fee can enjoy private swimming sessions. There are a number of other pricing options available on their website for regular and one-time users.","bringfido_id":"16797"},
  {"name":"Batavia Bark Park","street":"40W101 W Main St","city":"Batavia","state":"IL","zip":"60510","latitude":41.845284,"longitude":-88.396675,"description":"Batavia Bark Park in Batavia, IL, offers three acres of fully fenced space where dogs can run and play off-leash. The park features a pavilion, shady trees and a small beach area for extra fun. While no permit is required and admission is free, dogs must be leashed when entering and exiting the park.","bringfido_id":"11952"},
  {"name":"Lakewood Dog Park","street":"27511 N Fairfield Rd","city":"Wauconda","state":"IL","zip":"60084","latitude":42.2625904,"longitude":-88.1016657,"description":"Lakewood Dog Park in Wauconda, IL, is a 66-acre fenced space where Fido can run and play off leash. Amenities include open meadows, mowed trails, parking, toilets, a water pump, and a shade shelter. A permit is required and can be purchased online. The park is closed until 11 AM on the first and third Thursdays from April to October.","bringfido_id":"2831"},
  {"name":"Hammel Woods Dog Park","street":"550 Brook Forest Ave","city":"Shorewood","state":"IL","zip":"60404","latitude":41.5318923,"longitude":-88.1959501,"description":"Hammel Woods Dog Park in Shorewood, IL, provides an exercise area where dogs can run free. A shelter and benches provide comfort for the canines' human companions. A permit is required for use of the Dog Park. Other amenities at Hammel Woods include multi-purpose trails, campsites, picnic shelters, and access to the DuPage River for canoeing/kayaking and fishing.","bringfido_id":"9620"},
  {"name":"Maxwell Dog Park","street":"1850 Gregory St","city":"Normal","state":"IL","zip":"61761","latitude":40.517408,"longitude":-89.0470558,"description":"Fido can play off-leash at Maxwell Dog Park in Normal, IL. This fenced dog park has a separate small dog area, water fountains of all sizes (seasonally available), benches and trees. Please remember to leash your pup outside of the dog park and clean up any mess after them. After heavy rains and snow melt, the dog park may be closed.","bringfido_id":"2951"},
  {"name":"Oakwood Dog Park","street":"22216 N Main St","city":"Morton","state":"IL","zip":"61550","latitude":40.638406,"longitude":-89.4504393,"description":"Pups can play off-leash at Oakwood Dog Park in Morton, IL. This 3-acre fenced dog park offers a separate area for small dogs, shade from mature trees, a human and canine water fountain (available seasonally) and a tire play area. You and Fido can find the dog park at the back of pet-friendly Oakwood Park. Please leash your pup outside of the dog park and remember to clean up after them.","bringfido_id":"3048"},
  {"name":"Evergreen Bark Park","street":"1208 N Maple St","city":"Effingham","state":"IL","zip":"62401","latitude":39.1385536,"longitude":-88.5498169,"description":"Evergreen Bark Park in Effingham, IL is located north of Evergreen Hollow Park and east of Workman Sports and Wellness Complex. Fido can play off leash in either the large dog area or adjoining small dog space, both of which are fully fenced. Each area has a double-gated entry allowing owners to unleash their pets prior to entering the space. Additional amenities include a dog water fountain, benches, picnic tables and waste stations. Once funding permits, there will also be a pavilion, shade structures, and a dog washing area to rinse off muddy pets before you return home.","bringfido_id":"31022"},
  {"name":"Jackson Bark","street":"6000 S Lake Shore Dr","city":"Chicago","state":"IL","zip":"60637","latitude":41.7863353,"longitude":-87.5784488,"description":"Jackson Bark is a dog park located in Jackson Park, just south of the Museum of Science and Industry in Chicago, IL. The fenced park features agility equipment and toys for Fido to enjoy.","bringfido_id":"12710"},
  {"name":"Tomahawk Dog Park","street":"1002 California Ave","city":"Collinsville","state":"IL","zip":"62234","latitude":38.6870295,"longitude":-89.9660526,"description":"Converted from an old baseball diamond, is pet-friendly Tomahawk Dog Park in Collinsville, IL. You can bring your pup down to enjoy some off-leash time in this grassy area located in a corner of Woodland Park.","bringfido_id":"31665"},
  {"name":"Wiggley Field","street":"2600 Plank Rd","city":"Peru","state":"IL","zip":"61354","latitude":41.3434748,"longitude":-89.1373472,"description":"Bring Fido out for a day of play at Wiggley Field in Peru, IL. Inspired by Chicago's Wrigley Field, you'll find tis designated dog area in the southwest corner of Veterans Park. It's fully fenced and grass covered with double-gated entry, agility obstacles, benches, and waste stations. There's a water fountain and restroom in the main park area.","bringfido_id":"33482"},
  {"name":"Hawk Hollow Preserve","street":"1099 Bittersweet Dr","city":"Bartlett","state":"IL","zip":"60103","latitude":41.9679192,"longitude":-88.1682748,"description":"Hawk Hollow Preserve in Bartlett, IL, offers 34 acres of off-leash area for dogs to enjoy along with a three-mile multipurpose trail connecting to trails in Mallard Lake and West Branch forest preserves. A permit is required for off-leash use. Dogs must be leashed in all other areas of the pet-friendly preserve. The area is open during regular preserve hours.","bringfido_id":"14330"},
  {"name":"Messenger Marsh Dog Park","street":"S Bell Rd","city":"Homer Glen","state":"IL","zip":"60491","latitude":41.5941142,"longitude":-87.9250497,"description":"The Forest Preserve District of Will County's 5-acre fenced Messenger Marsh Dog Park provides an exercise area where dogs can run free in Homer Glen, IL. The dog park also features a smaller 1-acre park for dogs under 30 pounds. A shelter and benches provide comfort for human companions. A permit is required for use of the dog park. Other amenities at Messenger Marsh include a picnic shelter and multi-use trails suitable for equestrians. Located on South Bell Road, about 0.25-mile South of 159th Street.","bringfido_id":"9621"},
  {"name":"Community Bark West","street":"1001 Zenith Dr","city":"Glenview","state":"IL","zip":"60025","latitude":42.0702917,"longitude":-87.8627392,"description":"Community Bark West at Community Park West in Glenview, IL, is a 6-acre off-leash park with electronic key entry, benches, shade, and a separate small-dog area. Park passes are available to residents and nonresidents on a first-come, first-served basis until the 1,000-dog maximum is reached. Dogs are welcome in the surrounding park area, as long as they are leashed. The dog park is closed for maintenance on Tuesdays and Thursdays from 8:30 AM to 11:30 AM.","bringfido_id":"2202"},
  {"name":"Fred Anderson Dog Park","street":"1615 S Wabash Ave","city":"Chicago","state":"IL","zip":"60616","latitude":41.8596272,"longitude":-87.6256128,"description":"Architecturally structured dog park named for Chicago Jazz musician and owner of the Velvet Lounge, the Fred Anderson Dog Park is part of the Chicago Park District in Chicago, IL. Located in the South Loop, this park features separate areas for small and large dogs, as well as spouting fountains in the summer and a performance area.","bringfido_id":"13749"},
  {"name":"Maple Park Dog Park","street":"1105 S Maple Ave","city":"Oak Park","state":"IL","zip":"60130","latitude":41.8678591,"longitude":-87.8038429,"description":"Maple Park Dog Park in Oak Park, IL, is a dedicated off-leash site that covers approximately 12,000 square feet. The park features a crushed granite surface, benches, canine water fountain and an electronic entry system. The dog park is open daily to permitted users.","bringfido_id":"11269"},
  {"name":"Miller Meadow Off-Leash Dog Area","street":"2175 S 1st Ave","city":"Forest Park","state":"IL","zip":"60130","latitude":41.8632127,"longitude":-87.8334841,"description":"The Forest Preserves of Cook County currently operates Miller Meadow Off-Leash Dog Area in Forest Park, IL, for visitors to let their dogs enjoy the pet-friendly preserves without a leash. Please note that these are the only locations within the Forest Preserves where off-leash dogs are allowed. Dog owners wishing to enter the Off-Leash Dog Areas must first purchase an annual membership. The annual membership includes one membership card and one key to enter any of the Forest Preserves’ Off-Leash Dog Areas.","bringfido_id":"13268"},
  {"name":"Bo's Run","street":"3600 Lexington Dr","city":"Hoffman Estates","state":"IL","zip":"60192","latitude":42.0890452,"longitude":-88.1049102,"description":"Bo's Run in Hoffman Estates, IL, is a fully fenced off-leash dog park that includes water, agility equipment, benches and a keypad entry. There are 2-acres of field for dogs to enjoy with 5-foot tall fences. The park also features separate areas for small and large dogs. Memberships are required for entry and can be purchased online.","bringfido_id":"9611"},
  {"name":"Central Bark Dog Park","street":"16300 Alba","city":"Lemont","state":"IL","zip":"60439","latitude":41.6574531,"longitude":-88.0163391,"description":"Central Bark Dog Park in Lemont, IL, is a small, fenced dog park where Fido can enjoy some off-leash time. The park features separate areas for small and large dogs, as well as benches for your convenience. A permit is required for entry and can be acquired at the Township Office.","bringfido_id":"2110"},
  {"name":"Norwood Dog Friendly Area","street":"5850 N Avondale Ave","city":"Chicago","state":"IL","zip":"60631","latitude":41.9874936,"longitude":-87.7935378,"description":"The Norwood Dog Friendly Area in Chicago, IL, is a spacious off-leash area located within Norwood Park. The park features a doggy water fountain and is located just north of the service yard on Avondale Ave.","bringfido_id":"12952"},
  {"name":"Duck Farm Dog Park","street":"1439 E Grand Ave","city":"Lake Villa","state":"IL","zip":"60046","latitude":42.414553,"longitude":-88.047155,"description":"Pets will love to play off-leash at Duck Farm Dog Park, a fenced dog park in Lake Villa, IL. The 48-acre park features wetlands, fields and grass trails. Toilets and drinking fountains are available for your convenience. A permit is required and can be purchased online.","bringfido_id":"2345"},
  {"name":"Puptown at MargatePark","street":"4900 N Marine Dr","city":"Chicago","state":"IL","zip":"60640","latitude":41.9718526,"longitude":-87.6512512,"description":"Puptown at Margate Park in Chicago, IL, is an off-leash area that attracts a loyal local crowd. You can bring Fido with you to enjoy the area and socialize with other pups who are enjoying the fenced-in section. Make sure you clean up any mess that your pooch leaves behind.","bringfido_id":"2924"},
  {"name":"Oldfield Oaks Dog Park","street":"N Frontage Rd","city":"Darien","state":"IL","zip":"60561","latitude":41.7229766,"longitude":-88.0071539,"description":"Oldfield Oaks Dog Park in Darien, IL, is pet friendly. It features two fenced areas, including a 6-acre area for large dogs with and a small area, too. Wander the turf looped trail or limestone trail and play a game of fetch with the gathered locals. The park is open every day of the week from one hour after sunrise until one hour after sunset. Entry into the park is restricted to dogs with a permit. Permits can be purchased online. Dog owners are reminded to clean up any mess that their pups leave behind.","bringfido_id":"20432"},
  {"name":"Park No. 551 Dog Friendly Area","street":"353 N DesPlaines St","city":"Chicago","state":"IL","zip":"60661","latitude":41.888349,"longitude":-87.6442,"description":"Park No. 551 Dog Friendly Area is a 1.19-acre green space in Chicago, IL. Bring your pet to play off-leash at this shady, fenced, neighborhood dog park.","bringfido_id":"3183"},
  {"name":"Happy Bark Dog Park","street":"91st and Rockwell","city":"Evergreen Park","state":"IL","zip":"60805","latitude":41.727044,"longitude":-87.6891739,"description":"Fido can become a member of Happy Bark Dog Park and romp among other neighborhood pets in Evergreen Park, IL. The park features three fenced-in spaces: one for small dogs, one for large dogs and an obedience training area. Dogs can be registered at Village Hall.","bringfido_id":"15608"},
  {"name":"Bosly's Backyard","street":"4011 N Ravenswood Ave # 108","city":"Chicago","state":"IL","zip":"60613","latitude":41.9547671,"longitude":-87.6757973,"description":"Unleash a new adventure for you and Fido by visiting Bosly's Backyard, a dog-friendly indoor play space in the Ravenswood neighborhood in Chicago. Bosly's Backyard is a new concept in dog exercise designed to promote physical & cognitive development, and to strengthen the bond with your dog through a shared one-on-one experience. Private play sessions can be booked for a duration of 30, 45, or 60 minutes, allowing Fido uninterrupted off-leash exercise and enrichment in 2400 square feet of space. Bosly's Backyard has a variety of exciting and engaging agility equipment and toys for Fido to utilize during your session. You are also welcome to bring Fido's favorite toys or treats from home. Secure a buddy pass for Fido's best friend so they too can play in a safe environment. Start planning Fido's next birthday party at Bosly's Backyard, or schedule a time to celebrate your dog's gotcha day or other special occasion!","bringfido_id":"26924"},
  {"name":"Brent Leh Dog Park","street":"328 Olive St","city":"Edwardsville","state":"IL","zip":"62025","latitude":38.807364,"longitude":-89.9559018,"description":"Fido can play off-leash at Brent Leh Dog Park, located just one block behind the fire station in Edwardsville, IL. This fenced dog park has astroturf, agility equipment and seasonally available canine water stations.","bringfido_id":"18128"},
  {"name":"Gregory Island Dog Park","street":"100-140 E Indian Trail Rd","city":"North Aurora","state":"IL","zip":"60542","latitude":41.7814543,"longitude":-88.3130409,"description":"Gregory Island Dog Park, nestled along Indian Trail just west of Route 25, offers ample space for both small dogs (35 pounds and under) and larger breeds (35 pounds and over) to stretch their legs and play. Situated amidst the picturesque backdrop of the Fox River on either side, the park ensures a scenic environment for furry friends to enjoy. It's worth mentioning that while larger breeds have access to the water from their side, this section lacks a perimeter fence.","bringfido_id":"25662"},
  {"name":"Friends Forever Humane Society Dog Park","street":"966 W Rudy Rd","city":"Freeport","state":"IL","zip":"61032","latitude":42.2483516,"longitude":-89.6288749,"description":"Friends Forever Humane Society Dog Park is a 7-acre park in Freeport, IL. It's divided into a small and big dog area. There's also an agility park where your pooch can stay busy and learn some new tricks. The park is fenced so your dog can run, play, socialize off-leash, and go for a swim.","bringfido_id":"18264"},
  {"name":"Washington Bark District Off-Leash Dog Park","street":"601 Ernest St","city":"Washington","state":"IL","zip":"61571","latitude":40.6909829,"longitude":-89.4642986,"description":"Bring Fido to play off-leash at Washington Bark District Off-Leash Dog Park in Washington, IL. Located on the west side of pet-friendly Meadow Valley Park near Ernest Street, this fenced dog park has separate areas for small and large dogs and is quickly accessible from the parking lot. Waste bags are provided, so cleaning up after your pup is convenient.","bringfido_id":"14176"},
  {"name":"Mascoutah Dog Park","street":"851 N 6th Street","city":"Mascoutah","state":"IL","zip":"62258","latitude":38.4986059,"longitude":-89.8130944,"description":"Fido can play off-leash at Mascoutah Dog Park located within the pet-friendly Scheve Park in Mascoutah, IL. The fenced dog park has lots of space for pups to stretch their legs, and separate sections for small and large dogs. The centerpiece is an adirondack chair placed among some nice shady trees. Pups and their humans should enter the park via the North 6th Street entrance and can find the dog park north of the \"Big Ditch\" and behind the Berger-Kiel Log House.","bringfido_id":"18126"},
  {"name":"Katz Dog Park and Off-Leash Natural Area","street":"393 W Dresser Rd","city":"DeKalb","state":"IL","zip":"60115","latitude":41.952347,"longitude":-88.75428,"description":"Katz Dog Park and Off-Leash Natural Area in DeKalb, IL offers separate fenced areas for large and small dogs as well as roughly nine acres of natural space for Fido and friends to enjoy off leash. Take a walk on the trails with your pup and explore within the safety of the fenced perimeter. Park amenities include drinking fountains, waste receptacles and shaded benches.","bringfido_id":"13936"},
  {"name":"Jacksonville PetSafe Bark Park","street":"894 E Vandalia Rd","city":"Jacksonville","state":"IL","zip":"62650","latitude":39.7085545,"longitude":-90.212199,"description":"Bring Fido for some off-leash fun at Jacksonville PetSafe Bark Park in Jacksonville, IL. This fenced dog park offers a separate section for small pups, climbing structures, shade structures, benches and waste stations. A canine and human water fountain is available during the warmer months of the year.","bringfido_id":"14642"},
  {"name":"Hair of the Dog","street":"325 S Poplar St","city":"Centralia","state":"IL","zip":"62801","latitude":38.5244118,"longitude":-89.1334547,"description":"Hair of the Dog is a pet-friendly bar in Centralia, IL, that features a supervised, off-leash dog park. Memberships are required for dogs. Fido must be current on all required vaccinations and be properly socialized for group play. Daily, monthly and annual memberships are available. Humans without dogs are welcome without a membership. Drinks are available at the bar, and guests are welcome to bring their own food to enjoy while Fido plays.","bringfido_id":"28929"},
  {"name":"Park 468","street":"4556 W 56th St","city":"Chicago","state":"IL","zip":"60629","latitude":41.7918394,"longitude":-87.7374166,"description":"Park 468 is a grassy dog park in the West Elsdon community area of Chicago, IL, near Chiago Midway Airport. The park is fully fenced but visitors should ensure both the north and south gates are closed before letting Fido off leash. The park doesn't have any seating and owners should bring their own water.","bringfido_id":"30497"},
  {"name":"Bark Park","street":"118 E Madison St","city":"Vandalia","state":"IL","zip":"","latitude":38.8242278,"longitude":-88.8295233,"description":"Dogs can play off-leash at this dog park in Vandalia, IL. Pets should be supervised at all times. The park closes at dusk daily.","bringfido_id":"25532"},
  {"name":"Numosh Park","street":"340 Jefferson St","city":"Tiskilwa","state":"IL","zip":"61368","latitude":41.2959984,"longitude":-89.5135335,"description":"Furry friends of Tiskilwa, IL, love visiting the local dog park, Numosh Park. This neighborhood recreation area is located on an old football field, making it a great spot for pups to run, explore, and socialize with their pet companions. To ensure safety and comfort, the fully-fenced space features two separate sections for small and large dogs.","bringfido_id":"34782"},
  {"name":"June Clark Cheney Dog Park","street":"183 US-51","city":"Pana","state":"IL","zip":"62557","latitude":39.3731762,"longitude":-89.082085,"description":"June Clark Cheney Dog Park (JCC Park) is an off-leash recreation area in south Pana, IL. Bring Fido out for a day of exercise, play and social time with other pups! The space is fully fenced, covered in grass, and has logs for dogs to climb on. There is also a separate space for small dogs. Additional amenities include waste clean-up stations, water access, and lots of picnic table seating for you to watch your pup!","bringfido_id":"32087"},
  {"name":"Harvard Dog Park","street":"300 Lawrence Rd","city":"Harvard","state":"IL","zip":"60033","latitude":42.4212788,"longitude":-88.6365218,"description":"Harvard Dog Park in Harvard, IL welcomes Fido to enjoy some off-leash exercise and socializing with other canines. This large fenced area offers lots of space for your pup to run as well as a shade shelter, seating, a waste station and a dog water fountain.","bringfido_id":"39554"},
  {"name":"Tag-A-Long Dog Park","street":"605 Michael Dr","city":"Morris","state":"IL","zip":"60450","latitude":41.3728573,"longitude":-88.4318452,"description":"Tag-A-Long Dog Park, located on 10 acres in Morris, IL, is a fenced park featuring separate areas for small and large dogs to enjoy some off-leash exercise. Amenities include shade, benches and a covered shelter with one picnic table. There's also a dog wash station and lights to continue playing into the evening.","bringfido_id":"39596"},
  {"name":"Veterans Dog Park","street":"S Wabena Ave &, E Wapella St","city":"Minooka","state":"IL","zip":"60447","latitude":41.4545692,"longitude":-88.2612137,"description":"Fido has been invited to play at Veterans Dog Park in Minooka, IL. This off-leash area welcomes both large and small dogs to roam freely. The park features statues that honor the United States Armed Forces, as well as beautifully landscaped areas. Visitors can enjoy grassy spaces, a pavilion and a concrete walking loop inside.","bringfido_id":"42118"},
  {"name":"Prairie Wolf Dog Park","street":"2075 S Waukegan Rd","city":"Lake Forest","state":"IL","zip":"60045","latitude":42.2071155,"longitude":-87.8626938,"description":"Prairie Wolf Dog Park in Lake Forest, IL is a 44-acre pet-friendly area which is ideal for off-leash play. The spacious fully-fenced park has different terrain and the surrounding area features walking trails and a pond for pups to enjoy during their visit. A Lake Forest County dog park permit is required to access Prairie Wolf Dog Park. This area can become muddy after heavy rainfall.","bringfido_id":"253"},
  {"name":"Whalon Lake Dog Park","street":"1480 Royce Rd","city":"Naperville","state":"IL","zip":"60565","latitude":41.7176509,"longitude":-88.102716,"description":"The Forest Preserve District of Will County's 8-acre fenced Whalon Lake Dog Park provides an exercise area where dogs can run free. Located in Naperville, IL, the dog park features a smaller 2.5-acre area for dogs under 30 pounds, and a shelter and benches provide comfort for the canines' human companions. A permit is required for use. Other amenities at Whalon Lake include multi-purpose trails, picnic shelters, and access to an 80-acre lake for boating and fishing.","bringfido_id":"3784"},
  {"name":"Wiggly Field","street":"2645 N Sheffield Ave","city":"Chicago","state":"IL","zip":"60614","latitude":41.9305329,"longitude":-87.653434,"description":"Wiggly Field in Chicago, IL, is a public dog park that boasts a fenced-in area, doggie water fountains, waste bags and a double gate to prevent escapes. Wiggly Field is located within Noethling Playlot Park, so there's plenty of places to explore nearby too.","bringfido_id":"3805"},
  {"name":"McBark Dog Park","street":"2500 N Richmond Rd","city":"McHenry","state":"IL","zip":"60051","latitude":42.3624192,"longitude":-88.267355,"description":"McBark Dog Park in McHenry, IL, is a 4-acre fenced space for Fido to have some off-leash fun. A  key card must be purchased in advance from City of McHenry for entry.","bringfido_id":"11969"},
  {"name":"Hound Town Dog Park","street":"851 IL-176","city":"Crystal Lake","state":"IL","zip":"60014","latitude":42.2465138,"longitude":-88.3555635,"description":"Dogs may romp and play off-leash at Hound Town Dog Park, a 3 acre dog park in Crystal Lake, ID. The park is fenced and located within the Lippold Park Sport Complex. A key card is required for entry and can be purchased at the Administration Office.","bringfido_id":"2681"},
  {"name":"Lincoln Dog Park","street":"259 S Russell Ave","city":"Aurora","state":"IL","zip":"60506","latitude":41.7555811,"longitude":-88.3385168,"description":"Lincoln Dog Park is a pet-friendly park in Aurora, IL. The park is fully fenced and equipped with shady trees, doggy water fountains, benches for humans, and plenty of space for a game of fetch. A permit is required to use the park.","bringfido_id":"2863"},
  {"name":"Bradley Dog Park","street":"1314 N Park Rd","city":"Peoria","state":"IL","zip":"61604","latitude":40.709872,"longitude":-89.6407695,"description":"Pups can romp and socialize off-leash at Bradley Dog Park in Peoria, IL. Located towards the back of pet-friendly Bradley Park, near the Peoria Park District building, this fenced, 5-acre dog park offers seasonally available water fountains and convenient waste stations. If Fido still has some energy left, you can clip on his leash and explore the trails and scenery, including a Japanese Bridge, within the larger park. This dog park is also located right off of I-74 so it makes for a nice rest stop for Fido.","bringfido_id":"2011"},
  {"name":"Happy Tails Dog Park","street":"835 Commerce Ct","city":"Buffalo Grove","state":"IL","zip":"60089","latitude":42.169265,"longitude":-87.943417,"description":"Happy Tails Dog Park in Buffalo Grove, IL, is open to residents only. It has a large, fenced-in field and there is a small field for small dogs under 35 lbs. The park is located at the south end of the parking lot at the Sidney Mathias Metra Train Station.","bringfido_id":"10111"},
  {"name":"O'Fallon Dog Park","street":"1428 E 3rd St","city":"O'Fallon","state":"IL","zip":"62269","latitude":38.5875862,"longitude":-89.8877927,"description":"O'Fallon Dog Park is a 1.5-acre fenced dog park located within the pet-friendly Rock Springs Park in O'Fallon, IL. Inside the enclosed grassy area are shaded benches and picnic tables, climbing structures and pet waste stations. Maintenance is generally conducted on Friday mornings from 8:00 AM until 12:00 PM, and visitors may not be able to access the park during that time.","bringfido_id":"3388"},
  {"name":"Bark Park","street":"9027 Haligus Rd","city":"Lake in the Hills","state":"IL","zip":"60156","latitude":42.1985939,"longitude":-88.3983048,"description":"Bark Park in Lake in the Hills, IL, is a fenced dog park where Fido can exercise and socialize. Bring your pet to play off-leash at this park with shade and drinking water. Permits are required for entry and available through The Village.","bringfido_id":"2818"},
  {"name":"Stuart Sports Complex Dog Park","street":"39W546 Baseline Rd","city":"Sugar Grove","state":"IL","zip":"60554","latitude":41.7317331,"longitude":-88.3971405,"description":"Fido can run and play at Stuart Sports Complex Dog Park in Aurora, IL. This 15-acre dog park features separate small and large dog areas, wetland and an agility course for your pup to enjoy.","bringfido_id":"12342"},
  {"name":"James O. Breen Community Dog Park","street":"Campton Hills Road and Peck Rd","city":"St. Charles","state":"IL","zip":"60175","latitude":41.9100376,"longitude":-88.3709791,"description":"James O. Breen Community Dog Park is a large 2.5 acre pet-friendly open space for your dog to enjoy when visiting St. Charles, IL. Allow Fido to get plenty of off-leash exercise and social play in a secure, safe and fully enclosed area. Open from 9am until dusk, the dog park has a water fountain, double-gated security entrance, dog-friendly equipment and activity stations, and an area specifically for small dogs. A parking area is close by and the park has covered seating for owners to sit and relax while Fido is at play.","bringfido_id":"26864"},
  {"name":"Stuart Park Dog Park","street":"1800 Winch Ln","city":"Springfield","state":"IL","zip":"62702","latitude":39.824117,"longitude":-89.7023785,"description":"Pups can play off-leash at Stuart Park Dog Park, located within pet-friendly Stuart Park in Springfield, IL. This fenced dog park offers separate small and large dog sections, shade structures, sturdy plastic pools, seasonally available water sources, benches and waste stations.","bringfido_id":"2296"},
  {"name":"Rover Run Dog Park","street":"10893 Ventura Blvd","city":"Machesney Park","state":"IL","zip":"61115","latitude":40.6331249,"longitude":-89.3985283,"description":"Fido can play off-leash at Rover Run Dog Park, located within pet-friendly Schoonmaker Park in Machesney Park, IL. This 2.5-acre fenced dog park offers a separate section for small pups, agility equipment, seating areas, plenty of mature trees that provide shade, seasonally available water and more. Please make sure Fido is on-leash outside of the dog park.","bringfido_id":"2613"},
  {"name":"Greenvalley Dog Park","street":"6009 50th Ave","city":"Moline","state":"IL","zip":"61265","latitude":41.46392,"longitude":-90.454246,"description":"Fido can play off-leash at Greenvalley Dog Park in Moline, IL. This 2-acre fenced space offers an open area for dogs to play and water is seasonally available from May through September (exact dates vary depending on the weather).","bringfido_id":"13698"},
  {"name":"Jackie & Dave Thompson Dog Park","street":"821 Ward St","city":"Macomb","state":"IL","zip":"61455","latitude":40.448973,"longitude":-90.685108,"description":"Fido can enjoy off-leash play at Jackie & Dave Thompson Dog Park in Macomb, IL. Located in the southeast corner of pet-friendly Patton Park, this fenced dog park offers 2 acres for pups to run and socialize in two separate areas. The park offers agility equipment, canine and human water fountains (seasonally available), benches and waste stations. The easiest access to the dog park is via the West Grant Street entrance to the larger park. Please remember dogs must be leashed outside of the dog park.","bringfido_id":"3200"},
  {"name":"Love's Travel Stop","street":"1900 The Hill Ave","city":"Marion","state":"IL","zip":"62959","latitude":37.7448636,"longitude":-88.9514251,"description":"Love's Travel Stop in Marion, IL, is a dog-friendly gas station and rest area. Across America, you'll find Love's Travel Stops that offer facilities for traveling canines. This location has a fully-fenced dog park with a convenient waste station.","bringfido_id":"26523"},
  {"name":"Love's Travel Stop","street":"203 N Haughton Hwy","city":"Greenup","state":"IL","zip":"62428","latitude":39.2529172,"longitude":-88.1526227,"description":"Love's Travel Stop is a dog-friendly gas station and rest stop in Greenup, IL. This location features a dog park, Wi-Fi, and a video gaming station for travelers who need to relax and recharge with their pups. Fido is welcome to play in the dog park or in the grassy areas by the pond.","bringfido_id":"26278"},
  {"name":"Love's Travel Stop","street":"505 Persimmon Dr","city":"Le Roy","state":"IL","zip":"61752","latitude":40.3404999,"longitude":-88.7612457,"description":"Love's Travel Stop is a dog-friendly gas station and rest stop in Le Roy, IL. This location features a dog park, propane tank exchange, Wi-Fi, and private showers for travelers that need to rest and recharge with their pups. Fido is welcome to play at the dog park, but is not allowed in other areas of the gas station property.","bringfido_id":"26292"},
  {"name":"Love's Travel Stop","street":"1900 S State St #127","city":"Greenville","state":"IL","zip":"62246","latitude":38.874183,"longitude":-89.3875201,"description":"Love's Travel Stop offers a dog-friendly rest stop at their location in Greenville, IL. They have a small fenced area especially for road tripping pups to roam off-leash and stretch their legs. The space is well-lit at night and has a picnic table, waste bags and a waste receptacle making clean up easy. This is a very convenient stop for canine co-pilots traveling along I-70, as it is just off of exit 45.","bringfido_id":"23684"},
  {"name":"Kelly Lock Memorial Dog Park","street":"Ervin Park Dr","city":"Tuscola","state":"IL","zip":"61953","latitude":39.8123993,"longitude":-88.2879688,"description":"Fido is invited to play at the Kelly Lock Memorial Dog Park in Tuscola, IL. This 0.75-acre dog park features perimeter fencing, double-gate entry, two separate play areas, play structures and waste bag dispensers. Plus, local artist Ainslie Heilich has adorned the park with vibrant dog-themed murals, making it a beautiful spot for both pups and their humans to enjoy.","bringfido_id":"40960"},
  {"name":"Katherine Legge Memorial Park Off-Leash Area","street":"5901 S County Line Rd","city":"Hinsdale","state":"IL","zip":"60521","latitude":41.7824749,"longitude":-87.9177224,"description":"Dogs are welcome to run and play off-leash during designated hours at the Katherine Legge Memorial Park Off-Leash Area in Hinsdale, IL, which includes a large grassy area with a small stream. Park users with dogs must use the parking lot off County Line Road, west lot near the KLM Lodge. Dogs are only permitted north of the creek and must remain on leash until they are north of the creek. Dogs must stay leashed and use the area west of the paved path to travel to the north end of the park. Dogs are NOT permitted in other areas of the park, even if they are leashed. No more than two dogs per handler are permitted.","bringfido_id":"2765"},
  {"name":"Spring Avenue Dog Park","street":"185 Spring Ave","city":"Glen Ellyn","state":"IL","zip":"60137","latitude":41.8663637,"longitude":-88.0480108,"description":"Spring Avenue Dog Park in Glen Ellyn, IL, is a fenced, off-leash dog park conveniently located in Glen Ellyn Park. A permit is required for use and can be purchased from the Spring Avenue Recreation Center. The dog park features a large open play area, swipe card entry for security, disposal bags and receptacles, picnic tables, benches and free parking.","bringfido_id":"3527"},
  {"name":"SpringBrook Prairie Dog Park","street":"29W128 83rd St","city":"Naperville","state":"IL","zip":"60564","latitude":41.7352708,"longitude":-88.1928266,"description":"Dogs with valid Forest Preserve District permits can enjoy the dog park at Springbrook Prairie in Naperville, IL. Owners must have their dogs’ permits in their possession when in the off-leash area. Applications for annual and daily permits are available through Visitor Services. Dogs must be on leashes no greater than 10 feet in length in all other areas of the preserve, including the parking lots","bringfido_id":"10244"},
  {"name":"Grant Park Dog Friendly Area","street":"951 S Columbus Dr","city":"Chicago","state":"IL","zip":"60605","latitude":41.8705626,"longitude":-87.6205285,"description":"Bring your pet to play off-leash at Grant Park Dog Friendly Area in Chicago, IL. This 18,000 square-foot fenced dog park is in Chicago's famous Grant Park. You will need to get yourself a permit to use the park and have the required vaccinations to do this.","bringfido_id":"2561"},
  {"name":"East Branch Forest Preserve Off Leash Dog Area","street":"Swift Rd & N Ave","city":"Glendale Heights","state":"IL","zip":"60148","latitude":41.9157067,"longitude":-88.0442682,"description":"Pets will love to play off-leash in the designated area of the beautiful East Branch Forest Preserve Off Leash Dog Area in Glendale Heights, IL. The park has trails and a lake where pets can take a dip. Be careful as the area is not fenced. A permit is required for entry.","bringfido_id":"2359"},
  {"name":"Phillips Park Dog Park","street":"1000 Ray Moses Dr","city":"Aurora","state":"IL","zip":"60505","latitude":41.7365152,"longitude":-88.2948701,"description":"Phillips Park Dog Park in Aurora, IL, is a 3-acre gated facility that offers dogs a place to play, with a separate \"time out\" area for excited pups to wind down. The park also features agility equipment.","bringfido_id":"12090"},
  {"name":"Independence Grove Dog Park","street":"31531 N Milwaukee Ave","city":"Libertyville","state":"IL","zip":"60048","latitude":42.3166577,"longitude":-87.9619506,"description":"Independence Grove Dog Park is a fenced, off-leash dog park in Libertyville, IL. The park features 30-acres of space for your pet to play, as well as river access for a dip on hot days. Pets welcome on-leash on the walking trails. Please note an annual or daily permit is required.","bringfido_id":"1619"},
  {"name":"Pooch Park","street":"3220 Oakton St","city":"Skokie","state":"IL","zip":"60077","latitude":42.0264078,"longitude":-87.7098285,"description":"Pooch Park in Skokie, IL, is a fenced, off-leash dog park where Fido can run and play with local pooches. The park features a separate small dog area, agility equipment, dog cleaning stations, water and grass. A permit is required for entry and can be purchased by mail.","bringfido_id":"3274"},
  {"name":"K-9 Dog Park","street":"120 Remington Rd","city":"Schaumburg","state":"IL","zip":"60173","latitude":42.0539519,"longitude":-88.0741346,"description":"K-9 Dog Park is a recreation area for pups in Schaumburg, IL. Use of the park is open to dogs at least 6 months old and owners with an annual registered membership. To become a member, the registration form, waiver and vaccine records must be completed and submitted in person or via email. The park includes a separate area for small and large dogs, an agility course, gazebo, drinking fountains and a swimming pond with a pier.","bringfido_id":"23374"},
  {"name":"Canine Corners Dog Park at Searls Park","street":"4950 Safford Rd","city":"Rockford","state":"IL","zip":"61101","latitude":42.302642,"longitude":-89.145139,"description":"Canine Corners Dog Park at Searls Park in Rockford, IL, is a membership-based dog park with four acres of space to play and large shade trees and benches. A water tap is adjacent to the shelter, and waste bags are provide.","bringfido_id":"624"},
  {"name":"Blackwell Off-Leash Area","street":"29 Mack Rd","city":"Warrenville","state":"IL","zip":"60185","latitude":41.8421192,"longitude":-88.1904547,"description":"Blackwell Off-Leash Area in Warrenville, IL, is a fenced area where Fido can run and play off-leash. Owners can get permits from the county to bring their pets to this large park. Leashed dogs are welcome in the surrounding area.","bringfido_id":"1992"},
  {"name":"Urbana Dog Park","street":"1501 E Perkins Rd","city":"Urbana","state":"IL","zip":"61803","latitude":40.124499,"longitude":-88.187988,"description":"Fido can play off-leash at Urbana Dog Park, an exclusive members only dog park in Urbana, IL. This fenced dog park offers a separate small dog area, rinse stations, drinking water (seasonally available) and benches. Registration and a key fob is required. Memberships are available at the Phillips Recreation Center. While day passes are not available, a monthly trial pass can be obtained for visitors to the area.","bringfido_id":"3688"},
  {"name":"Pottawattomie Dog Friendly Area","street":"7340 N Rogers Ave","city":"Chicago","state":"IL","zip":"60626","latitude":42.0151063,"longitude":-87.6780744,"description":"Pottawattomie Dog Friendly Area is a great place to take your pooch. Dogs are welcome to join their owners in this fenced-in area off-leash. There, you'll meet lots of other pups to play with. Make sure you clean up any mess that your pooch leaves behind.","bringfido_id":"17754"},
  {"name":"Love's Travel Stop","street":"809 Moore Ave","city":"Tuscola","state":"IL","zip":"61953","latitude":39.7920685,"longitude":-88.2657019,"description":"Love's Travel Stop is a dog-friendly gas station and rest stop in Tuscola, IL. This location features a dog park, Wi-Fi, and video gaming station for travelers who need a rest with their pups. Fido is welcome to play in the fenced-in, off-leash dog park or in the grassy areas near the on-site pond.","bringfido_id":"26283"},
  {"name":"River Run Dog Park","street":"1930 N 2753rd Rd","city":"Ottawa","state":"IL","zip":"61350","latitude":41.3451171,"longitude":-88.7965247,"description":"Located at the Heritage Harbor community in Ottawa, IL, River Run Dog Park offers ample room for dogs to enjoy some off-leash fun. The fenced park is divided into two separate areas, one for small pups and one for larger canines 30 pounds and over. Waste bags and disposal stations are provided for your convenience.","bringfido_id":"34179"},
  {"name":"Mattoon Community Dog Park","street":"320 N 2nd St","city":"Mattoon","state":"IL","zip":"61938","latitude":39.4856339,"longitude":-88.3543265,"description":"Bring Fido out for a day of play at Mattoon Community Dog Park in Matoon, IL. The large space is fully fenced and grass covered with separate areas for large and small dogs. Additional amenities include double-gated entry, agility equipment, picnic tables & benches, water features, and waste stations.","bringfido_id":"35620"},
  {"name":"Love's Travel Stop","street":"991 Ann Rutledge Dr","city":"Williamsville","state":"IL","zip":"62693","latitude":39.9609855,"longitude":-89.5623245,"description":"Love's Travel Stop in Williamsville, IL, is a dog-friendly gas station and rest area. Across America, you'll find Love's Travel Stops that offer facilities for traveling canines. This location has a fully-fenced dog park with a convenient waste station.","bringfido_id":"32786"},
  {"name":"Green Valley Forest Preserve Off-Leash Dog Area","street":"899 Greene Rd","city":"Naperville","state":"IL","zip":"60565","latitude":41.7486957,"longitude":-88.0856989,"description":"Fido can run and play at Green Valley Forest Preserve Off-Leash Dog Area, a pet-friendly area in Naperville, IL. The park features separate areas for small and large dogs. Leashed dogs are allowed in other areas of the preserve.","bringfido_id":"302"},
  {"name":"Beck Lake Off-Leash Dog Area","street":"East River Rd & Central Road","city":"Des Plaines","state":"IL","zip":"60016","latitude":42.0705159,"longitude":-87.8743731,"description":"Beck Lake Off-Leash Dog Area is a massive, 40-acre fenced dog park that includes wide open fields, trails, drinking fountains, training enclosures, and even a swimming pond. Annual membership and key fob are required.","bringfido_id":"1493"},
  {"name":"Winnemac Park","street":"5100 N Leavitt St","city":"Chicago","state":"IL","zip":"60625","latitude":41.9741637,"longitude":-87.6817478,"description":"Pets are welcome to play on-leash at Winnemac Park in Chicago, IL. This park is packed with fun recreational facilities including a scenic prairie garden and nature trail, three softball fields, a soccer field and walkways.","bringfido_id":"3832"},
  {"name":"Trantina Farm Dog Park","street":"15707 W 151st St","city":"Homer Glen","state":"IL","zip":"60491","latitude":41.6122466,"longitude":-88.0017389,"description":"Trantina Farm Dog Park in Homer Glen, IL, is a 2-acre area for off-leash fun. The dog park is fenced and divided into two sections: one for smaller dogs less than 15\" at the shoulder or 30 lbs. or less, and the other for larger dogs. Parking, benches, a pavilion, and a mowed, looped trail surrounding the dog park are available for horses, dogs and humans. While the southern part of Trantina Farm site caters to domestic friends, the northern, approximate 30-acre portion is better suited for humans offering a playground, picnic area, limestone trail, restroom, fire pit, interpretive center, gardens, native prairie restoration, wildlife viewing and historical buildings.","bringfido_id":"12058"},
  {"name":"Wiggly Field & South Paw Dog Parks","street":"201 W National St","city":"West Chicago","state":"IL","zip":"60185","latitude":41.8944205,"longitude":-88.2111304,"description":"Wiggly Field & South Paw Dog Parks in West Chicago, IL, are fenced areas where Fido can run in play off-leash. The 2-acre area contains both parks. There are also pet-friendly walking trails in the surrounding park.","bringfido_id":"2785"},
  {"name":"Rover's Run Dog Park","street":"191st St","city":"Homewood","state":"IL","zip":"60430","latitude":41.54221,"longitude":-87.639667,"description":"Pets will love to play off-leash at Rover's Run Dog Park, a fenced dog park in Homewood, IL. The park features shade structures and drinking water for your convenience. A dog park tag from the county is required for entry at this members-only based park.","bringfido_id":"3411"},
  {"name":"Horner Park Dog Park","street":"2770 W Irving Park Rd","city":"Chicago","state":"IL","zip":"60618","latitude":41.9544158,"longitude":-87.6972257,"description":"Horner Park Dog Park in Chicago, IL, is pet friendly. Bring your pooch along to one of Chicago's largest fenced recreation areas. The park is fully fenced, so pups can play freely inside. Owners are reminded to keep an eye on pups playing and to clean up any mess that is left behind. Water stations and waste disposal facilities are on site.","bringfido_id":"23115"},
  {"name":"Shepard Dog Park","street":"701 Hershey Rd","city":"Normal","state":"IL","zip":"61761","latitude":40.5217271,"longitude":-88.9429393,"description":"Pups can play off-leash at Shepard Dog Park in Normal, IL. This fenced dog park is located at the north end of pet-friendly Shepard Park and offers separate areas for small and large dogs, benches and some shade.","bringfido_id":"10666"},
  {"name":"Bennett Park","street":"456 E Illinois St","city":"Chicago","state":"IL","zip":"60611","latitude":41.8913664,"longitude":-87.6164335,"description":"Bennett Park is a dog-friendly park in Chicago, IL. Your leashed dog is welcome to join you at the park for a walk on the concrete paths or in the dog runs. Please note that dogs are not allowed on the playground, any space filled with sand, or running along side the bike.","bringfido_id":"27402"},
  {"name":"Connie Nott Canine Area","street":"1285 W Carl Sandburg Dr","city":"Galesburg","state":"IL","zip":"61401","latitude":40.9721493,"longitude":-90.3930335,"description":"Pups can play off-leash at Connie Nott Canine Area in Galesburg, IL. Located within the larger, pet-friendly Inbinder Park, this dog park offers a separate section for small dogs, seasonal water features and both canine and human water fountains. The park also contains some equipment, including a fire hydrant. There is an annual fee to visit this dog park, but day passes for city visitors are also available at the Galesburg City Clerk’s office.","bringfido_id":"18315"},
  {"name":"Love's Travel Stop","street":"9191 IL-140","city":"Hamel","state":"IL","zip":"62046","latitude":38.89012,"longitude":-89.8366635,"description":"Love's Travel Stop in Hamel, IL, is a dog-friendly gas station and rest area. Across America, you'll find Love's Travel Stops that offer facilities for traveling canines. This location has a fully-fenced dog park with a gravel surface featuring two picnic tables and a convenient waste station.","bringfido_id":"26524"},
  {"name":"Hillsboro 620K9 Dog Park","street":"675 School St","city":"Hillsboro","state":"IL","zip":"62049","latitude":39.1569127,"longitude":-89.4883459,"description":"Bring Fido to play with four-legged friends at Hillsboro 620K9 Dog Park. The park is located alongside Challacombe Park in Hillsboro, IL, and is open to the public. There are two separate fenced areas for large and small dogs, pet waste stations, and a water pump. Please note that shade in this park is limited.","bringfido_id":"33559"},
  {"name":"Mayslake Forest Preserve Dog Park","street":"3401-3499 St Paschal Dr","city":"Oak Brook","state":"IL","zip":"60523","latitude":41.8285061,"longitude":-87.9544968,"description":"Mayslake Forest Preserve Dog Park in Oak Brook, IL, is a large, fenced off-leash park renowned for its friendly community of pet owners. Includes covered picnic tables, mulch ground cover, and a portable restroom. There are two separate sections for small and large dogs to enjoy. An annual pass or daily permit for each dog is required to use the facility.","bringfido_id":"2955"},
  {"name":"Bremen Grove Off Leash Area","street":"15874 Oak Park Ave","city":"Tinley Park","state":"IL","zip":"60477","latitude":41.6002202,"longitude":-87.7844127,"description":"Dog-friendly Bremen Grove Off Leash Area is located in Tinley Park, IL. The park is fully fenced, has a secure double gated entrance, and two separate areas for small and large breed dogs. Please bring your own water for Fido.","bringfido_id":"10571"},
  {"name":"Joe Glik Park Dog Park","street":"710 E Lake Dr","city":"Edwardsville","state":"IL","zip":"62025","latitude":38.7937151,"longitude":-89.9259073,"description":"Fido can play off-leash at Joe Glik Park Dog Park in Edwardsville, IL. The fenced dog park offers trees for pups to sniff and shade to relax in. The larger, pet-friendly Joe Gilk Park offers a walking trail, covered picnic pavilions, Freedom Fountain and more to explore. Just remember to leash your pup outside of the dog park.","bringfido_id":"10282"},
  {"name":"Jaycee Dog Park","street":"1026 Wilmot Rd","city":"Deerfield","state":"IL","zip":"60015","latitude":42.171653,"longitude":-87.8671011,"description":"Fido can get some exercise at Jaycee Dog Park in Deerfield, IL. This fenced area includes agility equipment, as well as benches and tables for your convenience. The surrounding Jaycee Park features a playground, restrooms, picnic shelters, walking paths and more.","bringfido_id":"11719"},
  {"name":"Frankfort Bark Park","street":"22108 S 80th Ave","city":"Frankfort","state":"IL","zip":"60423","latitude":41.4844498,"longitude":-87.8096225,"description":"Frankfort Bark Park in Frankfort, IL, is a fenced area where Fido can get some exercise and socialize with friends. It is a members-only park, which means you must register your dog with the Frankfort Park District to receive an access card. The park features a separate area for small dogs.","bringfido_id":"2490"},
  {"name":"River Dog Friendly Area","street":"5100 N Francisco Ave","city":"Chicago","state":"IL","zip":"60625","latitude":41.973968,"longitude":-87.701965,"description":"Fido can exercise and socialize at the River Dog Friendly Area in Chicago, IL. Pets go wild for the chance to play off-leash at this fenced dog park located near the swimming pool within River Park.","bringfido_id":"3353"},
  {"name":"Lakeshore East Dog Park","street":"450 E Benton Pl","city":"Chicago","state":"IL","zip":"60601","latitude":41.8855107,"longitude":-87.6189933,"description":"Pet-friendly Lakeshore East Dog Park is a popular off-leash area in Chicago, IL. Situated within Lakeshore East Park, Fido is sure to enjoy this shady, fully-fenced space. Visitors will find an accessibility-friendly flat concrete path and water fountain, in addition to comfortable grass ideal for you dog to run and play. There are also benches and waste receptacles.","bringfido_id":"3182"},
  {"name":"Riverside Dog Park","street":"2610 W Riverside Park Rd","city":"Murphysboro","state":"IL","zip":"62966","latitude":37.756913,"longitude":-89.356045,"description":"Riverside Dog Park, established by the volunteer organization Friends of Murphysboro Dog Park, is an off-leash fenced dog park in Murphysboro, IL. This dog park offers a separate section for small dogs, waste stations, seasonally-available drinking fountains, benches, shade and a turf surface.","bringfido_id":"9954"},
  {"name":"Larrabee Dog Park","street":"652 N Larrabee St","city":"Chicago","state":"IL","zip":"60654","latitude":41.8942927,"longitude":-87.6431745,"description":"Larrabee Dog Park in Chicago, IL, is pet friendly. This fenced-in area is a cool place to take Fido to spend the afternoon. Your pup can socialize, play games and hang out next to the pretty Chicago River. The park sits on an elevated gravel patch and comes equipped with benches for humans to enjoy while their dogs have fun.","bringfido_id":"18686"},
  {"name":"Love's Travel Stop","street":"16991 IL-72","city":"Monroe Center","state":"IL","zip":"61052","latitude":42.0997703,"longitude":-89.0207665,"description":"Love's Travel Stop in Monroe Center, IL is a dog-friendly gas station and rest area. Across America, you'll find Love's Travel Stops that offer facilities for traveling canines. This location has a fully-fenced dog park with a convenient waste station.","bringfido_id":"29148"},
  {"name":"Butterworth Dog Park","street":"15th St & 8th Ave","city":"Moline","state":"IL","zip":"61265","latitude":41.503779,"longitude":-90.5153022,"description":"Take Fido to run, play and make new friends at the 1.48-acre Butterworth Dog Park in downtown Moline, IL. The dog park features two separate fenced-in sections to protect the grass. Only one section will be open at a time. Butterworth Dog Park is furnished with benches and water fountains. Please note that the water is shut off from October to May.","bringfido_id":"29217"},
  {"name":"Starved Rock Dog Park","street":"1201 E Walnut St","city":"Oglesby","state":"IL","zip":"61348","latitude":41.2942662,"longitude":-89.0445415,"description":"Located near Matthiessen State Park and across the street from Lehigh Memorial Park, Starved Rock Dog Park offers a fenced area for pups to play off leash in Oglesby, IL. Note there aren't separate areas for large and small dogs at this park, so canines of all sizes are welcome in the same space. Park amenities include pet waste stations for easy cleanup during your visit.","bringfido_id":"39444"},
  {"name":"Pup Social","street":"2200 N Ashland Ave","city":"Chicago","state":"IL","zip":"60614","latitude":41.9216936,"longitude":-87.6688743,"description":"Pup Social is Chicago, IL’s first private dog club and off-leash bar park, offering a unique space for pups and their people to socialize. This 21+ canine clubhouse features turf-covered play yards, pup-tenders, behavior assessments and structured off-leash zones. Inside, members can relax with drinks or work in a co-working lounge while dogs roam freely. Amenities include a grooming spa, curated barktique, self-pour bar and dog-friendly events — all designed for the modern pet parent.","bringfido_id":"41634"},
  {"name":"Dog Park at Big Creek Park","street":"940 N Main St","city":"Canton","state":"IL","zip":"61520","latitude":40.5679677,"longitude":-90.0388881,"description":"Bring Fido to the dog park at Big Creek Park in Canton, IL. This outdoor recreation space features two fenced areas for small and large pups to explore. Dogs can play and exercise off leash while their owners watch from benches nearby. Other amenities of the park include shade, double-gated entry, a water fountain and waste stations. Pets must be leashed when entering and exiting the dog park.","bringfido_id":"38805"},
  {"name":"Blackhawk Dog Park","street":"190 E Golf Rd","city":"Des Plaines","state":"IL","zip":"60016","latitude":42.0501535,"longitude":-87.9187791,"description":"Fido is invited to play at Blackhawk Dog Park in Des Plaines, IL. This fenced-in park features separate areas for small and large dogs, agility equipment for active pups, and a convenient rinse and hydration station. Shaded seating and a cozy pup pavilion make it a perfect spot for dogs and their humans to relax and socialize.","bringfido_id":"42528"},
  {"name":"Challenger Park Dog Friendly Area","street":"1100 W Irving Park Rd","city":"Chicago","state":"IL","zip":"60613","latitude":41.952737,"longitude":-87.656919,"description":"Fido can socialize and get some exercise at the Challenger Park Dog Friendly Area in Chicago, IL. Dogs will love to run and play off-leash at this fenced, dog-friendly area inside Challenger Park.","bringfido_id":"2121"},
  {"name":"Best Friends Dog Park Club","street":"22096 N Pet Ln","city":"Buffalo Grove","state":"IL","zip":"60089","latitude":42.184503,"longitude":-87.951545,"description":"Best Friends Dog Park Club in Buffalo Grove, IL, is open 365 days a year from 8am till dusk. All dogs must show proof of current vaccinations. There is a yearly cost of $49. This needs to be renewed each year, along with your pets vaccinations. You need a key to enter, which you get at time of payment.","bringfido_id":"891"},
  {"name":"Chopin Park","street":"3420 N Long Ave","city":"Chicago","state":"IL","zip":"60641","latitude":41.942676,"longitude":-87.7617365,"description":"Walk with your leashed pet through Chopin Park, a scenic, pet-friendly park in Chicago, IL. The park features green space, a playground, fields and more.","bringfido_id":"2147"},
  {"name":"Wicker Dog Friendly Area","street":"1425 N Damen Ave","city":"Chicago","state":"IL","zip":"60622","latitude":41.908218,"longitude":-87.677357,"description":"Pets are welcome to play off-leash at the Wicker Dog Friendly Area located within Wicker Park in Chicago, IL. There's plenty to do in this fenced-in area, where dogs can socialize and meet other like-minded hounds. Make sure you clean up any mess that your pooch leaves behind.","bringfido_id":"3799"},
  {"name":"Coliseum Dog Park","street":"1466 S Wabash Ave","city":"Chicago","state":"IL","zip":"60605","latitude":41.862275,"longitude":-87.6257215,"description":"Bring your pet to play off-leash at Coliseum Dog Park in Chicago, IL. This shady, fenced, neighborhood dog park is a great place for Fido to get some exercise and socialize with other furry friends.","bringfido_id":"2194"},
  {"name":"Dog Park at White Oaks Park","street":"111 S Wood Dale Rd","city":"Wood Dale","state":"IL","zip":"60191","latitude":41.956716,"longitude":-87.9788172,"description":"Pets love the chance to play off-leash at Dog Park at White Oaks Park, a fenced dog park in Wood Dale IL. The park features agility equipment, benches and trash receptacles for your convenience. A permit is required for entry and can be purchased at the Recreation Complex front desk located at 111 E Foster Ave in Wood Dale.","bringfido_id":"2309"},
  {"name":"Canine Corners Dog Park - Elliot Park","street":"888 S Lyford Rd","city":"Rockford","state":"IL","zip":"61108","latitude":42.2618087,"longitude":-88.9541417,"description":"Canine Corners Dog Park - Elliot Park in Rockford, IL, is a large, off-leash park where Fido can socialize and exercise. A membership is required for entry and passes can be purchased online. The park includes two separate fenced-in areas for pets to play.","bringfido_id":"2396"},
  {"name":"Clow Stephens Dog Park","street":"16650 S Lily Cache Rd","city":"Plainfield","state":"IL","zip":"60586","latitude":41.5810677,"longitude":-88.1851616,"description":"Clow Stephens Dog Park in Plainfield, IL, is a great place for Fido to get some exercise and socialize with other furry friends. The park features separate areas for small and large dogs.","bringfido_id":"14002"},
  {"name":"Herrin Memorial Park Dog Park","street":"1010 N 5th St","city":"Herrin","state":"IL","zip":"62948","latitude":37.8117398,"longitude":-89.0160527,"description":"Fido can enjoy time off-leash at Herrin Memorial Park Dog Park located within the pet-friendly city park in Herrin, IL. The fenced dog park has a separate section for small dogs, mature trees that provide shade and waste stations. Please bring water for your pup and remember they must be leashed outside of the dog park.","bringfido_id":"13192"},
  {"name":"Hamlin Dog Friendly Area","street":"3035 N Hoyne Ave","city":"Chicago","state":"IL","zip":"60618","latitude":41.9365414,"longitude":-87.6806596,"description":"Fido can run and play at the Hamlin Dog Friendly Area in Chicago, IL. This gravel-covered, fenced, off-leash dog park is a favorite with locals. Registration is required for entry.","bringfido_id":"2596"},
  {"name":"Champaign Bark District Dog Park","street":"5001 Windsor Rd","city":"Champaign","state":"IL","zip":"61822","latitude":40.083831,"longitude":-88.317686,"description":"The members-only Champaign Bark District Dog Park provides your dog a place to run off-leash and interact with other dogs and humans in Champaign, IL. Located on 7-acres near the southeast corner of Windsor and Rising Roads, the fenced dog park features double-gated entry area, separate areas for large and small dogs, human and canine water fountains and waste stations. Membership and a key fob are required for entry.","bringfido_id":"15086"},
  {"name":"East Side Sports Complex","street":"3855 Commerce Dr","city":"St. Charles","state":"IL","zip":"60174","latitude":41.9057429,"longitude":-88.2655853,"description":"East Side Sports Complex Dog Park is a dog-friendly park in St. Charles, IL where Fido is welcome to join on the 2.84 miles of trails, or at the dog park on the north side of the complex. Enjoy the fishing pond and wetland-front trail, as well as the fenced in off-leash dark park while you're there.","bringfido_id":"25846"},
  {"name":"Bark Park","street":"280 Kuhn Rd","city":"Carol Stream","state":"IL","zip":"60188","latitude":41.908738,"longitude":-88.141987,"description":"Bark Park in Carol Stream, IL, is a fenced area where Fido can get some exercise and play off-leash. The dog park features agility equipment and benches. A membership is required for entry and can be purchased at the Fountain View or Simkus Recreation Centers.","bringfido_id":"13172"},
  {"name":"Eleanor Wallace Dog Park","street":"2738-2898 78th Ave W","city":"Rock Island","state":"IL","zip":"61201","latitude":41.4431584,"longitude":-90.6076241,"description":"Pups can play off-leash at Eleanor Wallace Dog Park in Rock Island, IL. Located within pet-friendly Hasselroth Park, the popular, fenced dog park can be find near the 78th Avenue part of the park. Please clean up after your pup and be sure their are on-leash outside of the dog park. This facility is generally closed from mid-April through Memorial Day for rehabilitation, though dates vary annually, so please confirm the park's status prior to visiting around this time.","bringfido_id":"2621"},
  {"name":"Churchill Dog Friendly Area","street":"1825 N Damen Ave","city":"Chicago","state":"IL","zip":"60647","latitude":41.914616,"longitude":-87.677554,"description":"Churchill Dog Friendly Area in Chicago, IL, is an off-leash, fully fenced dog park with street parking on Winchester. There is a water fountain for your convenience. Keep in mind that the entire enclosure is concrete.","bringfido_id":"2157"},
  {"name":"Nelson Park Dog Park","street":"2240 E Cantrell St","city":"Decatur","state":"IL","zip":"62521","latitude":39.8353192,"longitude":-88.9361995,"description":"Fido can enjoy time off-leash at Nelson Park Dog Park, a 3-acre fenced dog park located within pet-friendly Nelson Park in Decatur, IL. The dog park features an electronic, double-gated entrance with separate sections for small and large dogs. Please note that registration is necessary to access the dog park. Visit the Decatur Parks District website for more information on the registration process.","bringfido_id":"11128"},
  {"name":"Plum Grove Reservoir Park","street":"86JH3WHJ+7P","city":"Palatine","state":"IL","zip":"60067","latitude":42.078188,"longitude":-88.0681403,"description":"Plum Grove Reservoir Park is home to a spacious dog park. This 1.2 acre fenced recreation space welcomes dogs to play off-leash, as long as they are registered. Registration is accepted year-round and forms can be downloaded online or are available for pick-up at Community Center, Birchwood Recreation Center, or Falcon Park Recreation Center.  Fees are $45 for the first resident dog, and $10 for each additional dog; and $57 for the first non-resident dog, and $13 for each additional dog. Plum Grove Reservoir Park's dog park is open every day of the week from dawn until dusk.","bringfido_id":"24739"},
  {"name":"Happy Tails Dog Park","street":"Coal Car Dr","city":"Pekin","state":"IL","zip":"61554","latitude":40.560181,"longitude":-89.6218233,"description":"Fido can play off-leash at Happy Tails Dog Park in Pekin, IL. Located along Court Street and Coal Car Drive in pet-friendly Mineral Springs Park, this fenced dog park features a separate section for small dogs, shade, mature trees and a community canine water station. This dog park is even lit for evening play sessions.","bringfido_id":"2607"},
  {"name":"River Bend Community Park","street":"6N517 Geneva Ave","city":"St. Charles","state":"IL","zip":"60174","latitude":41.9628697,"longitude":-88.298414,"description":"River Bend Community Park is home to a great dog park where pups can play off-leash. This 3/4 of an acre space gives dogs plenty of room to play fetch. It also features a double-gated security entrance and a water fountain. After playing in the dog park, attach Fido's leash and go for a walk along 2 miles of paved trails. The park is open every day of the week from 9am until dusk.","bringfido_id":"24734"},
  {"name":"Walsh Dog Friendly Area","street":"1722 N Ashland Ave","city":"Chicago","state":"IL","zip":"60622","latitude":41.9131204,"longitude":-87.6678392,"description":"The Walsh Dog Friendly Area is a great place for Fido to run and play in Chicago, IL. Residents love the long, spacious, shady dog park at the north end of Walsh Park. Make sure you clean up any mess that your pooch leaves behind.","bringfido_id":"3729"},
  {"name":"Fido Fields","street":"620 E Riverside Ave","city":"Decatur","state":"IL","zip":"62521","latitude":39.8460106,"longitude":-88.9964585,"description":"Pups can play off-leash at Fido Fields, a 2-acre fenced dog park located within pet-friendly Fairview Park in Decatur, IL. The dog park offers an electronic, double-gated entrance with separate spaces for small and large dogs. Registration and an annual fee are necessary to gain access to Fido Fields. Additional information can be found at the Decatur Park District website linked below.","bringfido_id":"255"},
  {"name":"Freedom Run Dog Park","street":"6150 Russell Rd","city":"Hoffman Estates","state":"IL","zip":"60192","latitude":42.053953,"longitude":-88.2449767,"description":"The Hoffman Estates Park District offers two open spaces for dogs to run without their leashes, with ample amenities for dogs and their best friends to enjoy the outdoors together. Freedom Run is located on the far west side at 6150 Russell Road, and is a park shared with the City of Elgin and the Streamwood Park District. For more information on park rules and membership, call (847) 285-5440.","bringfido_id":"25263"},
  {"name":"Love's Travel Stop","street":"201 Loves Crossing","city":"Hampshire","state":"IL","zip":"60140","latitude":42.148395,"longitude":-88.5169433,"description":"Love's Travel Stop in Hampshire, IL, is a dog-friendly gas station and rest area. Across America, you'll find Love's Travel Stops that offer facilities for traveling canines. This location has a fully-fenced dog park with a convenient waste station.","bringfido_id":"26529"},
  {"name":"Canine Corners Dog Park at Olson Park","street":"7901 Harlem Rd","city":"Loves Park","state":"IL","zip":"61111","latitude":42.342537,"longitude":-88.9639977,"description":"Canine Corners Dog Park at Olson Park is a great place to let your dog off the leash to run, play, and socialize. These parks are open year-round from dawn to dusk, and they are fenced so dogs are safely contained off-leash, with brush and paths for a great field experience.\n\nAn annual pass (in the form of a visible dog tag), or one-day pass is required for all dogs using the park. Season or Day Passes must be purchased in-person at any Rockford Park District Customer Service office during regular business hours. \n\nFull Season Tag: $60; $50 resident\nDay Passes: $6/dog","bringfido_id":"25314"},
  {"name":"Love's Travel Stop","street":"13477 Quality Dr","city":"Roscoe","state":"IL","zip":"61073","latitude":42.4552093,"longitude":-89.0004008,"description":"Love's Travel Stop in Roscoe, IL, is a dog-friendly gas station and rest area. Across America, you'll find Love's Travel Stops that offer facilities for traveling canines. This location has a fully-fenced dog park with a convenient waste station.","bringfido_id":"26545"},
  {"name":"Blue Island Bark Park","street":"2601 W 119th St","city":"Blue Island","state":"IL","zip":"60406","latitude":41.6771608,"longitude":-87.6862417,"description":"Blue Island Bark Park is a pet-friendly park in Blue Island, IL. This dog park has an area for small dogs and a separate section for larger dogs. You and your pooch can enjoy this park for an annual fee. If you're planning on joining in the fun, up-to-date vaccinations must be displayed at registration.","bringfido_id":"16779"},
  {"name":"Centennial Dog Park","street":"2746-2532 Lenhart Rd","city":"New Berlin","state":"IL","zip":"62670","latitude":39.7604775,"longitude":-89.7542285,"description":"The Springfield Illinois Park District is excited to announce the brand new dog park at Centennial Park! Centennial Dog Park is over an acre in size built for all dogs and park patrons to enjoy. The park was built to be fully ADA accessible and includes accessible parking, custom concrete walks, rock walking path and elevated viewing deck and community gathering space. The dog park features separate play areas for large dogs and small dogs, challenging obstacle course, misting fire extinguishers, dog water fountains, dog waste stations, benches and shelters.","bringfido_id":"25177"},
  {"name":"Skinner Bark Park","street":"1358 W Monroe St","city":"Chicago","state":"IL","zip":"60607","latitude":41.8804162,"longitude":-87.6617399,"description":"Skinner Bark Park, officially known as Park No. 569, is a pet-friendly spot to let Fido run off-leash. This modern park is home to concrete paths for wandering on, open areas to play catch on, grass, and gravel. You can clean your pooch up if they get messy using the stations provided. If you or your pooch get parched, you can drink from the water fountains.","bringfido_id":"17752"},
  {"name":"Love's Travel Stop","street":"1533 E 162nd St","city":"South Holland","state":"IL","zip":"60473","latitude":41.5998609,"longitude":-87.57944,"description":"Love's Travel Stop is a dog-friendly gas station and rest stop in South Holland, IL. This location features a dog park, video gaming station, ATM, and truck parking for travelers that need to rest and recharge with their pups. Fido is welcome to play at the fenced-in dog park and on-leash in the grassy areas away from the major intersections and entrances.","bringfido_id":"26296"},
  {"name":"Poplar Grove Dog Park","street":"200 N Hill St","city":"Poplar Grove","state":"IL","zip":"61065","latitude":42.3684212,"longitude":-88.8281635,"description":"Poplar Grove Dog Park is a pet-friendly recreation area in Poplar Grove, IL. Four years in the making, construction of Poplar Grove Dog Park has been a marathon, rather than a zoomy. The gates are finally open and residents are welcome to bring dogs along to run free and play in the fenced grassy space. Tags to use the park can be purchased from Poplar Grove Village Hall across the street from the park.","bringfido_id":"27259"},
  {"name":"Edgewater Dog Park","street":"5800 N Lake Shore Dr","city":"Chicago","state":"IL","zip":"60660","latitude":41.9842709,"longitude":-87.6524331,"description":"The park, which is located just north of Bryn Mawr and just East of Lake Shore Drive, is fenced off with a tall green fence. All dogs using Chicago dog parks and beaches are required to have a DFA tag.","bringfido_id":"25637"},
  {"name":"Willow Stream Park","street":"651 Old Checker Rd","city":"Buffalo Grove","state":"IL","zip":"60089","latitude":42.1588131,"longitude":-87.9726639,"description":"Willow Stream Park is a pet-friendly recreation area on 54 acres in Buffalo Grove, IL. Leashed dogs are welcome to join their owners for a walk along the paved pathway, or enjoy a picnic in the shade at the picnic shelter.","bringfido_id":"29827"},
  {"name":"Love's Travel Stop","street":"1533 E 162nd St","city":"South Holland","state":"IL","zip":"60473","latitude":41.5998649,"longitude":-87.5816287,"description":"Love's Travel Stop in South Holland, IL, is a dog-friendly gas station and rest area. Across America, you'll find Love's Travel Stops that offer facilities for traveling canines. This location has a fully-fenced dog park with a convenient waste station.","bringfido_id":"26516"},
  {"name":"Dog Wash Park","street":"320 Whitney Blvd","city":"Belvidere","state":"IL","zip":"61008","latitude":42.2574832,"longitude":-88.8394094,"description":"Fido is welcome at Dog Wash Park in Belvidere, IL. This fenced, off-leash dog park with agility equipment also features convenient locations to bathe your pups. There are 3 self-service pet wash stations that operate on tokens (with a token exchanger available on-site) for you to use to wash your pup off after they romp around this fun park.","bringfido_id":"29340"},
  {"name":"Mary Bartelme Dog Park","street":"115 S Sangamon St","city":"Chicago","state":"IL","zip":"60607","latitude":41.8798425,"longitude":-87.6502418,"description":"Mary Bartelme Dog Park is a great pet-friendly area to take your pooch in Chicago, IL. This off-leash park is popular among local dog owners who want to give their dogs some exercise and let them play with other pups. Formerly the site of an old infirmary, the park also includes a fountain plaza, a children's play area, an open lawn, a viewing hill, and an enclosed seating area.","bringfido_id":"17750"},
  {"name":"Love's Travel Stop","street":"3925 County Fair Dr","city":"Decatur","state":"IL","zip":"62526","latitude":39.8927751,"longitude":-89.0023154,"description":"Love's Travel Stop is a dog-friendly gas station and rest stop in Decatur, IL. This location features a dog park, video gaming stations, Wi-Fi, and private showers for travelers that need to rest and recharge with their pups. Fido is welcome to play at the fenced-in dog park or on-leash on the grassy area behind the parking lot.","bringfido_id":"26301"},
  {"name":"Chatham Dog Park","street":"Churchill Dr","city":"Chatham","state":"IL","zip":"62629","latitude":39.6738225,"longitude":-89.71566299999999,"description":"Chatham Dog Park is located on the east end of Westside Park in Chatham, IL. Bring Fido out for a day of exercise, play, and social time with other pups! The off-leash space is fully fenced and grass covered with gravel trails inside. Amenities include separate areas for large and small dogs, a covered pavilion, benches, a water fountain, and waste stations. Be careful as the park can get muddy after rain.","bringfido_id":"33560"},
  {"name":"Love's Travel Stop","street":"1503 S West St","city":"Olney","state":"IL","zip":"62450","latitude":38.711902,"longitude":-88.091835,"description":"Love's Travel Stop is a dog-friendly gas station and rest stop in Olney, IL. This location features a dog park, propane tank exchange, Wi-Fi, and RV dump station for travelers that need to recalibrate with their pups. Fido is welcome to play at the fenced-in dog park, but is not allowed in other areas of the gas station.","bringfido_id":"26286"},
  {"name":"Love's Travel Stop","street":"4628 S Main St","city":"Rockford","state":"IL","zip":"61102","latitude":42.216103,"longitude":-89.1092751,"description":"Love's Travel Stop in Rockford, IL, is a dog-friendly gas station and rest area. Across America, you'll find Love's Travel Stops that offer facilities for traveling canines. This location has a fully-fenced dog park with a convenient waste station.","bringfido_id":"26540"},
  {"name":"Love's Travel Stop","street":"43100 US Hwy 41","city":"Wadsworth","state":"IL","zip":"60083","latitude":42.4888557,"longitude":-87.9556201,"description":"Love's Travel Stop in Wadsworth, IL, is a dog-friendly gas station and rest area. Across America, you'll find Love's Travel Stops that offer facilities for traveling canines. This location has a fully-fenced dog park with a convenient waste station.","bringfido_id":"26533"},
  {"name":"Love's Travel Stop","street":"23801 W Bluff Rd","city":"Channahon","state":"IL","zip":"60410","latitude":41.4344841,"longitude":-88.1924594,"description":"Love's Travel Stop in Channahon, IL, is a dog-friendly gas station and rest area. Across America, you'll find Love's Travel Stops that offer facilities for traveling canines. This location has a fully-fenced dog park with a convenient waste station.","bringfido_id":"26517"},
  {"name":"Love's Travel Stop","street":"2005 Mousette Ln","city":"Sauget","state":"IL","zip":"62206","latitude":38.5619024,"longitude":-90.1311341,"description":"Love's Travel Stop in Sauget, IL, is a dog-friendly gas station and rest area. Across America, you'll find Love's Travel Stops that offer facilities for traveling canines. This location has a fully-fenced dog park with a convenient waste station.","bringfido_id":"26532"},
  {"name":"Love's Travel Stop","street":"202 North Ave","city":"Ina","state":"IL","zip":"62846","latitude":38.1555329,"longitude":-88.9108853,"description":"Love's Travel Stop is pet-friendly. This clean truck stop has a dog park and a McDonald's. Let your dog play off-leash, but don't forget to clean up any mess they leave behind. The gas station is always open.","bringfido_id":"25061"},
  {"name":"Love's Travel Stop","street":"3407 S State Road 45/52","city":"Kankakee","state":"IL","zip":"60901","latitude":41.07279,"longitude":-87.867238,"description":"Love's Travel Stop is a dog-friendly gas station and rest stop in Kankakee, IL. This location features a dog park, private showers, and Wi-Fi for travelers that want to relax with their pups. Fido is welcome to play at the dog park or the large, grassy area near the on-site pond.","bringfido_id":"26291"},
  {"name":"Melas Park Canine Commons","street":"1500 W Central Rd","city":"Mount Prospect","state":"IL","zip":"60056","latitude":42.0709138,"longitude":-87.9603818,"description":"Melas Park Canine Commons is an off-leash and fully-fenced green space for dogs in Mount Prospect, IL. It is located on the north end of Mesas park and features 1.82 acres for your dog to exercise, play and socialize with other pups! Amenities include separate areas for large and small dogs, waste receptables, picnic tables, and benches. Annual membership is required.","bringfido_id":"32133"},
  {"name":"Duryea Dog Park","street":"1001 E Duryea Ave","city":"Peoria","state":"IL","zip":"61616","latitude":40.7443717,"longitude":-89.578343,"description":"Duryea Dog Park is a recreational area in Peoria, IL. The park features separate areas for large and small dogs, waste stations and benches. Dog owners are reminded to clean up any mess that is left behind.","bringfido_id":"31185"},
  {"name":"Highland Jaycees Dog Park","street":"Veterans Honor Parkway","city":"Highland","state":"IL","zip":"62249","latitude":38.7479881,"longitude":-89.6557727,"description":"Highland Jaycees Dog Park is a fully fenced grassy area for Fido in Highland, IL. The park has a double-gated entry, pet waste station, agility structures, bench seating, a covered pavilion, and two separate areas for small and large dogs.","bringfido_id":"30280"},
  {"name":"Love's RV Stop Normal","street":"2007 N Main St","city":"Normal","state":"IL","zip":"61761","latitude":40.5402402,"longitude":-89.0014748,"description":"Love's RV Stop is a pet-friendly gas station, rest area and campground for RV travelers in Normal, IL. This location features a fully-fenced dog park and a pet wash station, back-in and pull-through sites, laundry facilities, covered pavilions, a playground and private showers.","bringfido_id":"34915"},
  {"name":"Ward Dog Friendly Area","street":"630 N Kingsbury St","city":"Chicago","state":"IL","zip":"60606","latitude":41.8937563,"longitude":-87.6424863,"description":"Ward Dog Friendly Area in Chicago, IL, is a great place to hang out with your pooch. Dogs are welcome to run off leash in this designated area, as long as owners clean up any mess that their pooches leave behind.","bringfido_id":"17755"},
  {"name":"Hardscrabble Lions Dog Park","street":"820 James St","city":"Streator","state":"IL","zip":"61364","latitude":41.1100327,"longitude":-88.8258933,"description":"Hardscrabble Lions Dog Park is a fenced dog park in the James Street Recreation Area in Streator, IL. Split into two separate spaces, this park features comfort and safety for both small and large pups to play off leash. Amenities include covered seating with picnic tables, waste stations and benches.","bringfido_id":"36139"},
  {"name":"South Elgin Dog Park","street":"225 S Water St","city":"South Elgin","state":"IL","zip":"60177","latitude":41.9908388,"longitude":-88.2950978,"description":"South Elgin Dog Park is a converted ballfield that offers a completely enclosed area for Fido and his friends to run and play in South Elgin, IL. Park amenities include a double-gated entry and separate fenced areas for large and small dogs. Parking is available behind the Trolley Museum and just south of SEBA Park.","bringfido_id":"36224"},
  {"name":"Park No. 556 Dog Friendly Area","street":"2529 W Logan Blvd","city":"Chicago","state":"IL","zip":"60647","latitude":41.9278518,"longitude":-87.6886981,"description":"Park No. 556 Dog Friendly Area in Chicago, IL, is an off-leash area that has separate sections for small dogs and large dogs. There are also benches to chill out on, water fountains and two secure double-gate entrances. During the summer months, you'll discover a paddling pool for hot dogs to keep cool.","bringfido_id":"17751"},
  {"name":"Fetch & Stretch Dog Park","street":"205 N Morehead St","city":"Chenoa","state":"IL","zip":"61726","latitude":40.7466834,"longitude":-88.7241277,"description":"Fido is invited to play at the Fetch & Stretch Dog Park located along the historic Route 66 in Chenoa, IL. The off-leash area offers two designated sections for large and small dogs in a safe and secure environment. Waste stations are provided for easy clean-up after your pup.","bringfido_id":"38587"},
  {"name":"Love's Travel Stop","street":"12 W Northbrook Dr","city":"Dwight","state":"IL","zip":"60420","latitude":41.113599,"longitude":-88.4174074,"description":"Love's Travel Stop in Dwight, IL, is a dog-friendly gas station and rest area. Across America, you'll find Love's Travel Stops that offer facilities for traveling canines. This location has a fully-fenced dog park with a convenient waste station.","bringfido_id":"26515"},
  {"name":"Love's Travel Stop Morris","street":"8909 Brisbin Rd","city":"Morris","state":"IL","zip":"60450","latitude":41.415297,"longitude":-88.365596,"description":"Love's Travel Stop is a gas station and rest area in Morris, IL. This pet-friendly location has a fully-fenced dog park with separate sections for small and large pups, trash receptacles, benches and a table. Features of this pit stop also include Hardee's, private showers, a laundry facility, Wi-Fi, tire services and more.","bringfido_id":"34916"},
  {"name":"Love's Travel Stop","street":"5 S State St Plaza","city":"Atkinson","state":"IL","zip":"61235","latitude":41.4106423,"longitude":-90.018123,"description":"Love's Travel Stop in Atkinson, IL, is a dog-friendly gas station and rest area. Across America, you'll find Love's Travel Stops that offer facilities for traveling canines. This location has a fully-fenced dog park with a convenient waste station.","bringfido_id":"26539"},
  {"name":"Love's Travel Stop","street":"1001 W 11th Ave","city":"Monmouth","state":"IL","zip":"61462","latitude":40.8992734,"longitude":-90.6625617,"description":"Love's Travel Stop in Monmouth, IL, is a dog-friendly gas station and rest area. Across America, you'll find Love's Travel Stops that offer facilities for traveling canines. This location has a fully-fenced dog park with a convenient waste station.","bringfido_id":"26547"},
  {"name":"Appell Dog Park at Baumann Park","street":"101 E State St","city":"Cherry Valley","state":"IL","zip":"61016","latitude":42.2318433,"longitude":-88.9566263,"description":"Appell Dog Park at Baumann Park is a members-only dog park featuring two separate fenced sections for small and large dogs. The dog park requires an annual membership and a fob to enter. There are a few gazebos with picnic tables outside of the park and nearby walking trails around the lake for leashed dogs to enjoy.","bringfido_id":"40108"},
  {"name":"Wiggly Field Dog Park","street":"400 W Romeo Rd","city":"Romeoville","state":"IL","zip":"60446","latitude":41.6398636,"longitude":-88.0892608,"description":"Wiggly Field Dog Park welcomes Fido to enjoy some off-leash play in Romeoville, IL. The small dog area features a 0.17-mile walking loop and a six-foot fence on three acres, and the large dog area features a 0.28-mile walking loop and an eight-foot fence on four acres. Park amenities also include shelters, benches, water fountains with a pet bowl, a phase 1 agility course, and waste stations. Memberships can be purchased through the recreation department and are required for each dog you bring to the park.","bringfido_id":"39507"},
  {"name":"Love's Travel Stop","street":"17919 Newtown Rd","city":"Oakwood","state":"IL","zip":"61858","latitude":40.1306059,"longitude":-87.7773134,"description":"Love's Travel Stop is a dog-friendly gas station and rest stop in Oakwood, IL. This location features a dog park, restaurants, Wi-Fi, and video gaming station for travelers who need to relax with their pups. Fido is welcome to play in the dog park or in the grassy areas in front of the additional parking away from the main entrance.","bringfido_id":"26279"},
  {"name":"Love's Travel Stop Mount Vernon","street":"3101 S 10th St","city":"Mount Vernon","state":"IL","zip":"62864","latitude":38.2777503,"longitude":-88.903252,"description":"Love's Travel Stop in Mount Vernon, IL is a pet-friendly gas station and rest area. Traveling canines will enjoy stretching their legs at this fully-fenced dog park, which features plenty of grass, benches, trash receptacles and waste bags.","bringfido_id":"34977"},
  {"name":"Rover’s Run Dog Park","street":"1705 N 36th St","city":"Quincy","state":"IL","zip":"62301","latitude":39.9529954,"longitude":-91.3593385,"description":"Bring Fido to Rover’s Run Dog Park in Quincy, IL. This fenced recreation area welcomes dogs to socialize and exercise off leash. The park is separated into two spaces, one for small pups and one for their larger four-legged companions; both sides feature water fountains. Visitors can register at the Quincy Humane Society in front of the park for a year-long pass that permits unlimited access.","bringfido_id":"36157"},
  {"name":"Love's Travel Stop","street":"201 Loves Dr","city":"South Jacksonville","state":"IL","zip":"62650","latitude":39.6895638,"longitude":-90.2299684,"description":"Love's Travel Stop in South Jacksonville, IL, is a dog-friendly gas station and rest area. Across America, you'll find Love's Travel Stops that offer facilities for traveling canines. This location has a fully-fenced dog park with a convenient waste station.","bringfido_id":"33027"},
  {"name":"Rotary Park Dog Park","street":"2837 E 5th Rd","city":"La Salle","state":"IL","zip":"61301","latitude":41.3461126,"longitude":-89.0724717,"description":"Rotary Park Dog Park features separate fenced areas for small and large dogs to enjoy some off-leash exercise in La Salle, IL. Located in the northwest corner of Rotary Park, this dog park offers benches and tables as well as a pet waste station for easy cleanup. Be sure to pack a bowl and some water for Fido to keep him hydrated while he plays.","bringfido_id":"39441"},
  {"name":"Oak Park & Bark","street":"21950 Scotia Rd","city":"Oak Park","state":"IL","zip":"48237","latitude":42.4564866,"longitude":-83.1719737,"description":"Owners can sign Fido up for an annual membership to Oak Park & Bark in Oak Park, IL. This private, 1.6-acre members-only dog park features three separate areas, catering to small dogs, large dogs, and those with special needs. Amenities include waste bags, trash bins, water fountains for pets and people, and a seasonal paw wash station. Closed Mondays from 8:00 AM – 11:00 AM for maintenance.","bringfido_id":"41745"},
  {"name":"Walnut Dog Park","street":"14405 N River Beach Dr","city":"Chillicothe","state":"IL","zip":"61523","latitude":40.8620716,"longitude":-89.52036,"description":"Walnut Dog Park in Chillicothe, IL, provides a leash-free area for pups to play in the scenic Illinois River Valley. The park features fenced areas for both large and small dogs, as well as waste stations. Note: no covered seating or water is provided, so plan accordingly.","bringfido_id":"41480"},
  {"name":"Love's Travel Stop Oglesby","street":"1001 W Walnut St","city":"Oglesby","state":"IL","zip":"61348","latitude":41.2934086,"longitude":-89.086436,"description":"Love's Travel Stop is a gas station and rest area in Oglesby, IL. This pet-friendly location features a small, fully fenced dog park where both large and small pups can stretch their legs together. Features of this rest stop also include Hardee's, private showers, Wi-Fi, truck parking and more.","bringfido_id":"41501"},
  {"name":"Dog Park at Willowhaven Park","street":"1451 N 4000 E Rd","city":"Kankakee","state":"IL","zip":"60901","latitude":41.1429174,"longitude":-87.7876013,"description":"Members are invited to play at the dog park at Willowhaven Park in Kankakee, IL. This spacious 3-acre park offers separate fenced areas for small and large dogs, seasonal water stations, waste bags, and trees. Memberships can be purchased at the Willowhaven Center or Perry Farm House.","bringfido_id":"41502"},
  {"name":"Dog Park at Arcola City Park","street":"268 E 1st S St","city":"Arcola","state":"IL","zip":"61910","latitude":39.6816139,"longitude":-88.2978439,"description":"Four-legged friends can run and play off-leash at the dog park at Arcola City Park in Arcola, IL. This fenced recreation area features a range of amenities like shade trees, pet waste bags, trash receptacles and more. Dogs must be leashed when entering and exiting the park.","bringfido_id":"41089"},
  {"name":"Dog Park at Lakeview Park","street":"Waterworks Rd","city":"Waterloo","state":"IL","zip":"62298","latitude":38.3134138,"longitude":-90.1677612,"description":"Four-legged friends are invited to romp off leash at the dog park at Lakeview Park in Waterloo, IL. This local favorite features two separate fenced areas, one for large dogs over 25 lbs and one for small dogs. Other amenities include shaded and unshaded park benches, double-gated entry, a waste station, and convenient parking.","bringfido_id":"42361"},
  {"name":"Love's Travel Stop Normal","street":"2007 N Main St","city":"Normal","state":"IL","zip":"61761","latitude":40.541664,"longitude":-88.998009,"description":"Love's Travel Stop is a gas station and rest area in Normal, IL. This pet-friendly location has a fully-fenced dog park with separate areas for small and large pups. After a bit of stretching his legs, you can clean Fido up in the pet wash station. Other features of this rest stop also include Bojangles, private showers, a laundry facility, Wi-Fi and more.","bringfido_id":"34914"},
  {"name":"Love's Travel Stop","street":"8690 Richter School Rd","city":"New Baden","state":"IL","zip":"62265","latitude":38.5346843,"longitude":-89.734723,"description":"Love's Travel Stop in New Baden, IL, is a dog-friendly gas station and rest area. Across America, you'll find Love's Travel Stops that offer facilities for traveling canines. This location has a fully-fenced dog park with a convenient waste station.","bringfido_id":"26526"},
  {"name":"Bull Valley Dog Park","street":"11115 Country Club Rd","city":"Woodstock","state":"IL","zip":"60098","latitude":42.3128082,"longitude":-88.4137456,"description":"The Bull Valley Dog Park in Woodstock, IL, is a wonderful 7-acre, completely fenced off-leash dog park. A permit is required for entry and can be purchased at the Village Hall. On Wednesdays, the park is closed until noon for routine maintenance. Note that children under 10. are prohibited, and an adult must accompany children 11-15.","bringfido_id":"11498"},
  {"name":"Evanston Dog Beach","street":"1811 Sheridan Rd","city":"Evanston","state":"IL","zip":"60202","latitude":42.0485136,"longitude":-87.6733889,"description":"Evanston Dog Beach in Evanston, IL, is an off-leash dog beach where Fido can swim, run and mingle on the shore of beautiful Lake Michigan. Anyone wishing to bring his/her dog to the dog beach must have a valid pass. Pet owners rave about this off-leash dog beach, which is fenced with a hose for washing off your pet. See website for rules and dog pass registration application.","bringfido_id":"369"},
  {"name":"Swansea Dog Park","street":"1500 Caseyville Ave","city":"Swansea","state":"IL","zip":"62226","latitude":38.529,"longitude":-89.9912564,"description":"Fido can play off-leash at Swansea Dog Park, located within the larger, pet-friendly Melvin Price Memorial Park in Swansea, IL. This small fenced dog park is open to the public and offers canine water fountain and waste stations. Friendly dogs with current vaccinations (including their rabies vaccine) are welcome to visit socialize.","bringfido_id":"3576"},
  {"name":"Fetch Dog Park","street":"1600 N Kimball St","city":"Danville","state":"IL","zip":"61832","latitude":40.1515421,"longitude":-87.6172649,"description":"Fetch Dog Park is a members-only, off-leash dog park in Danville, IL. This fenced dog park has a 4-acre section for large dogs and a separate 1-acre space for small pups, waste stations, water fountains and sheltered seating. The dog park is within the larger Espenscheid Park. If you and Fido still have some energy left, there are 2 miles of pet-friendly trails in the large prairie behind the dog park. Please remember to leash your dog outside of the dog park.","bringfido_id":"12873"},
  {"name":"Forest Park Dog Park","street":"632 Circle Ave","city":"Forest Park","state":"IL","zip":"60130","latitude":41.874678,"longitude":-87.807832,"description":"Forest Park Dog Park in Forest Park, IL, is a fenced area where Fido can run and play off-leash. Everyone is welcome, however you must obtain a license from Village Hall.","bringfido_id":"11093"},
  {"name":"Karban Park","street":"3430 34th St","city":"Berwyn","state":"IL","zip":"60402","latitude":41.829957,"longitude":-87.786758,"description":"Karban Park is the only designated off-leash dog park in Berwyn, IL. The pet-friendly park is located just off of Ogden Avenue, behind the Ziegler car dealership. This fenced area has a personalized memorial brick area for pets that have been lost, a water fountain for people and dogs, a kiddie pool for the pups, trees, bushes, a fire hydrant and benches for humans. A permit is required for entry and they are available to Berwyn residents only.","bringfido_id":"18602"}
]
