[
  {
    "name": "H. P. Thomas Park",
    "street": "",
    "city": "Bowling Green",
    "state": "KY",
    "zip": "",
    "latitude": 36.9903199,
    "longitude": -86.4436018,
    "description": "Dog owners in Bowling Green have made H. P. Thomas Park a go-to spot, rating it 4.9 stars across 8 reviews. Dog owners in the area consistently choose this park as a go-to destination for their pups. Looking for more places to take your pup? Bark Park is another popular dog park just 3.1 miles away."
  },
  {
    "name": "Bark Park",
    "street": "850 Cave Mill Rd",
    "city": "Bowling Green",
    "state": "KY",
    "zip": "42104",
    "latitude": 36.9488496,
    "longitude": -86.4636945,
    "description": "With 4.7 stars from 603 reviews, Bark Park at 850 Cave Mill Rd has become a favorite among Bowling Green dog owners. Open from 7:30am to 5pm daily, the park accommodates early risers and evening visitors alike. Looking for more places to take your pup? H. P. Thomas Park is another popular dog park just 3.1 miles away."
  },
  {
    "name": "Boone County Dog Park",
    "street": "5550 Idlewild Rd",
    "city": "Burlington",
    "state": "KY",
    "zip": "41005",
    "latitude": 39.0362288,
    "longitude": -84.7324408,
    "description": "Boone County Dog Park (4.6 stars from 272 reviews) is a popular destination for Burlington dog owners, located at 5550 Idlewild Rd. Dog owners frequent this park for its consistent quality and welcoming atmosphere. Local dog owners have clearly found this to be a worthwhile destination."
  },
  {
    "name": "Fort Campbell Dog Park",
    "street": "",
    "city": "Clarksville",
    "state": "KY",
    "zip": "",
    "latitude": 36.6231035,
    "longitude": -87.4744554,
    "description": "Dog owners in the Clarksville area will find Fort Campbell Dog Park—a local option for spending time with their pups. Open from 6am to 6pm daily, the park fits conveniently into different routines. Dog owners new to the area may find the visitor reviews useful for learning about this park."
  },
  {
    "name": "The Bark Park",
    "street": "7544 Burlington Pike",
    "city": "Florence",
    "state": "KY",
    "zip": "41042",
    "latitude": 39.0006376,
    "longitude": -84.6404271,
    "description": "Florence dog owners rate The Bark Park at 7544 Burlington Pike highly, with 4.8 stars from 140 visits. The park serves dog owners well, providing a destination the community values. Based on the reviews, dog owners can expect a reliable spot for spending time with their pup."
  },
  {
    "name": "‍ Highland Hills Park",
    "street": "Mayfield Ave",
    "city": "Fort Thomas",
    "state": "KY",
    "zip": "41075",
    "latitude": 39.0786916,
    "longitude": -84.4517444,
    "description": "Highland Hills Park holds a 4.4-star rating from 278 Fort Thomas dog owner visits. Open from 6am to 10:30pm daily, dog owners have flexibility to plan a visit with their four-legged friends. Looking to explore more? Fort Thomas Dog Park is another dog-friendly park 0.0 miles from here."
  },
  {
    "name": "‍ Fort Thomas Dog Park",
    "street": "199 Mayfield Ave",
    "city": "Fort Thomas",
    "state": "KY",
    "zip": "41075",
    "latitude": 39.0786916,
    "longitude": -84.4517444,
    "description": "Fort Thomas Dog Park at 199 Mayfield Ave holds a 4.3-star rating from 184 Fort Thomas dog owner visits. Open from 7am to 9pm daily, local dog owners have time to explore with their furry companions. More dog parks in the area include Highland Hills Park (0.0 miles) and CRC Kellogg Avenue Park (1.6 miles)—great options for mixing up your pup's routine."
  },
  {
    "name": "‍ Community Bark Park",
    "street": "Burchwood Ct",
    "city": "‍ Henderson",
    "state": "KY",
    "zip": "42420",
    "latitude": 37.8146398,
    "longitude": -87.5825021,
    "description": "Dog owners in Henderson have rated Community Bark Park 4.4 stars across 98 reviews. Open from 6am to 10pm daily, dog owners in the area can work a visit into their day. Reading what other dog owners have experienced here can help with planning a visit."
  },
  {
    "name": "Veterans Park",
    "street": "650 Southpoint Dr",
    "city": "‍ Lexington",
    "state": "KY",
    "zip": "40515",
    "latitude": 37.9539013,
    "longitude": -84.5034626,
    "description": "With 4.7 stars from 875 reviews, Veterans Park at 650 Southpoint Dr has become a favorite among Lexington dog owners. Open from 8am to 8pm daily, there's room in the day for dog owners to bring their furry friends. Looking for more places to take your pup? Southpoint Park is another popular dog park just 1.2 miles away."
  },
  {
    "name": "Jacobson Park",
    "street": "4001 Athens Boonesboro Rd",
    "city": "‍ Lexington",
    "state": "KY",
    "zip": "40509",
    "latitude": 37.98533,
    "longitude": -84.4253239,
    "description": "For dog owners in the Lexington area, Jacobson Park (4001 Athens Boonesboro Rd) offers a 4.7-star experience based on 380 reviews. The steady stream of dog owner visits speaks to the park's appeal. Other dog parks in the area include Pleasant Ridge Dog Park (2.1 miles) and Ecton Park (4.1 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Gratz Park",
    "street": "250 W 3rd St",
    "city": "‍ Lexington",
    "state": "KY",
    "zip": "40507",
    "latitude": 38.0506551,
    "longitude": -84.4939414,
    "description": "Lexington dog owners rate Gratz Park at 250 W 3rd St highly, with 4.7 stars from 357 visits. Dog owners frequent this park for its consistent quality and welcoming atmosphere. Other dog parks in the area include Phoenix Park (0.3 miles) and Kenwick Park (1.5 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "‍ Shillito Park",
    "street": "3301 Brunswick Rd",
    "city": "‍ Lexington",
    "state": "KY",
    "zip": "40503",
    "latitude": 37.983792,
    "longitude": -84.534343,
    "description": "Shillito Park (4.7 stars from 295 reviews) is a popular destination for Lexington dog owners, located at 3301 Brunswick Rd. Open from 8am to 8:30pm daily, dog owners can easily fit a visit into busy schedules. For variety, the neighborhood offers more dog parks to explore: Shillito Park (0.7 miles) and Meadowbrook Park (0.8 miles)."
  },
  {
    "name": "Elizabeth Street Park",
    "street": "1521 Elizabeth St",
    "city": "‍ Lexington",
    "state": "KY",
    "zip": "40503",
    "latitude": 38.0258792,
    "longitude": -84.5146923,
    "description": "Lexington dog owners rate Elizabeth Street Park at 1521 Elizabeth St highly, with 5.0 stars from 9 visits. The park has earned its reputation among dog owners in the neighborhood as a reliable choice. More dog-friendly parks nearby include Hill N Dale Park (1.2 miles) and Ecton Park (1.5 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Legacy Dog Park",
    "street": "1115 McCann Dr",
    "city": "‍ Lexington",
    "state": "KY",
    "zip": "40391",
    "latitude": 38.0023328,
    "longitude": -84.1956689,
    "description": "For dog owners in the Lexington area, Legacy Dog Park (1115 McCann Dr) offers a 4.7-star experience based on 52 reviews. The park serves dog owners well, providing a destination the community values. The positive feedback from local dog owners speaks to the park's consistent quality."
  },
  {
    "name": "Great Crossing Park",
    "street": "135 Betsy Wy",
    "city": "‍ Lexington",
    "state": "KY",
    "zip": "40324",
    "latitude": 38.2163925,
    "longitude": -84.6023672,
    "description": "Dog owners in Lexington have made Great Crossing Park at 135 Betsy Wy a go-to spot, rating it 4.7 stars across 49 reviews. Open from 6am to 11pm daily, dog owners can easily fit a visit into busy schedules. For a change of scenery, Scott County Dog Park is another dog-friendly destination 2.0 miles from here."
  },
  {
    "name": "Dogwood Park",
    "street": "2389 Dogwood Trace Blvd",
    "city": "‍ Lexington",
    "state": "KY",
    "zip": "40514",
    "latitude": 37.9867598,
    "longitude": -84.5818888,
    "description": "Dogwood Park at 2389 Dogwood Trace Blvd is well-regarded by Lexington dog owners, holding 4.7 stars across 30 reviews. The steady stream of dog owner visits speaks to the park's appeal. Dog owners exploring the neighborhood can also bring their furry friends to Higbee Mill Park (1.0 miles)."
  },
  {
    "name": "Hammond Creek Dog Park",
    "street": "1000 County Park Rd",
    "city": "‍ Lexington",
    "state": "KY",
    "zip": "40342",
    "latitude": 38.0392543,
    "longitude": -84.9088187,
    "description": "Hammond Creek Dog Park at 1000 County Park Rd is well-regarded by Lexington dog owners, holding 4.7 stars across 27 reviews. Dog owners in the area consistently choose this park as a go-to destination for their pups. Dog owners looking for a dependable spot will find this park lives up to its ratings."
  },
  {
    "name": "Masterson Station Park",
    "street": "3051 Leestown Rd",
    "city": "‍ Lexington",
    "state": "KY",
    "zip": "40511",
    "latitude": 38.0903105,
    "longitude": -84.5581428,
    "description": "At 3051 Leestown Rd in Lexington, Masterson Station Park stands out with 4.6 stars from 1,811 happy dog owners. Dog owners in the area know they can count on this park for quality time with their pups. For more dog park adventures, explore Masterson Hills Park (0.7 miles) or Wolf Run Park (3.3 miles) with your furry companion."
  },
  {
    "name": "Shillito Park",
    "street": "300 W Reynolds Rd",
    "city": "‍ Lexington",
    "state": "KY",
    "zip": "40503",
    "latitude": 37.993327,
    "longitude": -84.530493,
    "description": "With 4.6 stars across 1,346 reviews, Shillito Park at 300 W Reynolds Rd has clearly won over Lexington dog owners. Open from 8am to 8pm daily, the park is convenient for before work, after work, or weekend adventures. Keep the adventure going at other nearby dog parks like Shillito Park (0.7 miles) or Meadowbrook Park (1.1 miles)."
  },
  {
    "name": "‍ Ecton Park",
    "street": "956 Turkey Foot Rd",
    "city": "‍ Lexington",
    "state": "KY",
    "zip": "40502",
    "latitude": 38.0158082,
    "longitude": -84.4895408,
    "description": "Ecton Park at 956 Turkey Foot Rd is well-regarded by Lexington dog owners, holding 4.6 stars across 115 reviews. Open from 9am to 9pm daily, there's room in the day for dog owners to bring their furry friends. Dog owners exploring the neighborhood can also bring their furry friends to Elizabeth Street Park (1.5 miles)."
  },
  {
    "name": "Southpoint Park",
    "street": "4496 Graves Dr",
    "city": "‍ Lexington",
    "state": "KY",
    "zip": "40515",
    "latitude": 37.960329,
    "longitude": -84.5233504,
    "description": "Southpoint Park (4.6 stars from 47 reviews) is a popular destination for Lexington dog owners, located at 4496 Graves Dr. Dog owners frequent this park for its consistent quality and welcoming atmosphere. Dog owners exploring the neighborhood can also bring their furry friends to Veterans Park (1.2 miles)."
  },
  {
    "name": "‍ Woodford County Dog Park",
    "street": "",
    "city": "‍ Lexington",
    "state": "KY",
    "zip": "",
    "latitude": 38.052576,
    "longitude": -84.7299464,
    "description": "Lexington dog owners rate Woodford County Dog Park highly, with 4.5 stars from 34 visits. The park serves dog owners well, providing a destination the community values. Based on the reviews, dog owners can expect a reliable spot for spending time with their pup."
  },
  {
    "name": "‍ Coldstream Dog Park",
    "street": "1850 Pisacano Dr",
    "city": "‍ Lexington",
    "state": "KY",
    "zip": "40511",
    "latitude": 38.0976443,
    "longitude": -84.4882998,
    "description": "At 1850 Pisacano Dr in Lexington, Coldstream Dog Park has built a loyal following—4.5 stars from 173 dog owner reviews. Dog owners in the area consistently choose this park as a go-to destination for their pups. Looking for more places to take your pup? Masterson Hills Park is another popular dog park just 3.2 miles away."
  },
  {
    "name": "‍ Harrods Hill Park",
    "street": "3308 Ridgecane Rd",
    "city": "‍ Lexington",
    "state": "KY",
    "zip": "40513",
    "latitude": 38.0177431,
    "longitude": -84.5649296,
    "description": "Harrods Hill Park at 3308 Ridgecane Rd is well-regarded by Lexington dog owners, holding 4.5 stars across 202 reviews. The park has earned its reputation among dog owners in the neighborhood as a reliable choice. Dog owners can also take their pups to nearby Wolf Run Park (1.9 miles) or Hill N Dale Park (2.0 miles)."
  },
  {
    "name": "Cherokee Park",
    "street": "745 Cochran Hill Rd",
    "city": "Louisville",
    "state": "KY",
    "zip": "40206",
    "latitude": 38.2433289,
    "longitude": -85.694497,
    "description": "Cherokee Park at 745 Cochran Hill Rd is a favorite among Louisville dog owners, earning 4.8 stars from 3,341 reviews. Open from 6am to 11pm daily, the park is convenient for before work, after work, or weekend adventures. Dog owners in the area also love bringing their pups to Cochran Hill Dog Run (Members (0.1 miles) and PG&J's Dog Park (1.8 miles)."
  },
  {
    "name": "Beckley Creek Park",
    "street": "1411 Beckley Creek Pkwy",
    "city": "Louisville",
    "state": "KY",
    "zip": "40245",
    "latitude": 38.2172911,
    "longitude": -85.4768666,
    "description": "With 4.8 stars across 2,768 reviews, Beckley Creek Park at 1411 Beckley Creek Pkwy has clearly won over Louisville dog owners. Open from 6am to 9pm daily, dog owners have plenty of flexibility to visit when it suits their schedule. Want to give your pup even more adventure? The Parklands of Floyds Fork is another beloved dog park just 0.2 miles away."
  },
  {
    "name": "The Parklands of Floyds Fork",
    "street": "Beckley Creek Pkwy",
    "city": "Louisville",
    "state": "KY",
    "zip": "40245",
    "latitude": 38.2196129,
    "longitude": -85.4746262,
    "description": "The Parklands of Floyds Fork (4.8 stars from 627 reviews) is a popular destination for Louisville dog owners. Open from 7am to 9:30pm daily, there's plenty of opportunity for dog owners to find a time that works. Dog owners exploring the neighborhood can also bring their furry friends to Beckley Creek Park (0.2 miles)."
  },
  {
    "name": "PG&J's Dog Park",
    "street": "800 Baxter Ave",
    "city": "Louisville",
    "state": "KY",
    "zip": "40204",
    "latitude": 38.242952,
    "longitude": -85.7270067,
    "description": "Located at 800 Baxter Ave in Louisville, PG&J's Dog Park earns strong marks from local dog owners—4.8 stars from 327 reviews. The park serves dog owners well, providing a destination the community values. Looking for more places to take your pup? Morton Avenue Dog Park is another popular dog park just 0.2 miles away."
  },
  {
    "name": "Pee Wee Park",
    "street": "2913 Klondike Ln",
    "city": "Louisville",
    "state": "KY",
    "zip": "40218",
    "latitude": 38.2042428,
    "longitude": -85.6372348,
    "description": "Located at 2913 Klondike Ln in Louisville, Pee Wee Park earns strong marks from local dog owners—4.8 stars from 24 reviews. Open from 6am to 5pm daily, dog owners can easily fit a visit into busy schedules. Other dog parks in the area include Cherokee Park (4.1 miles) and Cochran Hill Dog Run (Members (4.2 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Waterfront Park",
    "street": "129 River Rd",
    "city": "Louisville",
    "state": "KY",
    "zip": "40202",
    "latitude": 38.2595011,
    "longitude": -85.7505892,
    "description": "Waterfront Park at 129 River Rd has become essential for Louisville dog owners, earning 4.7 stars from 6,549 visitors. Open from 6am to 11pm daily, the park accommodates everything from early morning walks to evening adventures. Dog owners in this area are lucky to have more great dog parks nearby: E.P. Tom Sawyer Park (0.6 miles) and PG&J's Dog Park (1.7 miles)."
  },
  {
    "name": "Club K9 Dog Park",
    "street": "9316 Taylorsville Rd",
    "city": "Louisville",
    "state": "KY",
    "zip": "40299",
    "latitude": 38.1870112,
    "longitude": -85.5240907,
    "description": "Dog owners in Louisville have made Club K9 Dog Park at 9316 Taylorsville Rd a go-to spot, rating it 4.7 stars across 158 reviews. For dog owners in the area, this park has become a trusted spot for time with their pups. Looking for more places to take your pup? Charlie Vettiner Park is another popular dog park just 2.2 miles away."
  },
  {
    "name": "Champions Dog Run (Members",
    "street": "2700 River Rd",
    "city": "Louisville",
    "state": "KY",
    "zip": "40206",
    "latitude": 38.273041,
    "longitude": -85.706108,
    "description": "Champions Dog Run (Members at 2700 River Rd is well-regarded by Louisville dog owners, holding 4.5 stars across 8 reviews. The park has earned its reputation among dog owners in the neighborhood as a reliable choice. Looking for more places to take your pup? Louisville Champions Park is another popular dog park just 0.5 miles away."
  },
  {
    "name": "E.P. Tom Sawyer Park",
    "street": "",
    "city": "Louisville",
    "state": "KY",
    "zip": "",
    "latitude": 38.2542376,
    "longitude": -85.759407,
    "description": "In Louisville, E.P. Tom Sawyer Park earns strong marks from local dog owners—4.6 stars from 107 reviews. Dog owners looking for a solid destination will find this park delivers. Looking for more places to take your pup? Waterfront Park is another popular dog park just 0.6 miles away."
  },
  {
    "name": "Morton Avenue Dog Park",
    "street": "1548 Morton Ave",
    "city": "Louisville",
    "state": "KY",
    "zip": "40204",
    "latitude": 38.24031,
    "longitude": -85.7272885,
    "description": "For dog owners in the Louisville area, Morton Avenue Dog Park (1548 Morton Ave) offers a 4.6-star experience based on 409 reviews. Open from 7am to 9pm daily, the park offers flexibility for dog owners with varying routines. More dog-friendly parks nearby include Patterson Playground (0.0 miles) and PG&J's Dog Park (0.2 miles)—perfect for pups who love adventure."
  },
  {
    "name": "E.P. Tom Sawyer State Park",
    "street": "3000 Freys Hill Rd",
    "city": "Louisville",
    "state": "KY",
    "zip": "40241",
    "latitude": 38.2862661,
    "longitude": -85.5582275,
    "description": "Local dog owners love E.P. Tom Sawyer State Park at 3000 Freys Hill Rd in Louisville—4.6 stars from an impressive 2,422 reviews. Open from 7:30am to 10pm daily, the park is convenient for before work, after work, or weekend adventures. For variety, many dog owners also bring their furry friends to Tom Sawyer Dog Park (0.3 miles)—another great dog park in the area."
  },
  {
    "name": "Patterson Playground",
    "street": "1418 Morton Ave",
    "city": "Louisville",
    "state": "KY",
    "zip": "40204",
    "latitude": 38.2401019,
    "longitude": -85.7273355,
    "description": "Patterson Playground at 1418 Morton Ave holds a 4.4-star rating from 27 Louisville dog owner visits. Dog owners looking for a local destination will find this park accessible. Nearby dog parks worth exploring with your pup include Morton Avenue Dog Park (0.0 miles) and PG&J's Dog Park (0.2 miles)."
  },
  {
    "name": "‍ Cochran Hill Dog Run (Members",
    "street": "740 Cochran Hill Rd",
    "city": "Louisville",
    "state": "KY",
    "zip": "40206",
    "latitude": 38.244204,
    "longitude": -85.6953512,
    "description": "Cochran Hill Dog Run (Members (4.5 stars from 265 reviews) is a popular destination for Louisville dog owners, located at 740 Cochran Hill Rd. The steady stream of dog owner visits speaks to the park's appeal. Dog owners exploring the neighborhood can also bring their furry friends to Cherokee Park (0.1 miles)."
  },
  {
    "name": "Louisville Champions Park",
    "street": "2050 River Rd",
    "city": "Louisville",
    "state": "KY",
    "zip": "40206",
    "latitude": 38.2692604,
    "longitude": -85.7134611,
    "description": "Louisville Champions Park at 2050 River Rd is well-regarded by Louisville dog owners, holding 4.5 stars across 796 reviews. Open from 6am to 11pm daily, there's plenty of opportunity for dog owners to find a time that works. For a change of scenery, Champions Dog Run (Members is another dog-friendly destination 0.5 miles from here."
  },
  {
    "name": "Waverly Park",
    "street": "4800 Waverly Park Rd",
    "city": "Louisville",
    "state": "KY",
    "zip": "40214",
    "latitude": 38.1337627,
    "longitude": -85.8230024,
    "description": "At 4800 Waverly Park Rd in Louisville, Waverly Park stands out with 4.5 stars from 1,320 happy dog owners. Dog owners in the area know they can count on this park for quality time with their pups. Looking to mix things up? Waverly Dog Run is a nearby dog park 0.1 miles away that's worth exploring with your pup."
  },
  {
    "name": "Charlie Vettiner Park",
    "street": "5550 Charlie Vettiner Park Rd",
    "city": "Louisville",
    "state": "KY",
    "zip": "40299",
    "latitude": 38.1713029,
    "longitude": -85.5582697,
    "description": "Dog owners in Louisville have made Charlie Vettiner Park at 5550 Charlie Vettiner Park Rd a go-to spot, rating it 4.4 stars across 914 reviews. Open from 6am to 11pm daily, the park accommodates early risers and evening visitors alike. More dog-friendly parks nearby include Vettiner Dog Park (0.2 miles) and Club K9 Dog Park (2.2 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Newport Dog Park",
    "street": "901 E 6th St",
    "city": "Newport",
    "state": "KY",
    "zip": "41071",
    "latitude": 39.096783,
    "longitude": -84.4854318,
    "description": "At 901 E 6th St in Newport, Newport Dog Park has built a loyal following—4.6 stars from 308 dog owner reviews. Open from 6am to 8pm daily, dog owners have plenty of flexibility to plan a visit. Nearby, T. M. Berry International (0.8 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Smothers Park",
    "street": "199 W Veterans Blvd",
    "city": "‍ Owensboro",
    "state": "KY",
    "zip": "42303",
    "latitude": 37.7758532,
    "longitude": -87.1136434,
    "description": "At 199 W Veterans Blvd in Owensboro, Smothers Park stands out with 4.8 stars from 3,574 happy dog owners. Open from 7am to 10pm daily, dog owners can plan visits around their pup's favorite times to be active. Nearby, Germantown Park (0.6 miles) is another dog park favorite where you can take your four-legged friend."
  },
  {
    "name": "Horse Fork Creek Park",
    "street": "3005 Fairview Dr",
    "city": "‍ Owensboro",
    "state": "KY",
    "zip": "42303",
    "latitude": 37.7477642,
    "longitude": -87.0610401,
    "description": "For dog owners in the Owensboro area, Horse Fork Creek Park (3005 Fairview Dr) offers a 4.7-star experience based on 226 reviews. Open from 8am to 7pm daily, dog owners have plenty of flexibility to plan a visit. For variety, the neighborhood offers more dog parks to explore: Chautauqua Park (2.1 miles) and Legion Park (2.5 miles)."
  },
  {
    "name": "‍ Jack C. Fisher Park",
    "street": "3900 W 5th Street Rd",
    "city": "‍ Owensboro",
    "state": "KY",
    "zip": "42301",
    "latitude": 37.7689614,
    "longitude": -87.141653,
    "description": "Owensboro dog owners rate Jack C. Fisher Park at 3900 W 5th Street Rd highly, with 4.5 stars from 318 visits. Open from 5am to 10pm daily, dog owners have plenty of flexibility to plan a visit. Dog owners can also take their pups to nearby Thompson-Berry Park (0.5 miles) or Daviess County Animal Care (0.8 miles)."
  },
  {
    "name": "Legion Park",
    "street": "3047 Legion Park Dr",
    "city": "‍ Owensboro",
    "state": "KY",
    "zip": "42303",
    "latitude": 37.7424358,
    "longitude": -87.1061079,
    "description": "Local dog owners love Legion Park at 3047 Legion Park Dr in Owensboro—4.5 stars from an impressive 1,233 reviews. Open from 5am to 10pm daily, dog owners have room to work around busy schedules. Keep the adventure going at other nearby dog parks like Cap Gardner Park (1.0 miles) or Chautauqua Park (1.7 miles)."
  },
  {
    "name": "Waymond Morris Park",
    "street": "5200 Todd Bridge Rd",
    "city": "‍ Owensboro",
    "state": "KY",
    "zip": "42301",
    "latitude": 37.7165505,
    "longitude": -87.145135,
    "description": "Located at 5200 Todd Bridge Rd, Waymond Morris Park in Owensboro is rated 4.4 stars by 220 dog owners. Open from 5am to 10pm daily, local dog owners have time to explore with their furry companions. For pups who want more adventure, York Park is a nearby dog park worth visiting (2.7 miles)."
  },
  {
    "name": "Owensboro Moreland Park",
    "street": "1215 Hickman Ave",
    "city": "‍ Owensboro",
    "state": "KY",
    "zip": "42301",
    "latitude": 37.7626973,
    "longitude": -87.126199,
    "description": "Owensboro Moreland Park at 1215 Hickman Ave is well-regarded by Owensboro dog owners, holding 4.4 stars across 535 reviews. The park serves dog owners well, providing a destination the community values. Looking for more places to take your pup? York Park is another popular dog park just 0.8 miles away."
  },
  {
    "name": "York Park",
    "street": "York Dr",
    "city": "‍ Owensboro",
    "state": "KY",
    "zip": "42301",
    "latitude": 37.7547444,
    "longitude": -87.1380016,
    "description": "For dog owners in Owensboro, York Park has a 4.3-star rating (82 reviews). Local dog owners use this park as a spot to spend time with their furry companions. For pups who want more adventure, Daviess County Animal Care is a nearby dog park worth visiting (0.4 miles)."
  },
  {
    "name": "Cap Gardner Park",
    "street": "238 E 20th St",
    "city": "‍ Owensboro",
    "state": "KY",
    "zip": "42303",
    "latitude": 37.7565739,
    "longitude": -87.1079966,
    "description": "At 238 E 20th St in Owensboro, Cap Gardner Park carries 4.3 stars from 103 dog owner reviews. Open from 5am to 9pm daily, the park gives dog owners in the neighborhood time to bring their pups. For dog owners who like to explore, Germantown Park (0.8 miles) and Chautauqua Park (1.0 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "Chautauqua Park",
    "street": "1301 Bluff Ave",
    "city": "‍ Owensboro",
    "state": "KY",
    "zip": "42303",
    "latitude": 37.764328,
    "longitude": -87.093224,
    "description": "Dog owners in Owensboro have rated Chautauqua Park (1301 Bluff Ave) 4.3 stars across 403 reviews. Open from 5am to 10pm daily, dog owners can stop by when it fits their schedule. For pups who want more adventure, Germantown Park is a nearby dog park worth visiting (0.8 miles)."
  },
  {
    "name": "‍ English Park",
    "street": "2 Woodford Ave",
    "city": "‍ Owensboro",
    "state": "KY",
    "zip": "42303",
    "latitude": 37.777296,
    "longitude": -87.127911,
    "description": "With 4.3 stars from 667 reviews, English Park at 2 Woodford Ave has become a favorite among Owensboro dog owners. Open from 5am to 10pm daily, there's plenty of opportunity for dog owners to find a time that works. Looking for more places to take your pup? Smothers Park is another popular dog park just 0.8 miles away."
  },
  {
    "name": "Thompson-Berry Park",
    "street": "1 Carter Rd",
    "city": "‍ Owensboro",
    "state": "KY",
    "zip": "42301",
    "latitude": 37.773766,
    "longitude": -87.148067,
    "description": "At 1 Carter Rd in Owensboro, Thompson-Berry Park carries 4.2 stars from 170 dog owner reviews. Open from 5am to 10pm, Monday through Saturday, dog owners in the area can work a visit into their day. For dog owners who like to explore, Jack C. Fisher Park (0.5 miles) and Daviess County Animal Care (1.1 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "Germantown Park",
    "street": "824 Crittenden St",
    "city": "‍ Owensboro",
    "state": "KY",
    "zip": "42303",
    "latitude": 37.7684516,
    "longitude": -87.1072627,
    "description": "At 824 Crittenden St, Germantown Park has 4.1 stars based on 82 reviews from Owensboro dog owners. Open from 5am to 9pm daily, local dog owners have time to explore with their furry companions. More dog parks in the area include Smothers Park (0.6 miles) and Chautauqua Park (0.8 miles)—great options for mixing up your pup's routine."
  },
  {
    "name": "Daviess County Animal Care",
    "street": "2620 KY-81",
    "city": "‍ Owensboro",
    "state": "KY",
    "zip": "42301",
    "latitude": 37.7576953,
    "longitude": -87.1447437,
    "description": "Located at 2620 KY-81, Daviess County Animal Care offers Owensboro dog owners a neighborhood destination for their four-legged friends. For dog owners in the neighborhood, this park offers a place to take their pups. For pups who want more adventure, York Park is a nearby dog park worth visiting (0.4 miles)."
  }
]