[
  {
    "name": "Pooch Playland",
    "street": "",
    "city": "Alexandria",
    "state": "MN",
    "zip": "",
    "latitude": 45.8835101,
    "longitude": -95.3745015,
    "description": "For dog owners in Alexandria, Pooch Playland has a 4.3-star rating (85 reviews). Open from 8am to 9:30pm daily, local dog owners have time to explore with their furry companions. Checking recent reviews can help dog owners decide if this park fits their needs."
  },
  {
    "name": "Delaney Park",
    "street": "147th St W",
    "city": "Apple Valley",
    "state": "MN",
    "zip": "55124",
    "latitude": 44.7353791,
    "longitude": -93.206787,
    "description": "Dog owners in Apple Valley have made Delaney Park at 147th St W a go-to spot, rating it 4.6 stars across 33 reviews. Open from 6am to 10pm daily, dog owners have plenty of flexibility to plan a visit. Other dog parks in the area include Galaxie Park (0.6 miles) and Regatta Park (1.1 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Galaxie Park",
    "street": "",
    "city": "Apple Valley",
    "state": "MN",
    "zip": "",
    "latitude": 44.7319094,
    "longitude": -93.21772,
    "description": "Apple Valley dog owners rate Galaxie Park highly, with 4.5 stars from 78 visits. Open from 8am to 10pm daily, dog owners have plenty of flexibility to plan a visit. For variety, the neighborhood offers more dog parks to explore: Delaney Park (0.6 miles) and Newell Park (0.6 miles)."
  },
  {
    "name": "Newell Park",
    "street": "794 Newell Dr",
    "city": "Apple Valley",
    "state": "MN",
    "zip": "55124",
    "latitude": 44.7250098,
    "longitude": -93.2252596,
    "description": "Dog owners in Apple Valley have made Newell Park at 794 Newell Dr a go-to spot, rating it 4.5 stars across 22 reviews. Open from 6am to 10pm daily, there's plenty of opportunity for dog owners to find a time that works. Looking for more places to take your pup? Galaxie Park is another popular dog park just 0.6 miles away."
  },
  {
    "name": "Greenleaf Park",
    "street": "135th St W",
    "city": "Apple Valley",
    "state": "MN",
    "zip": "55124",
    "latitude": 44.7532221,
    "longitude": -93.204957,
    "description": "Apple Valley dog owners rate Greenleaf Park at 135th St W highly, with 4.5 stars from 6 visits. Open from 6am to 10pm daily, the park works well for dog owners with different schedules. Other dog parks in the area include Delaney Park (1.2 miles) and Galaxie Park (1.6 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Huntington Park",
    "street": "12960 Diamond Path",
    "city": "Apple Valley",
    "state": "MN",
    "zip": "55124",
    "latitude": 44.7620081,
    "longitude": -93.1650296,
    "description": "Dog owners in Apple Valley have rated Huntington Park (12960 Diamond Path) 4.4 stars across 37 reviews. Open from 6am to 10pm daily, dog owners in the area can work a visit into their day. Dog owners in the neighborhood can also take their furry friends to Greenleaf Park, 2.1 miles away."
  },
  {
    "name": "Regatta Park",
    "street": "15593 Fjord Ave",
    "city": "Apple Valley",
    "state": "MN",
    "zip": "55124",
    "latitude": 44.723293,
    "longitude": -93.1931267,
    "description": "Dog owners in Apple Valley have rated Regatta Park (15593 Fjord Ave) 4.3 stars across 30 reviews. Open from 6am to 10pm daily, the park fits conveniently into different routines. For dog owners who like to explore, Delaney Park (1.1 miles) and Galaxie Park (1.3 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "Rice Creek North Regional",
    "street": "",
    "city": "Blaine",
    "state": "MN",
    "zip": "",
    "latitude": 45.144882,
    "longitude": -93.1553635,
    "description": "Dog owners in Blaine have made Rice Creek North Regional a go-to spot, rating it 4.7 stars across 701 reviews. Open from 5am to 10pm daily, dog owners have plenty of flexibility to plan a visit. Dog owners exploring the neighborhood can also bring their furry friends to Rice Creek Off-Leash Dog Area (1.8 miles)."
  },
  {
    "name": "Tom Ryan Park",
    "street": "10802 Town Square Dr NE",
    "city": "Blaine",
    "state": "MN",
    "zip": "55449",
    "latitude": 45.1654891,
    "longitude": -93.2118718,
    "description": "At 10802 Town Square Dr NE in Blaine, Tom Ryan Park has built a loyal following—4.7 stars from 88 dog owner reviews. For dog owners in the area, this park has become a trusted spot for time with their pups. For a change of scenery, The Commons Park is another dog-friendly destination 1.0 miles from here."
  },
  {
    "name": "Tree's Edge Park",
    "street": "1731 113th Ln NE",
    "city": "Blaine",
    "state": "MN",
    "zip": "55449",
    "latitude": 45.1755409,
    "longitude": -93.2261862,
    "description": "With 4.7 stars from 23 reviews, Tree's Edge Park at 1731 113th Ln NE has become a favorite among Blaine dog owners. Open from 6am to 10pm daily, the park offers flexibility for dog owners with varying routines. Dog owners can also take their pups to nearby The Commons Park (0.1 miles) or Tom Ryan Park (1.0 miles)."
  },
  {
    "name": "Swanson Dog Park",
    "street": "9150 Central Ave NE",
    "city": "Blaine",
    "state": "MN",
    "zip": "55434",
    "latitude": 45.1378565,
    "longitude": -93.2356234,
    "description": "Located at 9150 Central Ave NE in Blaine, Swanson Dog Park earns strong marks from local dog owners—4.6 stars from 222 reviews. Open from 5am to 10pm daily, the park works well for dog owners with different schedules. Dog owners exploring the neighborhood can also bring their furry friends to Aquatore Park (0.2 miles)."
  },
  {
    "name": "The Commons Park",
    "street": "1623 113th Ave NE",
    "city": "Blaine",
    "state": "MN",
    "zip": "55449",
    "latitude": 45.1748886,
    "longitude": -93.2269168,
    "description": "Located at 1623 113th Ave NE in Blaine, The Commons Park earns strong marks from local dog owners—4.7 stars from 9 reviews. Dog owners looking for a solid destination will find this park delivers. For variety, the neighborhood offers more dog parks to explore: Tree's Edge Park (0.1 miles) and Tom Ryan Park (1.0 miles)."
  },
  {
    "name": "Pioneer Park",
    "street": "2491 125th Ave NE",
    "city": "Blaine",
    "state": "MN",
    "zip": "55449",
    "latitude": 45.1972034,
    "longitude": -93.2079064,
    "description": "For dog owners in the Blaine area, Pioneer Park (2491 125th Ave NE) offers a 4.5-star experience based on 86 reviews. Open from 8am to 4:30pm weekdays, the park accommodates early risers and evening visitors alike. Dog owners exploring the neighborhood can also bring their furry friends to Quail Creek Park (0.7 miles)."
  },
  {
    "name": "Meadowbrook Park",
    "street": "Madison St NE",
    "city": "Blaine",
    "state": "MN",
    "zip": "55434",
    "latitude": 45.161044,
    "longitude": -93.2543552,
    "description": "Meadowbrook Park in Blaine is rated 4.4 stars by 13 dog owners. Open from 8am to 7pm daily, dog owners have flexibility to plan a visit with their four-legged friends. For dog owners who like to explore, Deacons Park (0.9 miles) and The Commons Park (1.6 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "Lochness Park",
    "street": "11121 Lexington Ave NE",
    "city": "Blaine",
    "state": "MN",
    "zip": "55449",
    "latitude": 45.1713923,
    "longitude": -93.1629097,
    "description": "At 11121 Lexington Ave NE in Blaine, Lochness Park has built a loyal following—4.5 stars from 297 dog owner reviews. Open from 8am to 10pm daily, the park works well for dog owners with different schedules. Other dog parks in the area include Rice Creek North Regional (1.9 miles) and Tom Ryan Park (2.4 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Aquatore Park",
    "street": "9191 Lincoln St NE",
    "city": "Blaine",
    "state": "MN",
    "zip": "55434",
    "latitude": 45.1389588,
    "longitude": -93.2391565,
    "description": "For dog owners in the Blaine area, Aquatore Park (9191 Lincoln St NE) offers a 4.5-star experience based on 581 reviews. Open from 5am to 10pm daily, dog owners have plenty of flexibility to plan a visit. More dog-friendly parks nearby include Swanson Dog Park (0.2 miles) and Deacons Park (1.5 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Quail Creek Park",
    "street": "2168 Quail Creek Pkwy NE",
    "city": "Blaine",
    "state": "MN",
    "zip": "55449",
    "latitude": 45.2058372,
    "longitude": -93.215632,
    "description": "At 2168 Quail Creek Pkwy NE, Quail Creek Park has 4.4 stars based on 43 reviews from Blaine dog owners. Open from 7am to 9pm daily, dog owners have flexibility to plan a visit with their four-legged friends. Nearby dog parks worth exploring with your pup include Pioneer Park (0.7 miles) and Tree's Edge Park (2.2 miles)."
  },
  {
    "name": "Happy Acres Park",
    "street": "11900 7th St NE",
    "city": "Blaine",
    "state": "MN",
    "zip": "55434",
    "latitude": 45.186549,
    "longitude": -93.259875,
    "description": "Located at 11900 7th St NE, Happy Acres Park in Blaine is rated 4.3 stars by 159 dog owners. Open from 5am to 10pm daily, local dog owners have time to explore with their furry companions. Dog owners might also enjoy Meadowbrook Park, another dog park just 1.8 miles away."
  },
  {
    "name": "Deacons Park",
    "street": "",
    "city": "Blaine",
    "state": "MN",
    "zip": "",
    "latitude": 45.1607987,
    "longitude": -93.2349489,
    "description": "Dog owners in Blaine have rated Deacons Park 4.1 stars across 47 reviews. Open from 5am to 9:30pm daily, dog owners have flexibility to plan a visit with their four-legged friends. More dog parks in the area include Meadowbrook Park (0.9 miles) and The Commons Park (1.0 miles)—great options for mixing up your pup's routine."
  },
  {
    "name": "Locke County Park",
    "street": "840 71st Ave NEFridley",
    "city": "‍ Brooklyn Park",
    "state": "MN",
    "zip": "55432",
    "latitude": 45.0966189,
    "longitude": -93.2570732,
    "description": "Locke County Park at 840 71st Ave NE is well-regarded by Brooklyn Park dog owners, holding 4.7 stars across 229 reviews. Open from 6am to 9pm daily, there's plenty of opportunity for dog owners to find a time that works. More dog-friendly parks nearby include Rice Creek Sniffspot - A Priva (0.5 miles) and Locke County Dog Park (0.8 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Northwoods Park",
    "street": "7600 107th Ave N",
    "city": "‍ Brooklyn Park",
    "state": "MN",
    "zip": "55445",
    "latitude": 45.1481933,
    "longitude": -93.3503452,
    "description": "Dog owners in Brooklyn Park have made Northwoods Park at 7600 107th Ave N a go-to spot, rating it 4.6 stars across 235 reviews. Open from 6am to 10pm daily, the park offers flexibility for dog owners with varying routines. Looking for more places to take your pup? Brookdale Park is another popular dog park just 3.7 miles away."
  },
  {
    "name": "Environmental Nature Area",
    "street": "10201 W River Rd",
    "city": "‍ Brooklyn Park",
    "state": "MN",
    "zip": "55444",
    "latitude": 45.1088384,
    "longitude": -93.2906558,
    "description": "At 10201 W River Rd, Environmental Nature Area has 4.3 stars based on 52 reviews from Brooklyn Park dog owners. Open from 6am to 10pm daily, dog owners in the area can work a visit into their day. For dog owners who like to explore, Locke County Dog Park (1.6 miles) and Locke County Park (1.8 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "‍ Sunset Pond",
    "street": "3350 Burnsville Pkwy W",
    "city": "Burnsville",
    "state": "MN",
    "zip": "55337",
    "latitude": 44.7491231,
    "longitude": -93.3203791,
    "description": "Dog owners in Burnsville have made Sunset Pond at 3350 Burnsville Pkwy W a go-to spot, rating it 4.7 stars across 371 reviews. Open from 5am to 10pm daily, there's plenty of opportunity for dog owners to find a time that works. Other dog parks in the area include Black Dog Preserve (2.4 miles) and Savage Dog Park (2.5 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "‍ Minnesota Riverfront Park",
    "street": "600 W Black Dog Rd",
    "city": "Burnsville",
    "state": "MN",
    "zip": "55337",
    "latitude": 44.8031873,
    "longitude": -93.2798495,
    "description": "Burnsville dog owners rate Minnesota Riverfront Park at 600 W Black Dog Rd highly, with 4.7 stars from 10 visits. Open from 5am to 10pm daily, the park accommodates early risers and evening visitors alike. Other dog parks in the area include BlackDog Park (1.6 miles) and Black Dog Preserve (2.5 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Alimagnet Park",
    "street": "1200 Alimagnet Pkwy",
    "city": "Burnsville",
    "state": "MN",
    "zip": "55337",
    "latitude": 44.7424869,
    "longitude": -93.2566437,
    "description": "Dog owners in Burnsville have made Alimagnet Park at 1200 Alimagnet Pkwy a go-to spot, rating it 4.5 stars across 45 reviews. Open from 5am to 10pm daily, there's room in the day for dog owners to bring their furry friends. Dog owners exploring the neighborhood can also bring their furry friends to Alimagnet Park (0.7 miles)."
  },
  {
    "name": "Black Dog Preserve",
    "street": "",
    "city": "Burnsville",
    "state": "MN",
    "zip": "",
    "latitude": 44.7670567,
    "longitude": -93.2773887,
    "description": "Dog owners in the Burnsville area will find Black Dog Preserve—a local option for spending time with their pups. Dog owners looking for a local destination will find this park accessible. For dog owners who like to explore, Alimagnet Park (2.0 miles) and Sunset Pond (2.4 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "BlackDog Park",
    "street": "10945 Territorial Dr",
    "city": "Burnsville",
    "state": "MN",
    "zip": "55337",
    "latitude": 44.8037664,
    "longitude": -93.2478661,
    "description": "At 10945 Territorial Dr in Burnsville, BlackDog Park carries 4.2 stars from 55 dog owner reviews. Open from 5am to 10pm daily, dog owners have a window to spend time with their pups. Nearby dog parks worth exploring with your pup include Minnesota Riverfront Park (1.6 miles) and Kettle Park (2.0 miles)."
  },
  {
    "name": "Jean Duluth Dog Park",
    "street": "3567 Riley Rd",
    "city": "Duluth",
    "state": "MN",
    "zip": "55803",
    "latitude": 46.8729254,
    "longitude": -92.0550467,
    "description": "With 4.7 stars from 198 reviews, Jean Duluth Dog Park at 3567 Riley Rd has become a favorite among Duluth dog owners. Open from 8am to 10pm daily, the park works well for dog owners with different schedules. The positive feedback from local dog owners speaks to the park's consistent quality."
  },
  {
    "name": "Haas Dog Park",
    "street": "800-898 101st Ave W",
    "city": "Duluth",
    "state": "MN",
    "zip": "55808",
    "latitude": 46.6707407,
    "longitude": -92.2275896,
    "description": "Dog owners in Duluth have made Haas Dog Park at 800-898 101st Ave W a go-to spot, rating it 4.5 stars across 47 reviews. Open from 7am to 10pm daily, dog owners have plenty of flexibility to plan a visit. Dog owners looking for a dependable spot will find this park lives up to its ratings."
  },
  {
    "name": "Keene Creek Dog Park",
    "street": "28 N 62nd Ave W",
    "city": "Duluth",
    "state": "MN",
    "zip": "55807",
    "latitude": 46.7344636,
    "longitude": -92.1759438,
    "description": "At 28 N 62nd Ave W in Duluth, Keene Creek Dog Park carries 4.2 stars from 33 dog owner reviews. Open from 6am to 10pm daily, dog owners in the area can work a visit into their day. For pups who want more adventure, Observation Park is a nearby dog park worth visiting (4.3 miles)."
  },
  {
    "name": "Observation Park",
    "street": "914 W 3rd St",
    "city": "Duluth",
    "state": "MN",
    "zip": "55806",
    "latitude": 46.7801222,
    "longitude": -92.112813,
    "description": "Located at 914 W 3rd St, Observation Park in Duluth is rated 4.3 stars by 158 dog owners. Open from 8am to 10pm daily, dog owners can stop by when it fits their schedule. Dog owners in the neighborhood can also take their furry friends to Keene Creek Dog Park, 4.3 miles away."
  },
  {
    "name": "Bridle Ridge Park",
    "street": "3990 Elrene Rd",
    "city": "Eagan",
    "state": "MN",
    "zip": "55123",
    "latitude": 44.8137052,
    "longitude": -93.1146014,
    "description": "Eagan dog owners rate Bridle Ridge Park at 3990 Elrene Rd highly, with 4.5 stars from 55 visits. Open from 6am to 11pm daily, dog owners can easily fit a visit into busy schedules. For variety, the neighborhood offers more dog parks to explore: Eagan Off Leash Dog Area (2.0 miles) and Thresher Fields Park (2.0 miles)."
  },
  {
    "name": "Thresher Fields Park",
    "street": "3220 Borchert Ln",
    "city": "Eagan",
    "state": "MN",
    "zip": "55121",
    "latitude": 44.8411103,
    "longitude": -93.1266523,
    "description": "For dog owners in Eagan, Thresher Fields Park at 3220 Borchert Ln has a 4.4-star rating (261 reviews). Open from 5am to 10pm daily, dog owners can stop by when it fits their schedule. Looking to explore more? Eagan Off Leash Dog Area is another dog-friendly park 0.0 miles from here."
  },
  {
    "name": "Eagan Off Leash Dog Area",
    "street": "3204 Borchert Ln",
    "city": "Eagan",
    "state": "MN",
    "zip": "55121",
    "latitude": 44.8411103,
    "longitude": -93.1266523,
    "description": "At 3204 Borchert Ln in Eagan, Eagan Off Leash Dog Area carries 4.3 stars from 7 dog owner reviews. Dog owners looking for a local destination will find this park accessible. For dog owners who like to explore, Thresher Fields Park (0.0 miles) and O'Leary Park (1.6 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "Berry Patch Park",
    "street": "4094 Blueberry Ln",
    "city": "Eagan",
    "state": "MN",
    "zip": "55123",
    "latitude": 44.8078038,
    "longitude": -93.1573181,
    "description": "Dog owners in Eagan have rated Berry Patch Park (4094 Blueberry Ln) 4.3 stars across 12 reviews. Open from 5am to 10pm daily, the park fits conveniently into different routines. Dog owners looking for variety can also visit O'Leary Park (1.5 miles) or Bridle Ridge Park (2.1 miles) with their four-legged friends."
  },
  {
    "name": "‍ Meadowlands Park",
    "street": "4380 Beaver Dam Rd",
    "city": "Eagan",
    "state": "MN",
    "zip": "55122",
    "latitude": 44.799783,
    "longitude": -93.2041566,
    "description": "At 4380 Beaver Dam Rd in Eagan, Meadowlands Park carries 4.3 stars from 58 dog owner reviews. Open from 5am to 10pm daily, dog owners in the area can work a visit into their day. Dog owners might also enjoy Kettle Park, another dog park just 0.4 miles away."
  },
  {
    "name": "Kettle Park",
    "street": "4700 Rahn Rd",
    "city": "Eagan",
    "state": "MN",
    "zip": "55122",
    "latitude": 44.8051125,
    "longitude": -93.2077211,
    "description": "Kettle Park at 4700 Rahn Rd in Eagan has 4.3 stars from 64 dog owner reviews. Open from 8am to 9pm daily, the park is accessible for dog owners in the area. More dog parks in the area include Meadowlands Park (0.4 miles) and BlackDog Park (2.0 miles)—great options for mixing up your pup's routine."
  },
  {
    "name": "O'Leary Park",
    "street": "3542 Widgeon Way",
    "city": "Eagan",
    "state": "MN",
    "zip": "55123",
    "latitude": 44.8287452,
    "longitude": -93.1543228,
    "description": "At 3542 Widgeon Way, O'Leary Park has 4.3 stars based on 88 reviews from Eagan dog owners. Open from 5am to 10pm daily, the park fits conveniently into different routines. Dog owners looking for variety can also visit Berry Patch Park (1.5 miles) or Eagan Off Leash Dog Area (1.6 miles) with their four-legged friends."
  },
  {
    "name": "Staring Lake Park",
    "street": "13800 Pioneer Trail",
    "city": "Eden Prairie",
    "state": "MN",
    "zip": "55347",
    "latitude": 44.8301081,
    "longitude": -93.4514122,
    "description": "Staring Lake Park at 13800 Pioneer Trail is well-regarded by Eden Prairie dog owners, holding 4.8 stars across 60 reviews. Open from 6am to 10pm daily, dog owners can plan visits around work or their pup's energy level. Other dog parks in the area include Nesbitt Preserve Park (2.0 miles) and Edenvale Park (3.1 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Edenvale Park",
    "street": "7200 Edenvale Blvd",
    "city": "Eden Prairie",
    "state": "MN",
    "zip": "55346",
    "latitude": 44.8728737,
    "longitude": -93.4697132,
    "description": "84 dog owners have reviewed Edenvale Park at 7200 Edenvale Blvd in Eden Prairie, averaging 4.3 stars. Open from 6am to 10pm daily, dog owners in the area can work a visit into their day. Looking to explore more? Bryant Lake Dog Park is another dog-friendly park 2.1 miles from here."
  },
  {
    "name": "Nesbitt Preserve Park",
    "street": "8641 Center Way",
    "city": "Eden Prairie",
    "state": "MN",
    "zip": "55344",
    "latitude": 44.8466388,
    "longitude": -93.4186283,
    "description": "Dog owners in Eden Prairie have rated Nesbitt Preserve Park (8641 Center Way) 4.3 stars across 114 reviews. Open from 6am to 10pm daily, the park gives dog owners in the neighborhood time to bring their pups. Dog owners in the neighborhood can also take their furry friends to Flying Cloud Dog Park, 1.9 miles away."
  },
  {
    "name": "Heights Park",
    "street": "5520 W 66th St",
    "city": "Edina",
    "state": "MN",
    "zip": "55439",
    "latitude": 44.8832646,
    "longitude": -93.3637173,
    "description": "Located at 5520 W 66th St in Edina, Heights Park earns strong marks from local dog owners—4.5 stars from 40 reviews. Open from 8am to 4:30pm weekdays, there's room in the day for dog owners to bring their furry friends. Other dog parks in the area include Van Valkenburg Park (1.9 miles) and Flying Cloud Dog Park (2.6 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "‍ Old Hickory Park",
    "street": "393 Red Apple Dr",
    "city": "La Crescent",
    "state": "MN",
    "zip": "55947",
    "latitude": 43.8450884,
    "longitude": -91.3088176,
    "description": "Old Hickory Park (4.7 stars from 108 reviews) is a popular destination for La Crescent dog owners, located at 393 Red Apple Dr. The park serves dog owners well, providing a destination the community values. For variety, the neighborhood offers more dog parks to explore: Pettibone Park (3.1 miles) and Riverside Park (3.4 miles)."
  },
  {
    "name": "Ritter Farm Park",
    "street": "19300 Ritter Pkwy Trail",
    "city": "Lakeville",
    "state": "MN",
    "zip": "55044",
    "latitude": 44.6730699,
    "longitude": -93.3000084,
    "description": "Ritter Farm Park at 19300 Ritter Pkwy Trail is well-regarded by Lakeville dog owners, holding 4.6 stars across 551 reviews. Open from 5am to 10pm daily, dog owners have plenty of flexibility to plan a visit. Dog owners exploring the neighborhood can also bring their furry friends to Ritter Farm Dog Park (0.2 miles)."
  },
  {
    "name": "Parkview Park",
    "street": "",
    "city": "Lakeville",
    "state": "MN",
    "zip": "",
    "latitude": 44.7391873,
    "longitude": -93.12611,
    "description": "Dog owners in Lakeville have made Parkview Park a go-to spot, rating it 4.6 stars across 22 reviews. Open from 6am to 10pm daily, dog owners can easily fit a visit into busy schedules. Dog owners can also take their pups to nearby Huntington Park (2.5 miles) or Brandtjen Farm Park (3.1 miles)."
  },
  {
    "name": "Lakeridge Park",
    "street": "19120 Jewel Path",
    "city": "Lakeville",
    "state": "MN",
    "zip": "55044",
    "latitude": 44.6723637,
    "longitude": -93.2772478,
    "description": "For dog owners in the Lakeville area, Lakeridge Park (19120 Jewel Path) offers a 4.5-star experience based on 11 reviews. Open from 6am to 10pm daily, dog owners can plan visits around work or their pup's energy level. For variety, the neighborhood offers more dog parks to explore: Ritter Farm Dog Park (1.0 miles) and Ritter Farm Park (1.1 miles)."
  },
  {
    "name": "Brandtjen Farm Park",
    "street": "Brandtjen Farm Dr",
    "city": "Lakeville",
    "state": "MN",
    "zip": "55044",
    "latitude": 44.7033727,
    "longitude": -93.1626602,
    "description": "In Lakeville, Brandtjen Farm Park earns strong marks from local dog owners—4.5 stars from 68 reviews. Open from 6am to 10pm daily, the park offers flexibility for dog owners with varying routines. Other dog parks in the area include Regatta Park (2.0 miles) and Parkview Park (3.1 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Apple Grove Park",
    "street": "15000 Hayes RdApple Valley",
    "city": "Lakeville",
    "state": "MN",
    "zip": "55124",
    "latitude": 44.73248,
    "longitude": -93.2320292,
    "description": "With 4.5 stars from 74 reviews, Apple Grove Park at 15000 Hayes Rd has become a favorite among Lakeville dog owners. Open from 5am to 10pm daily, dog owners can plan visits around work or their pup's energy level. Nearby, Newell Park (0.6 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Ritter Farm Dog Park",
    "street": "Ritter Trail",
    "city": "Lakeville",
    "state": "MN",
    "zip": "55044",
    "latitude": 44.6707487,
    "longitude": -93.2980445,
    "description": "With 4.5 stars from 83 reviews, Ritter Farm Dog Park has become a favorite among Lakeville dog owners. Dog owners looking for a solid destination will find this park delivers. Other dog parks in the area include Ritter Farm Park (0.2 miles) and Lakeridge Park (1.0 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Lions Park",
    "street": "20510 Hull Ave",
    "city": "Lakeville",
    "state": "MN",
    "zip": "55044",
    "latitude": 44.6521761,
    "longitude": -93.2464522,
    "description": "For dog owners in Lakeville, Lions Park at 20510 Hull Ave has a 4.1-star rating (14 reviews). Open from 6am to 10pm daily, dog owners have flexibility to plan a visit with their four-legged friends. Dog owners in the neighborhood can also take their furry friends to Lakeridge Park, 2.1 miles away."
  },
  {
    "name": "Savage Dog Park",
    "street": "12425 Xenwood AveSavage",
    "city": "Lakeville",
    "state": "MN",
    "zip": "55378",
    "latitude": 44.7781502,
    "longitude": -93.3520188,
    "description": "For dog owners in Lakeville, Savage Dog Park at 12425 Xenwood Ave has a 4.3-star rating (165 reviews). Open from 7am to 10pm daily, dog owners have a window to spend time with their pups. Dog owners looking for variety can also visit Sunset Pond (2.5 miles) or Black Dog Preserve (3.7 miles) with their four-legged friends."
  },
  {
    "name": "Elm Creek Park",
    "street": "12400 James Deane Pkwy",
    "city": "Maple Grove",
    "state": "MN",
    "zip": "55369",
    "latitude": 45.1381585,
    "longitude": -93.43792,
    "description": "Elm Creek Park at 12400 James Deane Pkwy in Maple Grove is a community favorite, with 4,176 dog owners giving it 4.7 stars. Open from 5am to 10pm daily, dog owners can easily fit a visit into their day, whether morning or evening. Looking to mix things up? Elm Creek Park is a nearby dog park 2.3 miles away that's worth exploring with your pup."
  },
  {
    "name": "Hidden Meadows Park",
    "street": "9100 Ranier Ln N",
    "city": "Maple Grove",
    "state": "MN",
    "zip": "55311",
    "latitude": 45.119879,
    "longitude": -93.509316,
    "description": "At 9100 Ranier Ln N, Hidden Meadows Park has 4.2 stars based on 57 reviews from Maple Grove dog owners. Open from 6am to 11pm daily, dog owners can stop by when it fits their schedule. Dog owners in the neighborhood can also take their furry friends to Fish Lake Regional Park, 3.6 miles away."
  },
  {
    "name": "Minnehaha Dog Park",
    "street": "5399 Minnehaha Park Dr S",
    "city": "‍ Minneapolis",
    "state": "MN",
    "zip": "55417",
    "latitude": 44.9036222,
    "longitude": -93.1942399,
    "description": "Dog owners in Minneapolis have embraced Minnehaha Dog Park (5399 Minnehaha Park Dr S) as a top destination—4.8 stars from 1,326 visits. Open from 6am to 10pm daily, dog owners have plenty of flexibility to visit when it suits their schedule. Dog owners in the area also love bringing their pups to Hidden Falls Regional Park (0.3 miles) and Minnehaha Regional Park (1.2 miles)."
  },
  {
    "name": "Andy's Bark Park",
    "street": "11664 Dale RdWoodbury",
    "city": "‍ Minneapolis",
    "state": "MN",
    "zip": "55129",
    "latitude": 44.8803931,
    "longitude": -92.8688504,
    "description": "Andy's Bark Park at 11664 Dale Rd is well-regarded by Minneapolis dog owners, holding 4.8 stars across 530 reviews. Open from 6am to 10pm daily, there's plenty of opportunity for dog owners to find a time that works. The positive feedback from local dog owners speaks to the park's consistent quality."
  },
  {
    "name": "‍ Battle Creek Dog Park",
    "street": "2350 Upper Afton RdMaplewood",
    "city": "‍ Minneapolis",
    "state": "MN",
    "zip": "55119",
    "latitude": 44.9410037,
    "longitude": -93.0029463,
    "description": "For dog owners in the Minneapolis area, Battle Creek Dog Park (2350 Upper Afton Rd) offers a 4.8-star experience based on 438 reviews. Open from 6am to 10pm daily, the park offers flexibility for dog owners with varying routines. More dog-friendly parks nearby include Battle Creek Regional Park (0.1 miles) and Lower Landing Park (2.5 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Indoor Zoomies indoor dog park",
    "street": "10924 Greenbrier RdMinnetonka",
    "city": "‍ Minneapolis",
    "state": "MN",
    "zip": "55305",
    "latitude": 44.9510578,
    "longitude": -93.418401,
    "description": "Dog owners in Minneapolis have made Indoor Zoomies indoor dog park at 10924 Greenbrier Rd a go-to spot, rating it 4.9 stars across 42 reviews. Dog owners looking for a solid destination will find this park delivers. For a change of scenery, Meadow Neighborhood Park is another dog-friendly destination 1.6 miles from here."
  },
  {
    "name": "Cleary Lake Dog Park",
    "street": "6246 190th St EPrior Lake",
    "city": "‍ Minneapolis",
    "state": "MN",
    "zip": "55372",
    "latitude": 44.675389,
    "longitude": -93.3937899,
    "description": "At 6246 190th St E in Minneapolis, Cleary Lake Dog Park has built a loyal following—4.8 stars from 256 dog owner reviews. Open from 5am to 10pm daily, dog owners have plenty of flexibility to plan a visit. Looking for more places to take your pup? Ritter Farm Park is another popular dog park just 4.6 miles away."
  },
  {
    "name": "Carver Park",
    "street": "7200 Park DrVictoria",
    "city": "‍ Minneapolis",
    "state": "MN",
    "zip": "55386",
    "latitude": 44.8705358,
    "longitude": -93.6488973,
    "description": "With 4.8 stars from 235 reviews, Carver Park at 7200 Park Dr has become a favorite among Minneapolis dog owners. Open from 5am to 10pm daily, the park offers flexibility for dog owners with varying routines. Dog owners looking for a dependable spot will find this park lives up to its ratings."
  },
  {
    "name": "Lake Calhoun",
    "street": "3000 E Bde Maka Ska Pkwy",
    "city": "‍ Minneapolis",
    "state": "MN",
    "zip": "55408",
    "latitude": 44.9484246,
    "longitude": -93.3066308,
    "description": "With 4.7 stars across 4,306 reviews, Lake Calhoun at 3000 E Bde Maka Ska Pkwy has clearly won over Minneapolis dog owners. Open from 6am to 12am daily, dog owners can easily fit a visit into their day, whether morning or evening. Want to give your pup even more adventure? Lake of the Isles Dog Park is another beloved dog park just 0.2 miles away."
  },
  {
    "name": "Lake Nokomis Park",
    "street": "4955 W Lake Nokomis Pkwy",
    "city": "‍ Minneapolis",
    "state": "MN",
    "zip": "55417",
    "latitude": 44.9115003,
    "longitude": -93.2431176,
    "description": "Local dog owners love Lake Nokomis Park at 4955 W Lake Nokomis Pkwy in Minneapolis—4.7 stars from an impressive 2,820 reviews. Open from 5am to 10pm daily, dog owners can easily fit a visit into their day, whether morning or evening. Looking to mix things up? McRae Park is a nearby dog park 1.0 miles away that's worth exploring with your pup."
  },
  {
    "name": "Boom Island Park",
    "street": "724 Sibley St NE",
    "city": "‍ Minneapolis",
    "state": "MN",
    "zip": "55413",
    "latitude": 44.9935668,
    "longitude": -93.2694173,
    "description": "Local dog owners love Boom Island Park at 724 Sibley St NE in Minneapolis—4.7 stars from an impressive 1,372 reviews. Open from 6am to 12am daily, it's easy for dog owners to stop by whenever works best. For more dog park adventures, explore North Loop Dog Park (0.6 miles) or Bottineau Field Park (1.0 miles) with your furry companion."
  },
  {
    "name": "Loring Park",
    "street": "Loring Greenway",
    "city": "‍ Minneapolis",
    "state": "MN",
    "zip": "55403",
    "latitude": 44.9707939,
    "longitude": -93.2808234,
    "description": "In Minneapolis, Loring Park earns strong marks from local dog owners—4.7 stars from 643 reviews. Open from 6am to 10pm daily, dog owners have plenty of flexibility to plan a visit. Other dog parks in the area include Gateway Dog Park (0.5 miles) and Unleashed Hounds and Hops (0.7 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Mississippi Gorge Regional",
    "street": "3349 W River Pkwy",
    "city": "‍ Minneapolis",
    "state": "MN",
    "zip": "55406",
    "latitude": 44.94169,
    "longitude": -93.203633,
    "description": "For dog owners in the Minneapolis area, Mississippi Gorge Regional (3349 W River Pkwy) offers a 4.7-star experience based on 612 reviews. Open from 6am to 10pm daily, the park offers flexibility for dog owners with varying routines. Dog owners exploring the neighborhood can also bring their furry friends to Meeker Island Dog Park (0.3 miles)."
  },
  {
    "name": "Unleashed Hounds and Hops",
    "street": "200 East Lyndale Ave N",
    "city": "‍ Minneapolis",
    "state": "MN",
    "zip": "55405",
    "latitude": 44.9800252,
    "longitude": -93.2860459,
    "description": "For dog owners in the Minneapolis area, Unleashed Hounds and Hops (200 East Lyndale Ave N) offers a 4.7-star experience based on 518 reviews. Dog owners looking for a solid destination will find this park delivers. For variety, the neighborhood offers more dog parks to explore: North Loop Dog Park (0.7 miles) and Loring Park (0.7 miles)."
  },
  {
    "name": "Kaposia Landing",
    "street": "800 Bryant AveSouth St Paul",
    "city": "‍ Minneapolis",
    "state": "MN",
    "zip": "55075",
    "latitude": 44.9042756,
    "longitude": -93.0508662,
    "description": "Kaposia Landing at 800 Bryant Ave is well-regarded by Minneapolis dog owners, holding 4.7 stars across 433 reviews. Open from 6am to 11pm daily, the park accommodates early risers and evening visitors alike. Other dog parks in the area include Haskell Park (1.5 miles) and Lower Landing Park (2.7 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Dakota Woods Dog Park",
    "street": "16470 Blaine AveRosemount",
    "city": "‍ Minneapolis",
    "state": "MN",
    "zip": "55068",
    "latitude": 44.7103059,
    "longitude": -93.050434,
    "description": "Dakota Woods Dog Park (4.7 stars from 340 reviews) is a popular destination for Minneapolis dog owners, located at 16470 Blaine Ave. Open from 6am to 10pm daily, dog owners can easily fit a visit into busy schedules. Dog owners exploring the neighborhood can also bring their furry friends to Parkview Park (4.2 miles)."
  },
  {
    "name": "Bryant Lake Dog Park",
    "street": "6328 Rowland Rd",
    "city": "‍ Minneapolis",
    "state": "MN",
    "zip": "55344",
    "latitude": 44.8894701,
    "longitude": -93.433033,
    "description": "For dog owners in the Minneapolis area, Bryant Lake Dog Park (6328 Rowland Rd) offers a 4.7-star experience based on 323 reviews. Open from 5am to 10pm daily, dog owners can plan visits around work or their pup's energy level. For variety, the neighborhood offers more dog parks to explore: Flying Cloud Dog Park (1.4 miles) and Van Valkenburg Park (1.7 miles)."
  },
  {
    "name": "Meadow Neighborhood Park",
    "street": "2725 Oakland Rd",
    "city": "Minnetonka",
    "state": "MN",
    "zip": "55305",
    "latitude": 44.952751,
    "longitude": -93.451532,
    "description": "With 4.7 stars from 122 reviews, Meadow Neighborhood Park at 2725 Oakland Rd has become a favorite among Minnetonka dog owners. Open from 5am to 10pm daily, dog owners have plenty of flexibility to plan a visit. For variety, the neighborhood offers more dog parks to explore: Knollway Park (1.4 miles) and Jidana Park (1.5 miles)."
  },
  {
    "name": "Susan E. Lurton Park",
    "street": "3580 Wayzata BlvdLong Lake",
    "city": "Minnetonka",
    "state": "MN",
    "zip": "55356",
    "latitude": 44.984509,
    "longitude": -93.5658691,
    "description": "Susan E. Lurton Park at 3580 Wayzata Blvd is well-regarded by Minnetonka dog owners, holding 4.7 stars across 107 reviews. Open from 6:30am to 10pm daily, the park accommodates early risers and evening visitors alike. For a change of scenery, Circle Park is another dog-friendly destination 4.8 miles from here."
  },
  {
    "name": "‍ Jidana Park",
    "street": "3408 Jidana Ln",
    "city": "Minnetonka",
    "state": "MN",
    "zip": "55345",
    "latitude": 44.9404579,
    "longitude": -93.4772963,
    "description": "For dog owners in the Minnetonka area, Jidana Park (3408 Jidana Ln) offers a 4.7-star experience based on 40 reviews. Open from 6am to 10pm daily, dog owners can easily fit a visit into busy schedules. More dog-friendly parks nearby include Meadow Neighborhood Park (1.5 miles) and Knollway Park (2.6 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Purgatory Park",
    "street": "17315 Excelsior Blvd",
    "city": "Minnetonka",
    "state": "MN",
    "zip": "55345",
    "latitude": 44.9064679,
    "longitude": -93.4985814,
    "description": "Minnetonka dog owners rate Purgatory Park at 17315 Excelsior Blvd highly, with 4.6 stars from 409 visits. Open from 6am to 10pm daily, there's plenty of opportunity for dog owners to find a time that works. Dog owners can also take their pups to nearby Jidana Park (2.6 miles) or Edenvale Park (2.7 miles)."
  },
  {
    "name": "‍ Burton Park",
    "street": "19600 Minnetonka BlvdExcelsior",
    "city": "Minnetonka",
    "state": "MN",
    "zip": "55331",
    "latitude": 44.9041724,
    "longitude": -93.5590901,
    "description": "Minnetonka dog owners rate Burton Park at 19600 Minnetonka Blvd highly, with 4.5 stars from 11 visits. Open from 6am to 10pm daily, there's plenty of opportunity for dog owners to find a time that works. Looking for more places to take your pup? Purgatory Park is another popular dog park just 3.0 miles away."
  },
  {
    "name": "Knollway Park",
    "street": "895 Horn Dr",
    "city": "Minnetonka",
    "state": "MN",
    "zip": "55305",
    "latitude": 44.973386,
    "longitude": -93.4537047,
    "description": "Knollway Park at 895 Horn Dr in Minnetonka has 4.2 stars from 17 dog owner reviews. Open from 5am to 10pm daily, dog owners have flexibility to plan a visit with their four-legged friends. Dog owners looking for variety can also visit Circle Park (1.0 miles) or Meadow Neighborhood Park (1.4 miles) with their four-legged friends."
  },
  {
    "name": "River Oaks Dog Park",
    "street": "100 River Oaks Point",
    "city": "Moorhead",
    "state": "MN",
    "zip": "56560",
    "latitude": 46.8317534,
    "longitude": -96.7884505,
    "description": "Located at 100 River Oaks Point in Moorhead, River Oaks Dog Park earns strong marks from local dog owners—4.8 stars from 65 reviews. Dog owners frequent this park for its consistent quality and welcoming atmosphere. For variety, the neighborhood offers more dog parks to explore: Woodbury Park (1.2 miles) and Brandt Crossing Park (1.6 miles)."
  },
  {
    "name": "Centennial Dog Park",
    "street": "2600 15th Ave N",
    "city": "Moorhead",
    "state": "MN",
    "zip": "56560",
    "latitude": 46.8904853,
    "longitude": -96.7598444,
    "description": "Dog owners in Moorhead have rated Centennial Dog Park (2600 15th Ave N) 4.2 stars across 38 reviews. Open from 7:30am to 10pm daily, local dog owners have time to explore with their furry companions. Nearby dog parks worth exploring with your pup include Dike East Park (1.6 miles) and Urban Plains Park (1.7 miles)."
  },
  {
    "name": "Fish Lake Regional Park",
    "street": "14900 Bass Lake Rd",
    "city": "Plymouth",
    "state": "MN",
    "zip": "55311",
    "latitude": 45.0768433,
    "longitude": -93.4689867,
    "description": "Dog owners in Plymouth have made Fish Lake Regional Park at 14900 Bass Lake Rd a go-to spot, rating it 4.7 stars across 737 reviews. Open from 5am to 10pm daily, the park accommodates early risers and evening visitors alike. For variety, the neighborhood offers more dog parks to explore: Plymouth Dog Park (1.6 miles) and Plymouth - Egan Park (1.7 miles)."
  },
  {
    "name": "Plymouth - Egan Park",
    "street": "17105 Chankahda Trl",
    "city": "Plymouth",
    "state": "MN",
    "zip": "55446",
    "latitude": 45.0618118,
    "longitude": -93.4965901,
    "description": "With 4.6 stars from 16 reviews, Plymouth - Egan Park at 17105 Chankahda Trl has become a favorite among Plymouth dog owners. Open from 6am to 10pm daily, dog owners can easily fit a visit into busy schedules. Dog owners can also take their pups to nearby Plymouth Dog Park (0.1 miles) or Fish Lake Regional Park (1.7 miles)."
  },
  {
    "name": "Circle Park",
    "street": "440 Lanewood Ln N",
    "city": "Plymouth",
    "state": "MN",
    "zip": "55447",
    "latitude": 44.9842356,
    "longitude": -93.4681497,
    "description": "Plymouth dog owners rate Circle Park at 440 Lanewood Ln N highly, with 4.5 stars from 24 visits. Open from 6am to 10pm daily, dog owners have plenty of flexibility to plan a visit. Other dog parks in the area include Knollway Park (1.0 miles) and Meadow Neighborhood Park (2.3 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Quarry Hill Park",
    "street": "701 Silver Creek Rd NE",
    "city": "Rochester",
    "state": "MN",
    "zip": "55906",
    "latitude": 44.0238351,
    "longitude": -92.4289503,
    "description": "Dog owners in Rochester have embraced Quarry Hill Park (701 Silver Creek Rd NE) as a top destination—4.8 stars from 1,394 visits. Open from 5am to 11pm daily, dog owners have room to work around busy schedules. For more dog park adventures, explore Quarry Hill West Entrance (0.8 miles) or Silver Lake Park (1.2 miles) with your furry companion."
  },
  {
    "name": "Companion Acres",
    "street": "3902 Commerce Ct SW",
    "city": "Rochester",
    "state": "MN",
    "zip": "55902",
    "latitude": 43.9650244,
    "longitude": -92.4650621,
    "description": "Dog owners in Rochester have made Companion Acres at 3902 Commerce Ct SW a go-to spot, rating it 4.9 stars across 27 reviews. For dog owners in the area, this park has become a trusted spot for time with their pups. For variety, the neighborhood offers more dog parks to explore: The Gardens Park (0.6 miles) and Southern Woods Park (1.2 miles)."
  },
  {
    "name": "Quarry Hill West Entrance",
    "street": "1905 9th St NE",
    "city": "Rochester",
    "state": "MN",
    "zip": "55906",
    "latitude": 44.032482,
    "longitude": -92.4396436,
    "description": "With 4.8 stars from 56 reviews, Quarry Hill West Entrance at 1905 9th St NE has become a favorite among Rochester dog owners. Dog owners frequent this park for its consistent quality and welcoming atmosphere. More dog-friendly parks nearby include Silver Lake Park (0.6 miles) and Quarry Hill Park (0.8 miles)—perfect for pups who love adventure."
  },
  {
    "name": "River Road Dog Park",
    "street": "62nd St NW",
    "city": "Rochester",
    "state": "MN",
    "zip": "55901",
    "latitude": 44.0864298,
    "longitude": -92.5041051,
    "description": "Located at 62nd St NW in Rochester, River Road Dog Park earns strong marks from local dog owners—4.7 stars from 250 reviews. Open from 6am to 8pm daily, the park works well for dog owners with different schedules. For variety, the neighborhood offers more dog parks to explore: White Oaks Park (1.4 miles) and Essex Park (1.9 miles)."
  },
  {
    "name": "‍ Judd Park",
    "street": "3812 3rd St NW",
    "city": "Rochester",
    "state": "MN",
    "zip": "55901",
    "latitude": 44.0263687,
    "longitude": -92.5209255,
    "description": "At 3812 3rd St NW in Rochester, Judd Park has built a loyal following—4.6 stars from 154 dog owner reviews. Open from 6am to 9pm daily, there's plenty of opportunity for dog owners to find a time that works. For variety, the neighborhood offers more dog parks to explore: Mohn Park (0.5 miles) and Diamond Ridge Park (0.9 miles)."
  },
  {
    "name": "Gamehaven Reservoir",
    "street": "2016 45th St SE",
    "city": "Rochester",
    "state": "MN",
    "zip": "55904",
    "latitude": 43.956448,
    "longitude": -92.4369235,
    "description": "Located at 2016 45th St SE in Rochester, Gamehaven Reservoir earns strong marks from local dog owners—4.6 stars from 107 reviews. Open from 8am to 10pm daily, there's room in the day for dog owners to bring their furry friends. Dog owners exploring the neighborhood can also bring their furry friends to The Gardens Park (1.0 miles)."
  },
  {
    "name": "‍ Mayo Park",
    "street": "",
    "city": "Rochester",
    "state": "MN",
    "zip": "",
    "latitude": 44.0234387,
    "longitude": -92.4630182,
    "description": "Mayo Park is well-regarded by Rochester dog owners, holding 4.6 stars across 98 reviews. Open from 7am to 10pm daily, dog owners can plan visits around work or their pup's energy level. Dog owners exploring the neighborhood can also bring their furry friends to Central Park (0.2 miles)."
  },
  {
    "name": "Fox Trails Park",
    "street": "2652 Heartland Dr NW",
    "city": "Rochester",
    "state": "MN",
    "zip": "55901",
    "latitude": 44.048092,
    "longitude": -92.533276,
    "description": "At 2652 Heartland Dr NW in Rochester, Fox Trails Park has built a loyal following—4.6 stars from 16 dog owner reviews. Open from 6am to 10pm daily, there's plenty of opportunity for dog owners to find a time that works. Dog owners exploring the neighborhood can also bring their furry friends to Badger Ridge Park (0.5 miles)."
  },
  {
    "name": "Kutzky Park",
    "street": "401 9th Ave NW",
    "city": "Rochester",
    "state": "MN",
    "zip": "55901",
    "latitude": 44.027172,
    "longitude": -92.476711,
    "description": "Kutzky Park (4.6 stars from 7 reviews) is a popular destination for Rochester dog owners, located at 401 9th Ave NW. Open from 6am to 9pm daily, there's plenty of opportunity for dog owners to find a time that works. For a change of scenery, Cooke Park is another dog-friendly destination 0.3 miles from here."
  },
  {
    "name": "Stewartville Dog Park",
    "street": "",
    "city": "Rochester",
    "state": "MN",
    "zip": "",
    "latitude": 43.8554243,
    "longitude": -92.4883221,
    "description": "Rochester dog owners rate Stewartville Dog Park highly, with 4.5 stars from 24 visits. Open from 7am to 8pm daily, dog owners have plenty of flexibility to plan a visit. The consistent ratings suggest dog owners know what to expect here."
  },
  {
    "name": "Southern Woods Park",
    "street": "4982 11th Ave SW",
    "city": "Rochester",
    "state": "MN",
    "zip": "55902",
    "latitude": 43.9507851,
    "longitude": -92.4781361,
    "description": "Located at 4982 11th Ave SW in Rochester, Southern Woods Park earns strong marks from local dog owners—4.5 stars from 67 reviews. Open from 7am to 10pm daily, there's room in the day for dog owners to bring their furry friends. More dog-friendly parks nearby include The Gardens Park (1.2 miles) and Companion Acres (1.2 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Jean & Carl Frank Canine Park",
    "street": "1839 Pinewood Rd SE",
    "city": "Rochester",
    "state": "MN",
    "zip": "55904",
    "latitude": 43.9893021,
    "longitude": -92.4396544,
    "description": "Dog owners in Rochester have made Jean & Carl Frank Canine Park at 1839 Pinewood Rd SE a go-to spot, rating it 4.5 stars across 280 reviews. Open from 6am to 9pm daily, there's room in the day for dog owners to bring their furry friends. Other dog parks in the area include Meadow Park (0.8 miles) and Friendship Park (1.3 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Hart Farm Park",
    "street": "2061 Gemini Dr SW",
    "city": "Rochester",
    "state": "MN",
    "zip": "55902",
    "latitude": 43.9661819,
    "longitude": -92.4919158,
    "description": "For dog owners in Rochester, Hart Farm Park at 2061 Gemini Dr SW has a 4.4-star rating (27 reviews). Dog owners in the area appreciate having a local spot to bring their pups. Nearby dog parks worth exploring with your pup include Southern Woods Park (1.3 miles) and Companion Acres (1.3 miles)."
  },
  {
    "name": "Riverview West Park",
    "street": "2800 West River Pkwy NW",
    "city": "Rochester",
    "state": "MN",
    "zip": "55901",
    "latitude": 44.0542121,
    "longitude": -92.4667969,
    "description": "At 2800 West River Pkwy NW, Riverview West Park has 4.4 stars based on 83 reviews from Rochester dog owners. Open from 7am to 10pm daily, local dog owners have time to explore with their furry companions. Dog owners in the neighborhood can also take their furry friends to Elton Hills Run Park, 0.6 miles away."
  },
  {
    "name": "Baihly Meadows Park",
    "street": "1914 Fox Valley Dr SW",
    "city": "Rochester",
    "state": "MN",
    "zip": "55902",
    "latitude": 44.0071583,
    "longitude": -92.491679,
    "description": "23 dog owners have reviewed Baihly Meadows Park at 1914 Fox Valley Dr SW in Rochester, averaging 4.3 stars. Open from 5am to 11pm daily, the park is accessible for dog owners in the area. Dog owners looking for variety can also visit St. Mary's Park (1.1 miles) or Kutzky Park (1.3 miles) with their four-legged friends."
  },
  {
    "name": "St. Mary's Park",
    "street": "901 4th St SW",
    "city": "Rochester",
    "state": "MN",
    "zip": "55902",
    "latitude": 44.019405,
    "longitude": -92.476579,
    "description": "Dog owners in Rochester have rated St. Mary's Park (901 4th St SW) 4.3 stars across 24 reviews. Dog owners looking for a local destination will find this park accessible. For dog owners who like to explore, Kutzky Park (0.5 miles) and Kutzky Park (0.6 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "Sartell Dog Park",
    "street": "",
    "city": "St. Cloud",
    "state": "MN",
    "zip": "",
    "latitude": 45.6216319,
    "longitude": -94.2069365,
    "description": "St. Cloud dog owners rate Sartell Dog Park highly, with 4.8 stars from 126 visits. Open from 7am to 11pm daily, there's plenty of opportunity for dog owners to find a time that works. Other dog parks in the area include Pinecone Central Park (1.4 miles) and Sauk River Regional Park (2.6 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Lake George/Eastman Park",
    "street": "1101 7th St SSt Cloud",
    "city": "St. Cloud",
    "state": "MN",
    "zip": "56301",
    "latitude": 45.5534358,
    "longitude": -94.1631811,
    "description": "At 1101 7th St S in St. Cloud, Lake George/Eastman Park stands out with 4.6 stars from 1,666 happy dog owners. Open from 8am to 10pm daily, there's always time for dog owners to bring their pup for some quality time. Other popular dog parks nearby include Wilson Park (0.6 miles) and Concord Park (0.6 miles)—both favorites among local pup parents."
  },
  {
    "name": "George Friedrich Park",
    "street": "19th Ave SESt Cloud",
    "city": "St. Cloud",
    "state": "MN",
    "zip": "56304",
    "latitude": 45.5482142,
    "longitude": -94.1258475,
    "description": "With 4.6 stars from 36 reviews, George Friedrich Park at 19th Ave SE has become a favorite among St. Cloud dog owners. Open from 6am to 10pm daily, the park accommodates early risers and evening visitors alike. Nearby, Schmidt Park (1.7 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Wilson Park",
    "street": "",
    "city": "St. Cloud",
    "state": "MN",
    "zip": "",
    "latitude": 45.5616075,
    "longitude": -94.1642004,
    "description": "In St. Cloud, Wilson Park earns strong marks from local dog owners—4.6 stars from 23 reviews. For dog owners in the area, this park has become a trusted spot for time with their pups. Dog owners exploring the neighborhood can also bring their furry friends to Concord Park (0.0 miles)."
  },
  {
    "name": "Pinecone Central Park",
    "street": "1105 Central Park BlvdSartell",
    "city": "St. Cloud",
    "state": "MN",
    "zip": "56377",
    "latitude": 45.6345908,
    "longitude": -94.2290139,
    "description": "With 4.5 stars from 61 reviews, Pinecone Central Park at 1105 Central Park Blvd has become a favorite among St. Cloud dog owners. Open from 8am to 9pm daily, dog owners have plenty of flexibility to plan a visit. Other dog parks in the area include Sartell Dog Park (1.4 miles) and Sauk River Regional Park (3.7 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Sauk River Regional Park",
    "street": "3237 Dolores DrSt Cloud",
    "city": "St. Cloud",
    "state": "MN",
    "zip": "56303",
    "latitude": 45.5851763,
    "longitude": -94.1976142,
    "description": "Sauk River Regional Park at 3237 Dolores Dr is well-regarded by St. Cloud dog owners, holding 4.5 stars across 142 reviews. Dog owners in the area consistently choose this park as a go-to destination for their pups. Dog owners exploring the neighborhood can also bring their furry friends to Wilson Park (2.0 miles)."
  },
  {
    "name": "Concord Park",
    "street": "",
    "city": "St. Cloud",
    "state": "MN",
    "zip": "",
    "latitude": 45.5616075,
    "longitude": -94.1642004,
    "description": "Dog owners in St. Cloud have rated Concord Park 4.1 stars across 7 reviews. Open from 6am to 10pm daily, dog owners can stop by when it fits their schedule. Nearby dog parks worth exploring with your pup include Wilson Park (0.0 miles) and Lake George/Eastman Park (0.6 miles)."
  },
  {
    "name": "Heritage Park",
    "street": "265 33rd Ave SSt Cloud",
    "city": "St. Cloud",
    "state": "MN",
    "zip": "56301",
    "latitude": 45.5456354,
    "longitude": -94.1974681,
    "description": "At 265 33rd Ave S in St. Cloud, Heritage Park carries 4.4 stars from 290 dog owner reviews. For dog owners in the neighborhood, this park offers a place to take their pups. Dog owners in the neighborhood can also take their furry friends to Lions Park, 0.8 miles away."
  },
  {
    "name": "Schmidt Park",
    "street": "751 18th St SSt Cloud",
    "city": "St. Cloud",
    "state": "MN",
    "zip": "56301",
    "latitude": 45.5409097,
    "longitude": -94.1593355,
    "description": "Dog owners in St. Cloud have rated Schmidt Park (751 18th St S) 4.1 stars across 35 reviews. The park serves as a gathering spot for dog owners and their four-legged friends in the area. Dog owners might also enjoy Lake George/Eastman Park, another dog park just 0.9 miles away."
  },
  {
    "name": "Minnehaha Regional Park",
    "street": "4801 S Minnehaha Dr",
    "city": "St. Paul",
    "state": "MN",
    "zip": "55417",
    "latitude": 44.9160745,
    "longitude": -93.2115215,
    "description": "At 4801 S Minnehaha Dr in St. Paul, Minnehaha Regional Park draws dog owners from across the area—4.8 stars from 10,759 reviews. Open from 6am to 10pm daily, visits fit naturally into any dog owner's routine. While you're in the area, dog owners also recommend taking your pup to Hidden Falls Regional Park, another excellent dog park 1.2 miles away."
  },
  {
    "name": "Como Regional Park",
    "street": "1199 Midway PkwySt Paul",
    "city": "St. Paul",
    "state": "MN",
    "zip": "55118",
    "latitude": 44.9792092,
    "longitude": -93.1527872,
    "description": "At 1199 Midway Pkwy in St. Paul, Como Regional Park draws dog owners from across the area—4.7 stars from 13,010 reviews. Few parks earn this level of trust from the dog owner community. Dog owners in this area are lucky to have more great dog parks nearby: Woodview Off-Leash Dog Area (0.9 miles) and Marydale Park (1.4 miles)."
  },
  {
    "name": "Crosby Farm Regional Park",
    "street": "2595 Crosby Farm RdSt Paul",
    "city": "St. Paul",
    "state": "MN",
    "zip": "55116",
    "latitude": 44.8969937,
    "longitude": -93.16966,
    "description": "Crosby Farm Regional Park (4.7 stars from 885 reviews) is a popular destination for St. Paul dog owners, located at 2595 Crosby Farm Rd. Open from 7am to 11pm daily, dog owners have plenty of flexibility to plan a visit. Looking for more places to take your pup? Hidden Falls Regional Park is another popular dog park just 1.3 miles away."
  },
  {
    "name": "Otter Lake Off-leash Dog Area",
    "street": "5750 Otter Lake RdWhite Bear Township",
    "city": "St. Paul",
    "state": "MN",
    "zip": "55110",
    "latitude": 45.1214073,
    "longitude": -93.0453885,
    "description": "For dog owners in the St. Paul area, Otter Lake Off-leash Dog Area (5750 Otter Lake Rd) offers a 4.7-star experience based on 481 reviews. Open from 5am to 11pm daily, the park offers flexibility for dog owners with varying routines. A solid track record makes this a reliable choice for dog owners."
  },
  {
    "name": "Irvine Park",
    "street": "251 Walnut StSt Paul",
    "city": "St. Paul",
    "state": "MN",
    "zip": "55102",
    "latitude": 44.9404186,
    "longitude": -93.1019828,
    "description": "Dog owners in St. Paul have made Irvine Park at 251 Walnut St a go-to spot, rating it 4.7 stars across 282 reviews. Open from 6am to 10pm daily, the park works well for dog owners with different schedules. For variety, the neighborhood offers more dog parks to explore: Harriet Island Regional Park (0.5 miles) and Mississippi National River & (0.5 miles)."
  },
  {
    "name": "Colby Hills Park",
    "street": "",
    "city": "St. Paul",
    "state": "MN",
    "zip": "",
    "latitude": 45.0122571,
    "longitude": -92.9922512,
    "description": "For dog owners in the St. Paul area, Colby Hills Park offers a 4.6-star experience based on 11 reviews. Open from 6am to 10pm daily, the park works well for dog owners with different schedules. Dog owners can also take their pups to nearby Casey Lake Park (1.1 miles) or Oakdale Bark Park (1.8 miles)."
  },
  {
    "name": "‍ Lilydale Off-Leash Dog Park",
    "street": "1700 Lilydale RdSt Paul",
    "city": "St. Paul",
    "state": "MN",
    "zip": "55118",
    "latitude": 44.9165995,
    "longitude": -93.1287884,
    "description": "Dog owners in St. Paul have made Lilydale Off-Leash Dog Park at 1700 Lilydale Rd a go-to spot, rating it 4.6 stars across 44 reviews. The steady stream of dog owner visits speaks to the park's appeal. For a change of scenery, Lilydale Regional Park is another dog-friendly destination 0.3 miles from here."
  },
  {
    "name": "‍ Casey Lake Park",
    "street": "2101 17th Ave ENorth St Paul",
    "city": "St. Paul",
    "state": "MN",
    "zip": "55109",
    "latitude": 45.020961,
    "longitude": -93.010189,
    "description": "For dog owners in the St. Paul area, Casey Lake Park (2101 17th Ave E) offers a 4.6-star experience based on 591 reviews. Open from 7am to 10pm daily, there's plenty of opportunity for dog owners to find a time that works. Other dog parks in the area include Colby Hills Park (1.1 miles) and Oakdale Bark Park (2.6 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Harriet Island Regional Park",
    "street": "49 Harriet Island RdSt Paul",
    "city": "St. Paul",
    "state": "MN",
    "zip": "55107",
    "latitude": 44.9402041,
    "longitude": -93.0926848,
    "description": "St. Paul dog owners rate Harriet Island Regional Park at 49 Harriet Island Rd highly, with 4.6 stars from 725 visits. Open from 6am to 11pm daily, there's plenty of opportunity for dog owners to find a time that works. More dog-friendly parks nearby include Irvine Park (0.5 miles) and Mears Park (0.7 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Lilydale Regional Park",
    "street": "950 Lilydale RdSt Paul",
    "city": "St. Paul",
    "state": "MN",
    "zip": "55118",
    "latitude": 44.9196268,
    "longitude": -93.1236732,
    "description": "Dog owners in St. Paul have embraced Lilydale Regional Park (950 Lilydale Rd) as a top destination—4.6 stars from 1,062 visits. Open from 5am to 10pm daily, it's easy for dog owners to stop by whenever works best. Nearby, Lilydale Off-Leash Dog Park (0.3 miles) is another dog park favorite where you can take your four-legged friend."
  },
  {
    "name": "Hidden Falls Regional Park",
    "street": "1313 Hidden Falls DrSt Paul",
    "city": "St. Paul",
    "state": "MN",
    "zip": "55116",
    "latitude": 44.9071801,
    "longitude": -93.1913846,
    "description": "Hidden Falls Regional Park at 1313 Hidden Falls Dr in St. Paul is a community favorite, with 1,301 dog owners giving it 4.6 stars. Open from 6am to 10pm daily, the park is convenient for before work, after work, or weekend adventures. Looking to mix things up? Minnehaha Dog Park is a nearby dog park 0.3 miles away that's worth exploring with your pup."
  },
  {
    "name": "‍ Battle Creek Regional Park",
    "street": "2300 Upper Afton RdMaplewood",
    "city": "St. Paul",
    "state": "MN",
    "zip": "55119",
    "latitude": 44.940969,
    "longitude": -93.004729,
    "description": "With 4.6 stars across 2,281 reviews, Battle Creek Regional Park at 2300 Upper Afton Rd has clearly won over St. Paul dog owners. Open from 6am to 10pm daily, it's easy for dog owners to stop by whenever works best. For variety, many dog owners also bring their furry friends to Battle Creek Dog Park (0.1 miles)—another great dog park in the area."
  },
  {
    "name": "Mississippi National River &",
    "street": "120 W Kellogg BlvdSt Paul",
    "city": "St. Paul",
    "state": "MN",
    "zip": "55102",
    "latitude": 44.9470685,
    "longitude": -93.1042897,
    "description": "Mississippi National River & at 120 W Kellogg Blvd has become essential for St. Paul dog owners, earning 4.6 stars from 6,995 visitors. The sheer volume of dog owner visits speaks to what makes this park exceptional. The neighborhood offers dog owners more places to bring their pups: Irvine Park (0.5 miles) and Lane Place Park (0.6 miles)."
  },
  {
    "name": "Tamarack Park",
    "street": "1745 Farrington St",
    "city": "St. Paul",
    "state": "MN",
    "zip": "55113",
    "latitude": 44.9944775,
    "longitude": -93.11298,
    "description": "Located at 1745 Farrington St in St. Paul, Tamarack Park earns strong marks from local dog owners—4.5 stars from 100 reviews. Open from 5am to 10pm daily, the park works well for dog owners with different schedules. Dog owners exploring the neighborhood can also bring their furry friends to Marydale Park (1.3 miles)."
  },
  {
    "name": "Heritage Village Park",
    "street": "4321 65th St EInver Grove Heights",
    "city": "St. Paul",
    "state": "MN",
    "zip": "55076",
    "latitude": 44.855252,
    "longitude": -93.019546,
    "description": "With 4.5 stars from 104 reviews, Heritage Village Park at 4321 65th St E has become a favorite among St. Paul dog owners. Open from 6am to 10pm daily, the park works well for dog owners with different schedules. Dog owners can also take their pups to nearby Kaposia Landing (3.7 miles) or Haskell Park (4.8 miles)."
  },
  {
    "name": "City Of Mendota Heights Off-le",
    "street": "Acacia BlvdMendota Heights",
    "city": "St. Paul",
    "state": "MN",
    "zip": "55120",
    "latitude": 44.8781314,
    "longitude": -93.1628807,
    "description": "With 4.5 stars from 133 reviews, City Of Mendota Heights Off-le has become a favorite among St. Paul dog owners. Open from 7am to 9pm daily, the park offers flexibility for dog owners with varying routines. Looking for more places to take your pup? Crosby Farm Regional Park is another popular dog park just 1.3 miles away."
  }
]