[
  {
    "name": "Golden Hills Park",
    "street": "",
    "city": "Bellevue",
    "state": "NE",
    "zip": "",
    "latitude": 41.1365122,
    "longitude": -95.8937398,
    "description": "118 dog owners have reviewed Golden Hills Park in Bellevue, averaging 4.2 stars. Open from 6am to 10pm daily, local dog owners have time to explore with their furry companions. For dog owners who like to explore, Freeman Park (0.7 miles) and Jewell Dog Park (1.2 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "Freeman Park",
    "street": "802 Lemay Dr",
    "city": "Bellevue",
    "state": "NE",
    "zip": "68005",
    "latitude": 41.1437625,
    "longitude": -95.9036938,
    "description": "Located at 802 Lemay Dr, Freeman Park offers Bellevue dog owners a neighborhood destination for their four-legged friends. Open from 6am to 9:30pm daily, the park gives dog owners in the neighborhood time to bring their pups. For pups who want more adventure, Golden Hills Park is a nearby dog park worth visiting (0.7 miles)."
  },
  {
    "name": "‍ Dog Island",
    "street": "3315 S Blaine St",
    "city": "Grand Island",
    "state": "NE",
    "zip": "68801",
    "latitude": 40.8879063,
    "longitude": -98.358927,
    "description": "Located at 3315 S Blaine St, Dog Island in Grand Island is rated 4.4 stars by 143 dog owners. Open from 7am to 8pm daily, dog owners can stop by when it fits their schedule. The reviews from fellow dog owners offer helpful insights about this park."
  },
  {
    "name": "Parking Lot - Holmes Lake Dog",
    "street": "",
    "city": "Lincoln",
    "state": "NE",
    "zip": "",
    "latitude": 40.8088861,
    "longitude": -96.7077751,
    "description": "In Lincoln, Parking Lot - Holmes Lake Dog earns strong marks from local dog owners—4.8 stars from 236 reviews. Open from 9am to 9pm daily, dog owners can plan visits around work or their pup's energy level. For variety, the neighborhood offers more dog parks to explore: Off Leash Dog Bar (0.8 miles) and Maple Lodge Pocket Park (1.3 miles)."
  },
  {
    "name": "‍ Off Leash Dog Bar",
    "street": "1975 M St",
    "city": "Lincoln",
    "state": "NE",
    "zip": "68510",
    "latitude": 40.8111212,
    "longitude": -96.6928694,
    "description": "At 1975 M St in Lincoln, Off Leash Dog Bar has built a loyal following—4.7 stars from 84 dog owner reviews. The park has earned its reputation among dog owners in the neighborhood as a reliable choice. Nearby, Parking Lot - Holmes Lake Dog (0.8 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "‍ Maple Lodge Pocket Park",
    "street": "1750 S 20th St",
    "city": "Lincoln",
    "state": "NE",
    "zip": "68502",
    "latitude": 40.7948324,
    "longitude": -96.691232,
    "description": "Maple Lodge Pocket Park (5.0 stars from 6 reviews) is a popular destination for Lincoln dog owners, located at 1750 S 20th St. Open from 5am to 11pm daily, the park works well for dog owners with different schedules. More dog-friendly parks nearby include Off Leash Dog Bar (1.1 miles) and Standing Bear Park (1.3 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Mahoney Park",
    "street": "Fremont St",
    "city": "Lincoln",
    "state": "NE",
    "zip": "68507",
    "latitude": 40.848618,
    "longitude": -96.6263393,
    "description": "For dog owners in the Lincoln area, Mahoney Park offers a 4.6-star experience based on 709 reviews. Open from 6am to 11pm daily, dog owners have plenty of flexibility to plan a visit. For variety, the neighborhood offers more dog parks to explore: Herbert Park (2.5 miles) and Off Leash Dog Bar (4.3 miles)."
  },
  {
    "name": "Stransky Dog Run at Peterson",
    "street": "4419 Southwood Dr",
    "city": "Lincoln",
    "state": "NE",
    "zip": "68502",
    "latitude": 40.7687495,
    "longitude": -96.6898812,
    "description": "Dog owners in Lincoln have made Stransky Dog Run at Peterson at 4419 Southwood Dr a go-to spot, rating it 4.6 stars across 247 reviews. Open from 5am to 11pm daily, there's plenty of opportunity for dog owners to find a time that works. Nearby, Maple Lodge Pocket Park (1.8 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "‍ Roper East Dog Run",
    "street": "2620-3098 N 7th St",
    "city": "Lincoln",
    "state": "NE",
    "zip": "68521",
    "latitude": 40.8413369,
    "longitude": -96.7102993,
    "description": "Roper East Dog Run at 2620-3098 N 7th St in Lincoln has 4.4 stars from 359 dog owner reviews. Open from 5am to 11pm daily, local dog owners have time to explore with their furry companions. More dog parks in the area include Parking Lot - Holmes Lake Dog (2.2 miles) and Off Leash Dog Bar (2.3 miles)—great options for mixing up your pup's routine."
  },
  {
    "name": "Herbert Park",
    "street": "200 Apache Trail",
    "city": "Lincoln",
    "state": "NE",
    "zip": "68505",
    "latitude": 40.81495,
    "longitude": -96.611438,
    "description": "Located at 200 Apache Trail, Herbert Park in Lincoln is rated 4.3 stars by 74 dog owners. Open from 5am to 11pm daily, the park fits conveniently into different routines. More dog parks in the area include Mahoney Park (2.5 miles) and Off Leash Dog Bar (4.3 miles)—great options for mixing up your pup's routine."
  },
  {
    "name": "Standing Bear Park",
    "street": "2320 Park Blvd",
    "city": "Lincoln",
    "state": "NE",
    "zip": "68502",
    "latitude": 40.789643,
    "longitude": -96.7148468,
    "description": "Dog owners in Lincoln have rated Standing Bear Park (2320 Park Blvd) 4.2 stars across 65 reviews. Open from 5am to 11pm daily, the park fits conveniently into different routines. For dog owners who like to explore, Maple Lodge Pocket Park (1.3 miles) and Parking Lot - Holmes Lake Dog (1.4 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "Lakeview Park",
    "street": "245 NW 20th St",
    "city": "Lincoln",
    "state": "NE",
    "zip": "68528",
    "latitude": 40.8156378,
    "longitude": -96.749249,
    "description": "Dog owners in the Lincoln area will find Lakeview Park at 245 NW 20th St—a local option for spending time with their pups. Open from 5am to 11pm daily, the park gives dog owners in the neighborhood time to bring their pups. Nearby dog parks worth exploring with your pup include Parking Lot - Holmes Lake Dog (2.2 miles) and Standing Bear Park (2.5 miles)."
  },
  {
    "name": "Omaha Dog Bar",
    "street": "1231 S 14th St",
    "city": "Omaha",
    "state": "NE",
    "zip": "68108",
    "latitude": 41.2470266,
    "longitude": -95.9343412,
    "description": "For dog owners in the Omaha area, Omaha Dog Bar (1231 S 14th St) offers a 4.8-star experience based on 360 reviews. The park has earned its reputation among dog owners in the neighborhood as a reliable choice. Nearby, Willow Creek Park (0.8 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Chalco Hills Recreation Area",
    "street": "8901 S 154th St",
    "city": "Omaha",
    "state": "NE",
    "zip": "68138",
    "latitude": 41.1922658,
    "longitude": -96.1552159,
    "description": "Local dog owners love Chalco Hills Recreation Area at 8901 S 154th St in Omaha—4.7 stars from an impressive 1,963 reviews. Open from 6am to 10pm daily, dog owners have room to work around busy schedules. Looking to mix things up? Pheasant Run Park is a nearby dog park 0.2 miles away that's worth exploring with your pup."
  },
  {
    "name": "Bridlewood Park",
    "street": "16302 Ohio St",
    "city": "Omaha",
    "state": "NE",
    "zip": "68116",
    "latitude": 41.2832444,
    "longitude": -96.1693525,
    "description": "Omaha dog owners rate Bridlewood Park at 16302 Ohio St highly, with 4.9 stars from 16 visits. The steady stream of dog owner visits speaks to the park's appeal. Other dog parks in the area include Cottonwood Park (2.2 miles) and Harvey Oaks Park (3.6 miles)—both great for exploring with your four-legged friend."
  },
  {
    "name": "Bark Park",
    "street": "15306 Capehart Rd",
    "city": "Omaha",
    "state": "NE",
    "zip": "68059",
    "latitude": 41.1181468,
    "longitude": -96.1516595,
    "description": "With 4.8 stars from 16 reviews, Bark Park at 15306 Capehart Rd has become a favorite among Omaha dog owners. Open from 7am to 8:30pm daily, dog owners can plan visits around work or their pup's energy level. The reviews indicate this is a trusted destination for dog owners in the area."
  },
  {
    "name": "Walnut Creek Recreation Area",
    "street": "11601 S 96th St",
    "city": "Omaha",
    "state": "NE",
    "zip": "68046",
    "latitude": 41.1534393,
    "longitude": -96.0630192,
    "description": "Local dog owners love Walnut Creek Recreation Area at 11601 S 96th St in Omaha—4.6 stars from an impressive 1,401 reviews. Open from 6am to 10pm daily, dog owners have plenty of flexibility to visit when it suits their schedule. Other popular dog parks nearby include Walnut Creek Leash Free Dog (1.1 miles) and Ralston Park (3.6 miles)—both favorites among local pup parents."
  },
  {
    "name": "Metcalfe Park",
    "street": "",
    "city": "Omaha",
    "state": "NE",
    "zip": "",
    "latitude": 41.2587459,
    "longitude": -95.9383758,
    "description": "Metcalfe Park is well-regarded by Omaha dog owners, holding 4.6 stars across 209 reviews. Open from 5am to 11pm daily, the park accommodates early risers and evening visitors alike. Nearby, Willow Creek Park (0.0 miles) offers dog owners another great spot to explore with their pups."
  },
  {
    "name": "Hanscom Park",
    "street": "3201 Woolworth Ave",
    "city": "Omaha",
    "state": "NE",
    "zip": "68105",
    "latitude": 41.245144,
    "longitude": -95.960496,
    "description": "Dog owners in Omaha have made Hanscom Park at 3201 Woolworth Ave a go-to spot, rating it 4.6 stars across 133 reviews. Open from 5am to 11pm daily, dog owners can plan visits around work or their pup's energy level. Looking for more places to take your pup? Hanscom Dog Park is another popular dog park just 0.2 miles away."
  },
  {
    "name": "Deerwood Park",
    "street": "7452 113th Ct",
    "city": "Omaha",
    "state": "NE",
    "zip": "68142",
    "latitude": 41.2474961,
    "longitude": -96.0903146,
    "description": "Deerwood Park at 7452 113th Ct is well-regarded by Omaha dog owners, holding 4.6 stars across 52 reviews. Open from 5am to 11pm daily, the park accommodates early risers and evening visitors alike. Dog owners exploring the neighborhood can also bring their furry friends to Roxbury Park (3.0 miles)."
  },
  {
    "name": "Harvey Oaks Park",
    "street": "14948 W Center Rd",
    "city": "Omaha",
    "state": "NE",
    "zip": "68144",
    "latitude": 41.2341455,
    "longitude": -96.148291,
    "description": "Harvey Oaks Park at 14948 W Center Rd is well-regarded by Omaha dog owners, holding 4.5 stars across 51 reviews. Open from 5am to 11pm daily, the park works well for dog owners with different schedules. More dog-friendly parks nearby include Cottonwood Park (1.4 miles) and Pheasant Run Park (2.7 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Cottonwood Park",
    "street": "728 S 154th St",
    "city": "Omaha",
    "state": "NE",
    "zip": "68154",
    "latitude": 41.254374,
    "longitude": -96.153109,
    "description": "Located at 728 S 154th St in Omaha, Cottonwood Park earns strong marks from local dog owners—4.5 stars from 166 reviews. Open from 5am to 11pm daily, dog owners have plenty of flexibility to plan a visit. More dog-friendly parks nearby include Harvey Oaks Park (1.4 miles) and Bridlewood Park (2.2 miles)—perfect for pups who love adventure."
  },
  {
    "name": "Hanscom Dog Park",
    "street": "Hanscom Park Dr",
    "city": "Omaha",
    "state": "NE",
    "zip": "68105",
    "latitude": 41.2419613,
    "longitude": -95.9582129,
    "description": "In Omaha, Hanscom Dog Park earns strong marks from local dog owners—4.5 stars from 216 reviews. Open from 5am to 11pm daily, dog owners can easily fit a visit into busy schedules. Dog owners exploring the neighborhood can also bring their furry friends to Hanscom Park (0.2 miles)."
  },
  {
    "name": "‍ Walnut Creek Leash Free Dog",
    "street": "",
    "city": "Omaha",
    "state": "NE",
    "zip": "",
    "latitude": 41.1544433,
    "longitude": -96.0422378,
    "description": "Dog owners in Omaha have made Walnut Creek Leash Free Dog a go-to spot, rating it 4.5 stars across 235 reviews. Open from 6am to 10pm daily, dog owners can plan visits around work or their pup's energy level. Dog owners can also take their pups to nearby Walnut Creek Recreation Area (1.1 miles) or Ralston Park (3.2 miles)."
  },
  {
    "name": "Ralston Park",
    "street": "7700 Park Dr",
    "city": "Omaha",
    "state": "NE",
    "zip": "68127",
    "latitude": 41.20083,
    "longitude": -96.032055,
    "description": "Dog owners in Omaha have made Ralston Park at 7700 Park Dr a go-to spot, rating it 4.5 stars across 452 reviews. Open from 6am to 10pm daily, the park accommodates early risers and evening visitors alike. Dog owners exploring the neighborhood can also bring their furry friends to Aksarben Dog Park (3.0 miles)."
  },
  {
    "name": "Pheasant Run Park",
    "street": "15504 Adams St",
    "city": "Omaha",
    "state": "NE",
    "zip": "68137",
    "latitude": 41.1954376,
    "longitude": -96.1565143,
    "description": "For dog owners in Omaha, Pheasant Run Park at 15504 Adams St has a 4.1-star rating (9 reviews). Open from 5am to 11pm daily, dog owners have flexibility to plan a visit with their four-legged friends. For dog owners who like to explore, Chalco Hills Recreation Area (0.2 miles) and Harvey Oaks Park (2.7 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "‍ Aksarben Dog Park",
    "street": "6515 Shirley St",
    "city": "Omaha",
    "state": "NE",
    "zip": "68106",
    "latitude": 41.2416096,
    "longitude": -96.0125308,
    "description": "At 6515 Shirley St, Aksarben Dog Park has 4.4 stars based on 147 reviews from Omaha dog owners. Open from 6am to 10pm daily, dog owners have flexibility to plan a visit with their four-legged friends. Looking to explore more? Hanscom Park is another dog-friendly park 2.7 miles from here."
  },
  {
    "name": "Jewell Dog Park",
    "street": "600-624 Combs Rd",
    "city": "Omaha",
    "state": "NE",
    "zip": "68005",
    "latitude": 41.1531719,
    "longitude": -95.8939161,
    "description": "For dog owners in Omaha, Jewell Dog Park at 600-624 Combs Rd has a 4.4-star rating (278 reviews). Open from 6am to 10pm daily, dog owners have a window to spend time with their pups. For dog owners who like to explore, Freeman Park (0.8 miles) and Golden Hills Park (1.2 miles) are both nearby parks to try with your dog."
  },
  {
    "name": "Siouxland Freedom Park",
    "street": "1801 Veterans Dr",
    "city": "South Sioux City",
    "state": "NE",
    "zip": "68776",
    "latitude": 42.4725874,
    "longitude": -96.3871743,
    "description": "Dog owners in South Sioux City have made Siouxland Freedom Park at 1801 Veterans Dr a go-to spot, rating it 4.7 stars across 28 reviews. The park has earned its reputation among dog owners in the neighborhood as a reliable choice. For variety, the neighborhood offers more dog parks to explore: Cecelia Park (1.2 miles) and Chris Larsen City Park (1.6 miles)."
  }
]