[
  {
    "name": "Braeburn Dog Park",
    "street": "3324 Idlehurst Ln",
    "city": "Rapid City",
    "state": "SD",
    "zip": "57702",
    "latitude": 44.0536307,
    "longitude": -103.3073868,
    "description": "Located at 3324 Idlehurst Ln in Rapid City, Braeburn Dog Park earns strong marks from local dog owners—4.7 stars from 660 reviews. Open from 5am to 10pm daily, there's room in the day for dog owners to bring their furry friends. Looking for more places to take your pup? Wilderness Park is another popular dog park just 2.6 miles away."
  },
  {
    "name": "Wilderness Park",
    "street": "514 City Springs Rd",
    "city": "Rapid City",
    "state": "SD",
    "zip": "57702",
    "latitude": 44.0901751,
    "longitude": -103.2945295,
    "description": "With 4.9 stars from 21 reviews, Wilderness Park at 514 City Springs Rd has become a favorite among Rapid City dog owners. Local dog owners appreciate what this park offers their four-legged friends. Dog owners exploring the neighborhood can also bring their furry friends to Braeburn Dog Park (2.6 miles)."
  },
  {
    "name": "Parking for Robbinsdale Dog",
    "street": "",
    "city": "Rapid City",
    "state": "SD",
    "zip": "",
    "latitude": 44.0806041,
    "longitude": -103.228023,
    "description": "Dog owners in Rapid City have made Parking for Robbinsdale Dog a go-to spot, rating it 4.8 stars across 17 reviews. Dog owners looking for a solid destination will find this park delivers. For a change of scenery, Wilson Park is another dog-friendly destination 0.8 miles from here."
  },
  {
    "name": "Centennial Park",
    "street": "800 E Centennial St",
    "city": "Rapid City",
    "state": "SD",
    "zip": "57701",
    "latitude": 44.048391,
    "longitude": -103.204022,
    "description": "Centennial Park at 800 E Centennial St in Rapid City has 4.4 stars from 55 dog owner reviews. Open from 5am to 10pm daily, dog owners can stop by when it fits their schedule. Dog owners looking for variety can also visit Robbinsdale Park (0.8 miles) or Wilson Park (2.0 miles) with their four-legged friends."
  },
  {
    "name": "Wilson Park",
    "street": "1701 Mt Rushmore Rd",
    "city": "Rapid City",
    "state": "SD",
    "zip": "57701",
    "latitude": 44.069415,
    "longitude": -103.232514,
    "description": "For dog owners in Rapid City, Wilson Park at 1701 Mt Rushmore Rd has a 4.4-star rating (177 reviews). Open from 5am to 10pm daily, dog owners have flexibility to plan a visit with their four-legged friends. For pups who want more adventure, Parking for Robbinsdale Dog is a nearby dog park worth visiting (0.8 miles)."
  },
  {
    "name": "Robbinsdale Park",
    "street": "631 E Oakland St",
    "city": "Rapid City",
    "state": "SD",
    "zip": "57701",
    "latitude": 44.060134,
    "longitude": -103.206115,
    "description": "Dog owners in Rapid City have rated Robbinsdale Park (631 E Oakland St) 4.4 stars across 425 reviews. Open from 5am to 10pm daily, dog owners can stop by when it fits their schedule. Nearby dog parks worth exploring with your pup include Centennial Park (0.8 miles) and Steele Avenue Park (1.3 miles)."
  },
  {
    "name": "Steele Avenue Park",
    "street": "260 E Main St N",
    "city": "Rapid City",
    "state": "SD",
    "zip": "57701",
    "latitude": 44.0790236,
    "longitude": -103.2084532,
    "description": "At 260 E Main St N, Steele Avenue Park has 4.1 stars based on 44 reviews from Rapid City dog owners. Open from 6am to 10pm daily, the park fits conveniently into different routines. For pups who want more adventure, Parking for Robbinsdale Dog is a nearby dog park worth visiting (1.0 miles)."
  },
  {
    "name": "College Park",
    "street": "224 College Ave",
    "city": "Rapid City",
    "state": "SD",
    "zip": "57701",
    "latitude": 44.0949376,
    "longitude": -103.2171092,
    "description": "College Park at 224 College Ave provides Rapid City dog owners with a local spot to visit with their pups. Open from 6am to 10pm daily, local dog owners have time to explore with their furry companions. Dog owners looking for variety can also visit Parking for Robbinsdale Dog (1.1 miles) or Steele Avenue Park (1.2 miles) with their four-legged friends."
  },
  {
    "name": "‍ Falls Park",
    "street": "131 E Falls Park Dr",
    "city": "Sioux Falls",
    "state": "SD",
    "zip": "57104",
    "latitude": 43.5587954,
    "longitude": -96.7255759,
    "description": "Falls Park at 131 E Falls Park Dr is one of the most beloved dog parks in Sioux Falls—4.8 stars from an incredible 13,055 reviews. Open from 5am to 12am daily, dog owners can find the perfect time for their furry friend. The neighborhood offers dog owners more places to bring their pups: Kirby Dog Park (0.9 miles) and Lien Park (0.9 miles)."
  },
  {
    "name": "Kirby Dog Park",
    "street": "201 S 2nd Ave",
    "city": "Sioux Falls",
    "state": "SD",
    "zip": "57104",
    "latitude": 43.545756,
    "longitude": -96.7243301,
    "description": "Dog owners in Sioux Falls have made Kirby Dog Park at 201 S 2nd Ave a go-to spot, rating it 4.7 stars across 119 reviews. Open from 6am to 10pm daily, the park works well for dog owners with different schedules. For a change of scenery, Falls Park is another dog-friendly destination 0.9 miles from here."
  },
  {
    "name": "‍ Pasley Park",
    "street": "2301 S Southeastern Ave",
    "city": "Sioux Falls",
    "state": "SD",
    "zip": "57103",
    "latitude": 43.5242877,
    "longitude": -96.6957299,
    "description": "Sioux Falls dog owners rate Pasley Park at 2301 S Southeastern Ave highly, with 4.7 stars from 258 visits. Open from 5am to 10pm daily, dog owners can easily fit a visit into busy schedules. For a change of scenery, Rotary Park is another dog-friendly destination 0.4 miles from here."
  },
  {
    "name": "‍ Family Park",
    "street": "300 N Ellis Rd",
    "city": "Sioux Falls",
    "state": "SD",
    "zip": "57107",
    "latitude": 43.5470618,
    "longitude": -96.8307742,
    "description": "At 300 N Ellis Rd in Sioux Falls, Family Park has built a loyal following—4.6 stars from 84 dog owner reviews. Open from 5am to 10pm daily, the park accommodates early risers and evening visitors alike. Looking for more places to take your pup? Family Park is another popular dog park just 0.1 miles away."
  },
  {
    "name": "Rotary Park",
    "street": "2408 E 26th St",
    "city": "Sioux Falls",
    "state": "SD",
    "zip": "57103",
    "latitude": 43.5293771,
    "longitude": -96.6957796,
    "description": "Rotary Park (4.6 stars from 218 reviews) is a popular destination for Sioux Falls dog owners, located at 2408 E 26th St. Open from 5am to 10pm daily, the park accommodates early risers and evening visitors alike. Dog owners exploring the neighborhood can also bring their furry friends to Pasley Park (0.4 miles)."
  },
  {
    "name": "Lacey Park",
    "street": "3212 N 7th Ave",
    "city": "Sioux Falls",
    "state": "SD",
    "zip": "57104",
    "latitude": 43.5799674,
    "longitude": -96.7174295,
    "description": "At 3212 N 7th Ave in Sioux Falls, Lacey Park has built a loyal following—4.5 stars from 52 dog owner reviews. Open from 5am to 10pm daily, the park works well for dog owners with different schedules. For variety, the neighborhood offers more dog parks to explore: Lien Park (0.9 miles) and Falls Park (1.5 miles)."
  },
  {
    "name": "The Splash Bark by SDK",
    "street": "27246 SD-115",
    "city": "Sioux Falls",
    "state": "SD",
    "zip": "57032",
    "latitude": 43.4381525,
    "longitude": -96.7262781,
    "description": "The Splash Bark by SDK (4.5 stars from 56 reviews) is a popular destination for Sioux Falls dog owners, located at 27246 SD-115. Dog owners frequent this park for its consistent quality and welcoming atmosphere. Looking for more places to take your pup? Platinum Valley Park is another popular dog park just 3.7 miles away."
  },
  {
    "name": "Family Park",
    "street": "S Ellis Rd",
    "city": "Sioux Falls",
    "state": "SD",
    "zip": "57107",
    "latitude": 43.5449311,
    "longitude": -96.8307628,
    "description": "Family Park is well-regarded by Sioux Falls dog owners, holding 4.5 stars across 448 reviews. Open from 5am to 10pm daily, dog owners can plan visits around work or their pup's energy level. Dog owners exploring the neighborhood can also bring their furry friends to Family Park (0.1 miles)."
  },
  {
    "name": "Spencer Park",
    "street": "3501 Cliff Ave",
    "city": "Sioux Falls",
    "state": "SD",
    "zip": "57105",
    "latitude": 43.512353,
    "longitude": -96.711935,
    "description": "Dog owners in Sioux Falls have made Spencer Park at 3501 Cliff Ave a go-to spot, rating it 4.5 stars across 599 reviews. Open from 5am to 10pm daily, there's plenty of opportunity for dog owners to find a time that works. For variety, the neighborhood offers more dog parks to explore: Pasley Park (1.2 miles) and Rotary Park (1.4 miles)."
  },
  {
    "name": "Platinum Valley Park",
    "street": "7301 S Hughes Ave",
    "city": "Sioux Falls",
    "state": "SD",
    "zip": "57108",
    "latitude": 43.4798577,
    "longitude": -96.7711523,
    "description": "Platinum Valley Park at 7301 S Hughes Ave holds a 4.3-star rating from 52 Sioux Falls dog owner visits. Open from 5am to 10pm daily, dog owners have flexibility to plan a visit with their four-legged friends. More dog parks in the area include The Splash Bark by SDK (3.7 miles) and Spencer Park (3.7 miles)—great options for mixing up your pup's routine."
  },
  {
    "name": "Lien Park",
    "street": "2000 N Cliff Ave",
    "city": "Sioux Falls",
    "state": "SD",
    "zip": "57104",
    "latitude": 43.5676973,
    "longitude": -96.711319,
    "description": "Lien Park (2000 N Cliff Ave) serves dog owners in the Sioux Falls neighborhood looking for a place to visit with their pups. Open from 5am to 10pm daily, the park is accessible for dog owners in the area. Dog owners might also enjoy Lacey Park, another dog park just 0.9 miles away."
  }
]